
/*                 TODO
----------------------------------------------------
----------------------------------------------------
*/
const devHelper = {
  trenVals: {
    waitingInput: true,
    currentAction: 0,
    type: undefined,
    trenEnded: false,
    timers: {
      startLifeTime: '08:00:00',
      lifeTime: '08:00:00',
      allTime: 0,
      allTimeHelper: 0,
      actionTime: 0,
      actionTimeHelper: 0,
      scenarioTime: 0,
      scenarioTimeHelper: 0,
    },
    scenarioArr: [],
    scenario: undefined,
    messages: [],
    ended: false,
    multiAction: [],
  },
  model3DVals: {
    activeControlCamera: true,
    camera: undefined,
    scene: undefined,
    activeMeshs: [],
    tempactiveMeshs: [],
    currentPosition: undefined,
    movePointMesh: [],
    meshUnderPointer: undefined,
    engine: undefined,
    svgDisplays: {
      meshs: [],
      textures: [],
      tagImgs: [],
      svgs: [],
      materials: [],
      svgNames: [],
    },
    cameraPositions: [
      { positionCoordinates: [0.35, 2.15, -3.4], lookAt: [0.1913, -0.0046, 0], position: undefined, name: 'главный вид' },
      { positionCoordinates: [-6.58, 1.12, -0.78], lookAt: [-0.0165, -0.7836, 0], position: 1, name: 'монитор #6 Воздухонагрев' },
      { positionCoordinates: [-6.15, 1.12, -0.33], lookAt: [-0.0165, -0.7836, 0], position: 2, name: 'монитор #5 Воздухонагрев' },
      { positionCoordinates: [-3.56, 1.73, -1], lookAt: [0.5216195764415446, 0.007373100235868478, 0], position: 3, name: 'ПУ №1 – Пульт управления клапанами блока воздухонагревателей конструкции Калугина (БВНК)' },
      { positionCoordinates: [0.06, 1.12, 0.11], lookAt: [-0.017735496836921723, -0.00104686817450884, 0], position: 4, name: 'монитор #2' },
      { positionCoordinates: [0.75, 1.12, 0.01], lookAt: [-0.02523549683692173, 0.3476621849510065, 0], position: 5, name: 'монитор #1' },
      { positionCoordinates: [0.1, 1.22, 0.03], lookAt: [1.077429069342384, -0.3353050130723554, 0], position: 6, name: 'телефон' },
      { positionCoordinates: [0.92, 1.31, -0.05], lookAt: [0.9778930701860019, 1.5707867182903412, 0], position: 7, name: 'рация' },
      { positionCoordinates: [1.77, 1.59, -0.48], lookAt: [1.111833144037235, -0.0018067781465321568, 0], position: 8, name: 'ПУ №2 – Пуль управления бесконусное загрузочное устройство (БЗУ)' },
      { positionCoordinates: [2.96, 1.95, -1.0], lookAt: [0.6879109600288498, 0.001624744992681849, 0], position: 9, name: 'ПУ №3 – Пульт управления основных механизмов доменной печи №6 (ДП-6)' },
    ],
    loadModels: [
      'All',
      'Highlight',
      'Console_BVNK',
      'Console_BZU',
      'Console_DP6',
      'Console_PSODP6',
      'Console_UGKS',
    ],
    activeMeshsToArr: [
      { name: 'PhoneButton', startY: 0.015, endY: 0.0144, duration: 0.15, audio: 'Zvuk_knopok_na_telefone', },
      { name: 'kl022', id: '25408591-8ddd-4b64-a7ad-499aaa995ae6' },
      { name: 'kl021', id: '8d7497bf-6a8b-4906-8a35-1dc986e6e655' },
      { name: 'Rectangle', parentName: 'Lighting' },
      { name: 'Handle_', parentName: 'DP-6', audio: 'Zvuk_tumblera', },
    ],
    movePointMeshToArr: [
      { name: 'Display_flat002', point: 1 },
      { name: 'Display_flat003', point: 2 },
      { name: 'Console_BVNK_highlight', point: 3 },
      { name: 'Display_flat014', point: 4 },
      { name: 'Display_flat015', point: 5 },
      { name: 'Console_BZU_highlight', point: 8 },
      { name: 'Console_DP6_highlight', point: 9 },
    ],
    svgDisplaysArr: [
      { name: 'Display_flat002', svgName: 'BVNK_VNK1' },
      { name: 'Display_flat003', svgName: 'vnk_main' },
      { name: 'Display_flat010', svgName: 'Osnovnye_parametry_DP' },
      { name: 'Display_flat012', svgName: 'vnk_spvg' },
      { name: 'Display_flat014', svgName: 'dp' },
      { name: 'Display_flat015', svgName: 'bzu' },
      { name: 'Display_TV', svgName: 'bzu' },
      { name: 'Display_TV001', svgName: 'dp' },
    ],
    shadowGenMeshes: [
      'Monitor_flat',
      'c4938c6e-adb9-4618-8fe0-76497fa5e0a7',
      '37fef3e1-5618-4f2b-b5cb-3d578cd09d03',
      '73a85a47-56c4-417e-a598-bfe24e209022',
      'Rectangle001',
    ],
    receiveShadowMeshes: [
      'a618e236-5f05-4c16-a5f4-806a8575cd48',
      'c4938c6e-adb9-4618-8fe0-76497fa5e0a7',
      '37fef3e1-5618-4f2b-b5cb-3d578cd09d03',
      '73a85a47-56c4-417e-a598-bfe24e209022',
      'Rectangle001',
    ],
  },
  svgVals: [],
  svgHelpers: [
    {
      name: 'vnk_main', helpers: [
        { x: 1, y: 1, w: 10.5, h: 3, name: 'vnk_main', },
        { x: 11.6, y: 1, w: 10.4, h: 3, name: 'BVNK_VNK1', },
        { x: 22.2, y: 1, w: 10.4, h: 3, name: 'BVNK_VNK2', },
        { x: 32.7, y: 1, w: 10.4, h: 3, name: 'BVNK_VNK3', },
        { x: 43.4, y: 1, w: 10.3, h: 3, name: 'vnk_spvg', },
        { x: 41.5, y: 50, w: 2.7, h: 3.5, forAction: true, id: 'kl029', value: { window: 'O_n_k_na_VNK_posle_1', x: 900, y: 473, } },    // win 29
        { x: 35.9, y: 43.5, w: 2.7, h: 3.5, forAction: true, id: 'kl038', value: { window: 'O_n_k_na_VNK_posle_1', x: 770, y: 440, } },    // win 38
        { x: 48.8, y: 43.5, w: 2.7, h: 3.5, forAction: true, id: 'kl037', value: { window: 'O_n_k_na_VNK_posle_1', x: 1030, y: 440, } },    // win 37
        { x: 48.8, y: 55, w: 2.7, h: 3.5, forAction: true, id: 'kl007', value: { window: 'O_n_k_na_VNK_posle_1', x: 1082, y: 555, } },    // win 07
        { x: 36.2, y: 55, w: 2.7, h: 3.5, forAction: true, id: 'kl028', value: { window: 'O_n_k_na_VNK_posle_1', x: 1082, y: 480, } },    // win 28
      ]
    },
    {
      name: 'vnk_spvg', helpers: [
        { x: 1, y: 1, w: 10.5, h: 3, name: 'vnk_main', },
        { x: 11.6, y: 1, w: 10.4, h: 3, name: 'BVNK_VNK1', },
        { x: 22.2, y: 1, w: 10.4, h: 3, name: 'BVNK_VNK2', },
        { x: 32.7, y: 1, w: 10.4, h: 3, name: 'BVNK_VNK3', },
        { x: 43.4, y: 1, w: 10.3, h: 3, name: 'vnk_spvg', },
      ]
    },
    {
      name: 'BVNK_VNK1', helpers: [
        { x: 1, y: 1, w: 10.5, h: 3, name: 'vnk_main', },
        { x: 11.6, y: 1, w: 10.4, h: 3, name: 'BVNK_VNK1', },
        { x: 22.2, y: 1, w: 10.4, h: 3, name: 'BVNK_VNK2', },
        { x: 32.7, y: 1, w: 10.4, h: 3, name: 'BVNK_VNK3', },
        { x: 43.4, y: 1, w: 10.3, h: 3, name: 'vnk_spvg', },
        { x: 10.1, y: 8.5, w: 7, h: 3, forAction: true, id: 'perekidta_btn', value: { window: 'O_p_n_na_k_p_na_VNK', x: 270, y: 116 } },
      ]
    },
    {
      name: 'BVNK_VNK2', helpers: [
        { x: 1, y: 1, w: 10.5, h: 3, name: 'vnk_main', },
        { x: 11.6, y: 1, w: 10.4, h: 3, name: 'BVNK_VNK1', },
        { x: 22.2, y: 1, w: 10.4, h: 3, name: 'BVNK_VNK2', },
        { x: 32.7, y: 1, w: 10.4, h: 3, name: 'BVNK_VNK3', },
        { x: 43.4, y: 1, w: 10.3, h: 3, name: 'vnk_spvg', },
        { x: 10.1, y: 8.5, w: 7, h: 3, forAction: true, id: 'perekidta_btn', value: { window: 'O_p_n_na_k_p_na_VNK', x: 270, y: 116 } },
      ]
    },
    {
      name: 'BVNK_VNK3', helpers: [
        { x: 1, y: 1, w: 10.5, h: 3, name: 'vnk_main', },
        { x: 11.6, y: 1, w: 10.4, h: 3, name: 'BVNK_VNK1', },
        { x: 22.2, y: 1, w: 10.4, h: 3, name: 'BVNK_VNK2', },
        { x: 32.7, y: 1, w: 10.4, h: 3, name: 'BVNK_VNK3', },
        { x: 43.4, y: 1, w: 10.3, h: 3, name: 'vnk_spvg', },
        { x: 73.5, y: 83.0, w: 2, h: 3, forAction: true, id: 'vn_310_btn', value: { window: 'O_n_k_na_VNK_posle_1', x: 1510, y: 635 }, },  // win 310
        { x: 73.5, y: 76.7, w: 2, h: 3, forAction: true, id: 'vn_318_btn', value: { window: 'O_n_k_na_VNK_posle_1', x: 1510, y: 635 }, },  // win 318
        { x: 65.35, y: 42.9, w: 2, h: 3, forAction: true, id: 'vn_319_btn', value: { window: 'O_n_k_na_VNK_posle_1', x: 1343, y: 450 }, },  // win 319
      ]
    },
    {
      name: 'O_n_k_na_VNK_posle_1', helpers: [
        { x: 61.00, y: 47.2, w: 1.5, h: 2.4, forAction: true, /*name: textureName,*/ id: 'close_w1', removeWindow: 'O_n_k_na_VNK_posle_1', },// TODO сделать по другому
        { x: 53.40, y: 59.1, w: 4.0, h: 2.6, forAction: true, id: 'open_vn', value: { window: 'O_n_k_na_VNK_posle_2', x: 1124, y: 546, } },// open
        { x: 83.80, y: 78.8, w: 8.6, h: 2.6, forAction: true, id: 'win_posle_1_stop_btn', x: 1124, y: 546, },  // stop  //  freeBTN
      ]
    },
    {
      name: 'O_n_k_na_VNK_posle_2', helpers: [
        { x: 60.2, y: 57, w: 3.2, h: 2.4, removeWindow: 'O_n_k_na_VNK_posle_2', forAction: true, id: 'close_vn', }, // close
        { x: 56.5, y: 57, w: 3.2, h: 2.4, removeWindow: 'O_n_k_na_VNK_posle_2', forAction: true, id: 'open_vn1', }, // open
      ]
    },
    {
      name: 'dp', helpers: [
        { x: 94.4, y: 26, w: 4, h: 3, forAction: true, id: 't_r_4', value: { window: 'vvod_znachenij', x: 900, y: 300, } },
        { x: 69.4, y: 90, w: 2.5, h: 4, forAction: true, id: 't_b_302_btn', value: { window: 'win_sym_302', x: 56, y: 48, } },
        { x: 94.4, y: 29.6, w: 4, h: 3, forAction: true, id: 't_r_5', value: { window: 'vvod_znachenij', x: 900, y: 300, } },
      ]
    },
    {
      name: 'win_sym_302', helpers: [
        { x: 45.8, y: 5, w: 1.6, h: 3.3, removeWindow: 'win_sym_302', forAction: true, id: 'ws3_close_btn', }, // close
        { x: 18.65, y: 73, w: 8, h: 5.5, forAction: true, id: 'ws3_ttg_text_btn', },
        { x: 18.65, y: 73, w: 0, h: 0, forAction: true, id: 'ws3_ttg2_text_btn', value: { window: 'priczvuksinal', x: 956, y: 112, } },
      ]
    },
    {
      name: 'vvod_znachenij', helpers: [
        { x: 58.4, y: 30.3, w: 1.5, h: 2, removeWindow: 'vvod_znachenij', forAction: true, id: 'vz_close' },
        { x: 47.6, y: 78.3, w: 4.0, h: 4, removeWindow: 'vvod_znachenij', forAction: true, id: 'vz_ok' },
        { x: 47.7, y: 64.5, w: 3.0, h: 4, forAction: true, id: 'vz_0' },
        { x: 47.7, y: 60, w: 3.0, h: 4, forAction: true, id: 'vz_1' },
        { x: 51.1, y: 60, w: 3.0, h: 4, forAction: true, id: 'vz_2' },
        { x: 54.4, y: 60, w: 3.0, h: 4, forAction: true, id: 'vz_3' },
        { x: 47.7, y: 55, w: 3.0, h: 4, forAction: true, id: 'vz_4' },
        { x: 51.1, y: 55, w: 3.0, h: 4, forAction: true, id: 'vz_5' },
        { x: 54.4, y: 55, w: 3.0, h: 4, forAction: true, id: 'vz_6' },
        { x: 47.7, y: 50.3, w: 3.0, h: 4, forAction: true, id: 'vz_7' },
        { x: 51.1, y: 50.3, w: 3.0, h: 4, forAction: true, id: 'vz_8' },
        { x: 54.4, y: 50.3, w: 3.0, h: 4, forAction: true, id: 'vz_9' }
      ]
    },
    {
      name: 'O_p_n_na_k_p_na_VNK', helpers: [
        { x: 27.2, y: 11.8, w: 2.25, h: 2.6, forAction: true, id: 'perekidta_exit_btn', removeWindow: 'O_p_n_na_k_p_na_VNK', },
        { x: 15.6, y: 29, w: 11.9, h: 3.6, forAction: true, id: 'nagrev_otd2_btn', value: { window: 'O_p_n_na_k_na-o_2_na_VNK', x: 379, y: 32, } },
        { x: 15.6, y: 41.4, w: 11.9, h: 3.6, forAction: true, id: 'otdel_otdel2_btn', value: { window: 'win_otdel2_na_vnk', x: 402, y: 468, } },
      ]
    },
    {
      name: 'priczvuksinal', helpers: [
        { x: 83.1, y: 17.7, w: 5, h: 3, removeWindow: 'priczvuksinal', forAction: true, id: 'pzs_close_btn' },
      ]
    },
    {
      name: 'O_p_n_na_k_na-o_2_na_VNK', helpers: [
        { x: 63.7, y: 3.4, w: 2.4, h: 2.4, removeWindow: 'O_p_n_na_k_na-o_2_na_VNK', forAction: true, id: 'pericNagrev_close_btn' },
        { x: 31.8, y: 94.6, w: 3.4, h: 3.4, forAction: true, id: 'pericNagrev_pusk_btn', value: { window: 'O_n_k_na_VNK_posle_2', x: 678, y: 917 } },
        { x: 35, y: 94.6, w: 3.4, h: 3.4, forAction: true, id: 'pericNagrev_stop_btn' },
        { x: 38.2, y: 94.6, w: 3.4, h: 3.4, forAction: true, id: 'pericNagrev_reset_btn' },
      ]
    },
    {
      name: 'win_otdel2_na_vnk', helpers: [
        { x: 45, y: 48, w: 2.2, h: 2.4, removeWindow: 'win_otdel2_na_vnk', forAction: true, id: 'otdel2_close_btn' },
        { x: 34.5, y: 90, w: 3.8, h: 3.4, forAction: true, id: 'otdel2_pusk_btn', value: { window: 'O_n_k_na_VNK_posle_2', x: 707, y: 908 } },
        { x: 38.3, y: 90, w: 3.8, h: 3.4, forAction: true, id: 'otdel2_stop_btn' },
        { x: 42.1, y: 90, w: 3.8, h: 3.4, forAction: true, id: 'otdel2_reset_btn' },
      ]
    },
    {
      name: 'bzu', helpers: [
        { x: 71.7, y: 67.7, w: 4.5, h: 3.3, forAction: true, id: 'bzu_gruzit_btn' },
        { x: 58.3, y: 35.0, w: 9.8, h: 3.3, forAction: true, id: 'bzu_ZapretSledPorci_btn' },
        { x: 32.1, y: 45.3, w: 4.5, h: 6.1, forAction: true, id: 'bzu_raketaNGUK2_btn' },
        { x: 29.7, y: 53.1, w: 3.9, h: 3.5, forAction: true, id: 'bzu_pause_btn' },
      ]
    },
  ],
  startPos: {
    IF2D: [],
    IF3D: [],
  },
  audio: [],
  //---------------------------
  // Сергей
  testVals: {
    questionsArray: [],
    answersArray: [], // Массив с ответами
    containerArray: [], // Массив с контейнерами вопросов
    previousContainer: undefined, // Предыдущий контейнер вопроса
    dragElement: undefined, // Элемент, который перетаскиваем
    dragElementText: '', // Текст элемента, который перетаскиваем
    dragoverElement: undefined, // Элемент, на который навелись
    dragoverElementText: '', // Текст элемента, на который навелись
    radioSelfcheckHelperText: 'Выберите один вариант и нажмите подтвердить', // Текст хелпера вопросов с радиокнопками
    radioSelfcheckHelperTextMany: 'Выберите несколько вариантов и нажмите подтвердить', // Текст хелпера вопросов с радиокнопками
    dragDropHelperText: 'Переместите каждый ответ в нужную строчку и нажмите подтвердить.', // Текст хелпера вопросов с dragDrop
    dropDownHelperText: 'В выпадающих списках выберите нужный вариант и нажмите подтвердить.', // Текст хелпера вопросов с выпадающими списками
    consecutiveHelperText: 'Переставьте ответы в нужной последовательности и нажмите подтвердить.', // Текст хелпера вопросов с последовательностью
    arrayForCreateTests: [
      { // 1
        questionType: 'radio',
        questionTopic: 'Состав ДП-6',
        questionText: 'В состав доменной печи №6 входит:',
        answers: [
          'Оборудование циклона',
          'Оборудование пылеуловителя',
          'Оборудование газопровода получистогодоменного газа'
        ],
        rightAnswers: ['Оборудование пылеуловителя']
      },
      { // 2
        questionType: 'dragDrop',
        questionTopic: 'Кратковременная остановка ДП-6',
        questionText: 'В состав доменной печи №6 входит:',
        answers:
        {
          0: ['0,6-0,8 кгс/см²', 'открыть атмосферные клапаны'],
          1: ['0,5 кгс/см²', 'закрыть смесительно-предохранительный клапан'],
          2: ['0,3 кгс/см²', 'закрыть отсечной клапан пылеуловителя'],
        },
        rightAnswers:
        {
          0: ['0,6-0,8 кгс/см²', 'открыть атмосферные клапаны'],
          1: ['0,5 кгс/см²', 'закрыть смесительно-предохранительный клапан'],
          2: ['0,3 кгс/см²', 'закрыть отсечной клапан пылеуловителя'],
        },
      },
      { // 3
        questionType: 'radio',
        questionTopic: 'Кратковременная остановка ДП-6',
        questionText: 'В случае подвисания шихты осадку до остановки печи необходимо произвести:',
        answers: [
          'Клапаном «СНОРТ»',
          'Сбросным клапаном №10 на воздухонагревателе в режиме «дутье»',
          'Одновременно двумя способами'
        ],
        rightAnswers: ['Клапаном «СНОРТ»']
      },
      { // 4
        questionType: 'radio',
        questionTopic: 'Кратковременная остановка ДП-6',
        questionText: 'Во время кратковременной остановки печи:',
        answers: [
          'Разрешается прекращать подачу воздуха в воздуховод холодного дуться',
          'Запрещается прекращать подачу воздуха в воздуховод холодного дутья',
          'Уравнительные клапаны и клапаны пылеподавления БЗУ должны быть закрыты',
          'Уравнительные клапаны и клапаны пылеподавления БЗУ должны быть открыты',
          'Выхлопные клапаны БЗУ должны быть закрыты',
          'Выхлопные клапаны БЗУ должны быть открыты',
        ],
        rightAnswers: [
          'Запрещается прекращать подачу воздуха в воздуховод холодного дутья',
          'Уравнительные клапаны и клапаны пылеподавления БЗУ должны быть закрыты',
          'Выхлопные клапаны БЗУ должны быть открыты',
        ]
      },
      { // 5
        questionType: 'dragDrop',
        questionTopic: 'Кратковременная остановка ДП-6',
        questionText: 'При пуске доменной печи №6 после кратковременной остановки для каждого указанного уровня давления горячего дутья необходимо последовательно совершать следующие действия',
        answers:
        {
          0: ['0,2-0,3 кгс/см²', 'закрыть атмосферные клапаны'],
          1: ['0,2-0,3 кгс/см²', 'приоткрывая клапан «СНОРТ» и кольцевые зазоры установить давление'],
          2: ['0,6-0,8 кгс/см²', 'при необходимости открыть смесительно-предохранительный клапан'],
          3: ['0,6-0,8 кгс/см²', 'приоткрывая клапан «СНОРТ» установить давление'],
          4: ['заданное давление и общий перепад в печи', 'закрыть отсечной клапан пылеуловителя'],
        },
        rightAnswers:
        {
          0: ['0,2-0,3 кгс/см²', 'приоткрывая клапан «СНОРТ» установить давление', 'закрыть отсечной клапан пылеуловителя'],
          1: ['0,6-0,8 кгс/см²', 'закрыть атмосферные клапаны', 'при необходимости открыть смесительно-предохранительный клапан'],
          2: ['заданное давление и общий перепад в печи', 'приоткрывая клапан «СНОРТ» и кольцевые зазоры установить давление'],
        },
      },
      { // 6
        questionType: 'dropDownMenu',
        questionTopic: 'Кратковременная остановка ДП-6',
        questionText: 'Для случая длительной остановки доменной печи №6 с зажиганием газа на калошнике выберите верные утверждения:',
        answers:
          [
            'Перед началом остановки газовщик сообщает об этом за insertOptionElem.',
            'Остановка печи производится insertOptionElem выпуска чугуна.',
            'Газовщик проводит остановку доменной печи под руководством insertOptionElem печи.',
            'Перед началом остановки необходимо провести труску колошниковой пыли из insertOptionElem.',
            'При переводе печи на «нормальное давление» газовщик контролирует insertOptionElem снижение давления и расхода дутья.',
            'Нормальное давление – это давление горячего дутья, сохраняющее заданную величину общего перепада при полностью insertOptionElem кольцевых зазорах.',
          ],
        optionContent: [
          ['20-30 минут', '15-20 минут'],
          ['во время', 'в конце'],
          ['мастера печи', 'сменного мастера'],
          ['пылеуловителя', 'циклона'],
          ['одинаковое', 'пропорциональное'],
          ['открытых', 'закрытых'],
        ],
        rightAnswers:
          [
            '20-30 минут', 'в конце', 'сменного мастера',
            'пылеуловителя', 'пропорциональное', 'открытых',
          ],
      },
      { // 7
        questionType: 'dragDrop',
        questionTopic: 'Кратковременная остановка ДП-6',
        questionText: 'При длительной остановке доменной печи №6 при давлении горячего дутья',
        answers:
        {
          0: ['0,6-0,8 кгс/см²', 'закрыть смесительно-предохранительный клапан'],
          1: ['0,5 кгс/см²', 'остановить загрузку печи'],
          2: ['0,2-0,3 кгс/см²', 'установить листовую заглушку в трубопровод азота'],
          3: ['0,2 кгс/см²', 'открыть атмосферные клапаны'],
          4: ['0,1-0,15 кгс/см²', 'закрыть отсечной клапан пылеуловителя'],
        },
        rightAnswers:
        {
          0: ['0,6-0,8 кгс/см²', 'открыть атмосферные клапаны'],
          1: ['0,5 кгс/см²', 'закрыть смесительно-предохранительный клапан'],
          2: ['0,2-0,3 кгс/см²', 'закрыть отсечной клапан пылеуловителя'],
          3: ['0,2 кгс/см²', 'остановить загрузку печи'],
          4: ['0,1-0,15 кгс/см²', 'установить листовую заглушку в трубопровод азота'],
        },
      },
      { // 8 (1)
        questionType: 'radio',
        questionTopic: 'Подготовка к работе',
        questionText: 'Для защиты от вредных веществ в качестве индивидуальных мер защиты используются:',
        answers: [
          'Спецодежда, перчатки и очки',
          'Гигиенический паспорт – полагается для лакокрасочных материалов. В нем указываются наличие вредных веществ, пожароопасность, условия хранения и прочее. Не относится к индивидуальным средствам защиты.',
          'Газозащитная аппаратура',
          'Переносной газоанализатор',
        ],
        rightAnswers: [
          'Спецодежда, перчатки и очки',
          'Газозащитная аппаратура',
          'Переносной газоанализатор',
        ]
      },
      { // 9 (2)
        questionType: 'consecutive',
        questionTopic: 'Подготовка к работе',
        questionText: 'Перед началом работы газовщик должен осуществить следующие действия. ',
        answers: [
          'Проверить исправность оборудования, приспособлений, инструментов, ограждений, блокировочных средств, защитного заземления и пр.',
          'Принять смену',
          'Зарегистрировать данные обхода и об обнаруженных дефектах в соответствующие журналы, доложить мастеру участка обо всех отклонениях в работе.',
          'Провести визуальную проверку технических устройств и средств защиты.',
          'Провести динамическую оценку рисков по методике «5 шагов».',
          'Переодеться в спецодежду',
          'Провести проверку соответствия нормам: концентрации горючих газов в рабочей зоне, предел воспламеняемости, наряды, правильность отключения газопроводов и воздухопроводов, агрегатов и механизмов.',
          'Пройти медицинский осмотр',
          'Провести инструментальную проверку (контроль) параметров оборудования, влияющих на безопасность процесса (с помощью газоанализатора).',
          'Подготовить рабочее место',
        ],
        rightAnswers: [
          'Пройти медицинский осмотр',
          'Переодеться в спецодежду',
          'Принять смену',
          'Подготовить рабочее место',
          'Проверить исправность оборудования, приспособлений, инструментов, ограждений, блокировочных средств, защитного заземления и пр.',
          'Провести инструментальную проверку (контроль) параметров оборудования, влияющих на безопасность процесса (с помощью газоанализатора).',
          'Провести проверку соответствия нормам: концентрации горючих газов в рабочей зоне, предел воспламеняемости, наряды, правильность отключения газопроводов и воздухопроводов, агрегатов и механизмов.',
          'Провести визуальную проверку технических устройств и средств защиты.',
          'Зарегистрировать данные обхода и об обнаруженных дефектах в соответствующие журналы, доложить мастеру участка обо всех отклонениях в работе.',
          'Провести динамическую оценку рисков по методике «5 шагов».',
        ]
      },
      { // 10 (3)
        questionType: 'radio',
        questionTopic: 'Проведение работ',
        questionText: 'При проведении работ газовщик имеет право',
        answers: [
          'Проводить осмотр агрегатов и оборудования в газоопасных местах I и II групп без оформления наряда-пропуска на проведение газоопасных работ с применением газозащитной аппаратуры',
          'Проводить контроль кислорода, оксида углерода или метана без разрешения производственного мастера ДП',
          'Ставить воздухонагреватель на нагрев при неисправности газо-отсекающих клапанов',
          'Проверять утечку газов факелом',
          'Проводить работы по ликвидации аварий до устранения прямой угрозы людям и разрушения оборудования без оформления наряда-пропуска',
          'Проводить работы по ликвидации аварий при сбоях оборудования без разрешения сменного мастера ДП',
        ],
        rightAnswers: [
          'Проводить осмотр агрегатов и оборудования в газоопасных местах I и II групп без оформления наряда-пропуска на проведение газоопасных работ с применением газозащитной аппаратуры',
          'Проводить работы по ликвидации аварий до устранения прямой угрозы людям и разрушения оборудования без оформления наряда-пропуска',
        ]
      },
      { // 11 (4)
        questionType: 'dropDownMenu',
        questionTopic: 'Проведение работ',
        questionText: '',
        answers:
          [
            'Во время выдувки печи температура колошника должна быть не выше insertOptionElem.',
            'Во время выдувки ДП взятие ее на «тягу» insertOptionElem.',
            'При содержании кислорода более 1% во время выдувки печи отсечной клапан пылеуловителя должен быть insertOptionElem.',
            'После полной остановки печи и зажигания газа на колошнике свечи на пылеуловителе insertOptionElem.',
            'До пуска печи все люки на газопроводах должны быть insertOptionElem.',
            'Установка сопел разрешается insertOptionElem приемки воздуха на ДП.',
            'Установка сопел разрешается после создания подпора в воздухопроводе холодного дутья давлением insertOptionElem.',
            'insertOptionElem подается пар или азот в пылеуловитель и уравнительный газопровод.',
          ],
        optionContent: [
          ['400 градусов', '500 градусов'],
          ['допускается', 'не допускается'],
          ['открыт', 'закрыт'],
          ['открываются', 'закрываются'],
          ['открыты', 'закрыты'],
          ['до', 'после'],
          ['0.2-0.3 кгс/м²', '0.1-0.2 кгс/м²'],
          ['Перед пуском', 'После пуска'],
        ],
        rightAnswers:
          [
            '400 градусов', 'не допускается', 'закрыт',
            'открываются', 'закрыты', 'после',
            '0.2-0.3 кгс/м²', 'Перед пуском',
          ],
      },
      { // 12 (1)
        questionType: 'consecutive',
        questionTopic: 'Порядок пуска трубопроводов',
        questionText: 'При пуске холодного дутья ДП №6 последовательность пусковых операций следующая:',
        answers: [
          'Открыть клапан «СНОРТ»',
          'Подача холодного дутья на СНОРТ',
          'Мастер газового хозяйства осматривает трубопровод на предмет отсутствия в нем посторонних предметов.',
          'Закрыть клапана холодного дутья 118, 118а, 218, 218а, 318, 318а.',
          'Контроль окончания работ и команда машинисту ТЭЦ ЭВС или УТЭЦ ЭВС на запуск воздуходувной машины.',
          'Закрыть смесительно-предохранительный клапан №2.',
        ],
        rightAnswers: [
          'Мастер газового хозяйства осматривает трубопровод на предмет отсутствия в нем посторонних предметов.',
          'Закрыть смесительно-предохранительный клапан №2.',
          'Закрыть клапана холодного дутья 118, 118а, 218, 218а, 318, 318а.',
          'Открыть клапан «СНОРТ»',
          'Контроль окончания работ и команда машинисту ТЭЦ ЭВС или УТЭЦ ЭВС на запуск воздуходувной машины.',
          'Подача холодного дутья на СНОРТ',
        ]
      },
      { // 13 (2)
        questionType: 'consecutive',
        questionTopic: 'Порядок пуска трубопроводов',
        questionText: 'При пуске горения ДП №6 последовательность пусковых операций следующая:',
        answers: [
          'Перед пуском транспортнях линий ПУТ осмотреть трубопровод на предмет отсутствия в нем посторонних предметов.',
          'Мастер газового хозяйства осматривает трубопровод на предмет отсутствия в нем посторонних предметов.',
          'Запустить вентиляторы подачи воздуха горения.',
          'Запустить двигатель вентилятора для подачи воздуха к воздухонагревателям.',
          'На вентиляторе открыть клапан на всасе  № OF1, OF2, OF3 руководствуясь нагрузкой на эл. двигателя.',
          'Избиратель управления на ЦПУ ставит клапан №035 в положение «автоматически» для регулирования давления воздуха горения.',
          'На вентиляторе открыть клапан на нагнетение № 0331, 0332, 0333.',
          'Собрать электросхему на воздухонагреватели и перевести их в режим отделение.',
        ],
        rightAnswers: [
          'Мастер газового хозяйства осматривает трубопровод на предмет отсутствия в нем посторонних предметов.',
          'Собрать электросхему на воздухонагреватели и перевести их в режим отделение.',
          'Запустить вентиляторы подачи воздуха горения.',
          'Избиратель управления на ЦПУ ставит клапан №035 в положение «автоматически» для регулирования давления воздуха горения.',
          'Запустить двигатель вентилятора для подачи воздуха к воздухонагревателям.',
          'На вентиляторе открыть клапан на нагнетение № 0331, 0332, 0333.',
          'На вентиляторе открыть клапан на всасе  № OF1, OF2, OF3 руководствуясь нагрузкой на эл. двигателя.',
          'Перед пуском транспортнях линий ПУТ осмотреть трубопровод на предмет отсутствия в нем посторонних предметов.',
        ]
      },
      { // 14 (3)
        questionType: 'consecutive',
        questionTopic: 'Порядок остановки трубопроводов',
        questionText: 'При остановке трубопровода холодного дутья в ремонт последовательность операций следующая:',
        answers: [
          'Дать команду машинисту ТЭЦ ЭВС или УТЭЦ ЭВС на остановку ЭВД',
          'Взять доменную печь на тягу',
          'Через воздухоразгрузочный клапан СНОРТ снизить давление до атмосферного',
        ],
        rightAnswers: [
          'Взять доменную печь на тягу',
          'Дать команду машинисту ТЭЦ ЭВС или УТЭЦ ЭВС на остановку ЭВД',
          'Через воздухоразгрузочный клапан СНОРТ снизить давление до атмосферного',
        ]
      },
      { // 15 (4)
        questionType: 'consecutive',
        questionTopic: 'Порядок остановки трубопроводов',
        questionText: 'При остановке трубопровода горения в ремонт последовательность операций следующая:',
        answers: [
          'Взять ДП на тягу',
          'Через свечу ВГ-1 снизить давление до атмосферного',
          'Остановить вентиляторы подачи воздуха горения',
          'Разобрать электросхему на вентиляторы подачи воздуха горения',
          'Снять воздухонагреватели с нагрева',
        ],
        rightAnswers: [
          'Снять воздухонагреватели с нагрева',
          'Взять ДП на тягу',
          'Остановить вентиляторы подачи воздуха горения',
          'Через свечу ВГ-1 снизить давление до атмосферного',
          'Разобрать электросхему на вентиляторы подачи воздуха горения',
        ]
      },
      { // 16 (5)
        questionType: 'consecutive',
        questionTopic: 'Порядок остановки трубопроводов',
        questionText: 'При аварийной остановке оборудования последовательность операций следующая:',
        answers: [
          'Снять воздухонагреватели с нагрева',
          'Остановить ДП. В случае несрабатывания клапана аварийного поддува, при необходимости открыть клапан СНОРТ, руководствуясь состоянием фурменных приборов.',
          'Клапан СНОРТ не открывать, т.к. в печь должен поступать воздух от сетей комбината 1200-1500 м³/ч, который создаст давление на фурмах 0,3-0,4 кгс/см²',
          'Остановить УГКС',
          'Открыть выпуск чугуна',
          'Закрыть природный газ на вдувание в ДП на фурмах вентилями ПВ 1/3 – ПВ 32/3 и на коллекторе задвижкой ПВ 721, открыть ПВ 723',
        ],
        rightAnswers: [
          'Открыть выпуск чугуна',
          'Клапан СНОРТ не открывать, т.к. в печь должен поступать воздух от сетей комбината 1200-1500 м³/ч, который создаст давление на фурмах 0,3-0,4 кгс/см²',
          'Остановить УГКС',
          'Закрыть природный газ на вдувание в ДП на фурмах вентилями ПВ 1/3 – ПВ 32/3 и на коллекторе задвижкой ПВ 721, открыть ПВ 723',
          'Снять воздухонагреватели с нагрева',
          'Остановить ДП. В случае несрабатывания клапана аварийного поддува, при необходимости открыть клапан СНОРТ, руководствуясь состоянием фурменных приборов.',
        ]
      },

    ],
  },
  //---------------------------
  dev: {
    enable: true,
    perfomance: undefined,
    intervalFon: undefined,
  },
  endVals: {
    passPerc: 0, // TODO: понять как вычислять проценты
    errors: [0, 11, 38, 29, 16, 21], // TODO: понять разделять все дейтсвия на этапы
    averangeTime: [965, 840, 25 * 60, 24 * 60, 7 * 60], // 965, 840, 25 * 60, 24 * 60, 7 * 60
    humanTime: [19 * 60, 10 * 60, 17 * 60, 11 * 60, 5 * 60],
    charts: [],
  }
};

/* TODO --------------------------------------------------------------------------------------------------------------
--------------------------------------------------------------------------------------------------------------*/

/*
Пример мультидействия с 3Д
{ 
  scenarioText: 'Тест непоследовательных действий',
  sender: 'Газовщик',
  multi: [
    {
      text: '1. .',
      sender: 'Газовщик',    
      action: {
        target3D: 'PhoneButton001',
      },
      audio: 'tts-vo1',
    },
    {
      text: '2. ',
      sender: 'Газовщик',
      action: {
        target3D: 'PhoneButton006',
      },
      audio: 'tts-vo1',
    },
    {
      text: '3. ',
      sender: 'Газовщик',
      action: {
        target3D: 'PhoneButton017',
      },
      audio: 'tts-vo1',
    },
    {
      text: '4. ',
      sender: 'Газовщик',
      action: {
        target3D: 'PhoneButton020',
      },
      audio: 'tts-vo1',
    }
  ],
  startTime: timeDiff + 1,
  human: true,
},
*/

const timeDiff = -224;
let tempActions = [
  // Первый сценарий  // MAIN ALL
  [
    /*
        {
          text: 'Отделить подогреватель воздуха и газа.',
          sender: 'Система',
          lifeTime: '07:30:00',
          startTime: timeDiff + 0.1,
        },
        {
          scenarioText: 'Открыть клапан 029 на дымовую трубу.',
          sender: 'Система',
          audio: 'tts-1',
          startTime: timeDiff + 4,
        },
        ////--------------------------------1----------------------------------------
        {
          action: {
            target2D: 'kl029',
            window2D: {
              elements: [
                { name: 'title_work_vn', text: 'Управление клапаном 029' },
                { name: 'status_window_text', text: 'Нет данных' },
                { name: 'btn_open', color: '#FFFFFF', stroke: '#000000' },
                { name: 'polozenie_text', text: '51' },
                { name: 'polozenie_button_text', color: '#000000' },
                { name: 'left_vn', color: '#8F8F8F' },
                { name: 'right_vn', color: '#8F8F8F' },
                { name: 'circle_1_kl029', stroke: '#8F8F8F' },
                { name: 'circle_2_kl029', stroke: '#8F8F8F' },
                { name: 'circle_1_win1', stroke: '#8F8F8F' },
                { name: 'circle_2_win1', stroke: '#8F8F8F' },
              ],
            },
          },
          startTime: timeDiff + 4.1,
          human: true,
          concentration: [
            { text: 'Клапан 029', x: 41, y: 48, w: 3, h: 6.5, position: [1], scheme: 'vnk_main' },
          ]
        },
    
        // открыть
        {
          action: {
            target2D: 'open_vn',
            window2D: {
              elements: [
                { name: 'title_open_vn', text: 'Открыть' },
              ],
            },
          },
          startTime: timeDiff + 4.2,
          human: true,
        },
        // да
        {
    
          action: {
            target2D: 'open_vn1',
          },
          startTime: timeDiff + 4.4,
          human: true,
        },
        
        // мигание
        {
          action: {
            window2D: {
              elements: [
                { name: 'status_window_text', text: 'Открывается' },
                { name: 'polozenie_text', text: '55' },
                { name: 'left_vn', color: '#00FF00' },
                { name: 'right_vn', color: '#00FF00' },
                { name: 'kl029', color: '#00FF00' },
                { name: 'kl029_proc', text: '55' },
                { name: 'circle_1_kl029', stroke: '#00FF00' },
                { name: 'circle_2_kl029', stroke: '#00FF00' },
    
                { name: 'circle_1_win1', stroke: '#00FF00' },
                { name: 'circle_2_win1', stroke: '#00FF00' },
              ],
            },
          },
          startTime: timeDiff + 5,
        }, {
          action: {
            window2D: {
              elements: [
                { name: 'kl029', color: '#8F8F8F' },
                { name: 'kl029_proc', text: '65' },
                { name: 'polozenie_text', text: '65' },
                { name: 'left_vn', color: '#8F8F8F' },
                { name: 'right_vn', color: '#8F8F8F' },
                { name: 'circle_1_kl029', stroke: '#8F8F8F' },
                { name: 'circle_2_kl029', stroke: '#8F8F8F' },
    
                { name: 'circle_1_win1', stroke: '#8F8F8F' },
                { name: 'circle_2_win1', stroke: '#8F8F8F' },
              ],
            },
          },
          startTime: timeDiff + 6,
        }, {
          action: {
            window2D: {
              elements: [
                { name: 'kl029', color: '#00FF00' },
                { name: 'kl029_proc', text: '75' },
                { name: 'polozenie_text', text: '75' },
                { name: 'left_vn', color: '#00FF00' },
                { name: 'right_vn', color: '#00FF00' },
                { name: 'circle_1_kl029', stroke: '#00FF00' },
                { name: 'circle_2_kl029', stroke: '#00FF00' },
                { name: 'circle_1_win1', stroke: '#00FF00' },
                { name: 'circle_2_win1', stroke: '#00FF00' },
              ],
            },
          },
          startTime: timeDiff + 7,
        }, {
          action: {
            window2D: {
              elements: [
                { name: 'kl029', color: '#8F8F8F' },
                { name: 'kl029_proc', text: '85' },
                { name: 'polozenie_text', text: '85' },
                { name: 'left_vn', color: '#8F8F8F' },
                { name: 'right_vn', color: '#8F8F8F' },
                { name: 'circle_1_kl029', stroke: '#8F8F8F' },
                { name: 'circle_2_kl029', stroke: '#8F8F8F' },
                { name: 'circle_1_win1', stroke: '#8F8F8F' },
                { name: 'circle_2_win1', stroke: '#8F8F8F' },
              ],
            },
          },
          startTime: timeDiff + 8,
        }, {
          action: {
            window2D: {
              elements: [
                { name: 'status_window_text', text: 'Открыт' },
                { name: 'kl029', color: '#00FF00' },
                { name: 'kl029_proc', text: '100' },
                { name: 'polozenie_text', text: '100' },
                { name: 'polozenie_button_text', color: '#6E6E6E' },        //  #6E6E6E //  #000;
                { name: 'btn_open', color: '#E6E6E6', stroke: '#C4C4C4' },  //  #C4C4C4 //  #fff
                { name: 'left_vn', color: '#00FF00' },
                { name: 'right_vn', color: '#00FF00' },
                { name: 'circle_1_kl029', stroke: '#00FF00' },
                { name: 'circle_2_kl029', stroke: '#00FF00' },
                { name: 'circle_1_win1', stroke: '#00FF00' },
                { name: 'circle_2_win1', stroke: '#00FF00' },
              ],
            },
          },
          startTime: timeDiff + 9,
        },
        ////--------------------------------2----------------------------------------
        {
          text: 'Клапан 029 на дымовую трубу открыт.',
          scenarioText: 'Закрыть клапан 038 на подогреватель газа.',
          sender: 'Система',
          audio: 'tts-2',
          startTime: timeDiff + 10,
        },
        {
          action: {
            target2D: 'close_w1',
          },
          startTime: timeDiff + 14, 
          human: true,
        },
        
        //// клик по ВН38 на схеме  ОТКРЫТ
        {
          action: {
            target2D: 'kl038',
            window2D: {
              elements: [
                { name: 'title_work_vn', text: 'Управление клапаном 038' },
                { name: 'status_window_text', text: 'Открыт' },
                { name: 'btn_open', color: '#FFFFFF', stroke: '#000000' },
                { name: 'polozenie_text', text: '100' },
                { name: 'polozenie_button_text', color: '#6E6E6E' },        //  #6E6E6E //  #000;
                { name: 'btn_open', color: '#E6E6E6', stroke: '#C4C4C4' },  //  #C4C4C4 //  #fff
                { name: 'left_vn', color: '#00FF00' },
                { name: 'right_vn', color: '#00FF00' },
                { name: 'circle_1_kl038', stroke: '#00FF00' },
                { name: 'circle_2_kl038', stroke: '#00FF00' },
              ],
            },
            helper2D: [
              { x: 54.5, y: 44.0, w: 1.7, h: 2.5, id: 'close_w1' },
              { x: 51.3, y: 56.1, w: 4, h: 2.5, id: 'open_vn' },     //  win 1
            ]
          },
          startTime: timeDiff + 14.1,
          human: true,
        },
        // окно ВН
        {
          action: {
            target2D: 'open_vn',
            window2D: {
              newPositionWindow: {  //  wind 2
                x: 942,
                y: 580
              },
              elements: [
                { name: 'title_open_vn', text: 'Закрыть' },
              ],
            },
            helper2D: [
              { x: 51.18, y: 60.6, w: 3.2, h: 2.5, id: 'close_vn' },   //  wind 2
              { x: 47.50, y: 60.6, w: 3.3, h: 2.5, id: 'open_vn1' },
            ]
          },
          startTime: timeDiff + 14.2,
          human: true,
        },
        // маленькое окошко ОК
        {
          action: {
            target2D: 'open_vn1',
            helper2D: [
              { x: 54.5, y: 44.0, w: 1.7, h: 2.5, id: 'close_w1' },
              { x: 51.3, y: 56.1, w: 0, h: 2.5, id: 'open_vn' }, 
            ]
          },
          startTime: timeDiff + 14.3,
          human: true,
        },
        // мигание 
        {
          action: {
            window2D: {
              elements: [
                { name: 'status_window_text', text: 'Закрывается' },
                { name: 'btn_open', color: '', stroke: '' },
                { name: 'polozenie_text', text: '45' },
                { name: 'kl038_proc', text: '45' },
                { name: 'left_vn', color: '#ff1e00' },
                { name: 'right_vn', color: '#ff1e00' },
                { name: 'kl038', color: '#ff1e00' },
                { name: 'circle_1_kl038', stroke: '#ff1e00' },
                { name: 'circle_2_kl038', stroke: '#ff1e00' },
                { name: 'circle_1_win1', stroke: '#ff1e00' },
                { name: 'circle_2_win1', stroke: '#ff1e00' },
              ],
            },
            helper2D: [
              { x: 54.5, y: 44.0, w: 1.7, h: 2.5, id: 'close_w1' },
              { x: 51.3, y: 56.1, w: 4, h: 2.5, id: 'open_vn' },     //  win 1
            ]
          },
          startTime: timeDiff + 15,
        }, {
          action: {
            window2D: {
              elements: [
                { name: 'kl038_proc', text: '35' },
                { name: 'polozenie_text', text: '35' },
                { name: 'kl038', color: '#8F8F8F' },
                { name: 'left_vn', color: '#8F8F8F' },
                { name: 'right_vn', color: '#8F8F8F' },
                { name: 'circle_1_kl038', stroke: '#8F8F8F' },
                { name: 'circle_2_kl038', stroke: '#8F8F8F' },
                { name: 'circle_1_win1', stroke: '#8F8F8F' },
                { name: 'circle_2_win1', stroke: '#8F8F8F' },
              ],
            },
            helper2D: [
              { x: 54.5, y: 44.0, w: 1.7, h: 2.5, id: 'close_w1' },
              { x: 51.3, y: 56.1, w: 4, h: 2.5, id: 'open_vn' },     //  win 1
            ]
          },
          startTime: timeDiff + 16,
        }, {
          action: {
            window2D: {
              elements: [
                { name: 'kl038', color: '#ff1e00' },
                { name: 'kl038_proc', text: '25' },
                { name: 'polozenie_text', text: '25' },
                { name: 'left_vn', color: '#ff1e00' },
                { name: 'right_vn', color: '#ff1e00' },
                { name: 'circle_1_kl038', stroke: '#ff1e00' },
                { name: 'circle_2_kl038', stroke: '#ff1e00' },
                { name: 'circle_1_win1', stroke: '#ff1e00' },
                { name: 'circle_2_win1', stroke: '#ff1e00' },
              ],
            },
            helper2D: [
              { x: 54.5, y: 44.0, w: 1.7, h: 2.5, id: 'close_w1' },
              { x: 51.3, y: 56.1, w: 4, h: 2.5, id: 'open_vn' },     //  win 1
            ]
          },
          startTime: timeDiff + 17,
        }, {
          action: {
            window2D: {
              elements: [
                { name: 'kl038', color: '#8F8F8F' },
                { name: 'kl038_proc', text: '15' },
                { name: 'polozenie_text', text: '15' },
                { name: 'left_vn', color: '#8F8F8F' },
                { name: 'right_vn', color: '#8F8F8F' },
                { name: 'circle_1_kl038', stroke: '#8F8F8F' },
                { name: 'circle_2_kl038', stroke: '#8F8F8F' },
                { name: 'circle_1_win1', stroke: '#8F8F8F' },
                { name: 'circle_2_win1', stroke: '#8F8F8F' },
              ],
            },
            helper2D: [
              { x: 54.5, y: 44.0, w: 1.7, h: 2.5, id: 'close_w1' },
              { x: 51.3, y: 56.1, w: 4, h: 2.5, id: 'open_vn' },     //  win 1
            ]
          },
          startTime: timeDiff + 18,
        },
        // конечное состояние
        {
          action: {
            window2D: {
              elements: [
                { name: 'kl038', color: '#ff1e00' },
                { name: 'kl038_proc', text: '0' },
                { name: 'polozenie_text', text: '0' },
                { name: 'status_window_text', text: 'Закрыт' },
                { name: 'polozenie_button_text', color: '#000' },        //  #6E6E6E //  #000;
                { name: 'btn_open', color: '#fff', stroke: '#000' },  //  #C4C4C4 //  #fff       //  #000
                { name: 'left_vn', color: '#ff1e00' },
                { name: 'right_vn', color: '#ff1e00' },
                { name: 'circle_1_kl038', stroke: '#ff1e00' },
                { name: 'circle_2_kl038', stroke: '#ff1e00' },
                { name: 'circle_1_win1', stroke: '#ff1e00' },
                { name: 'circle_2_win1', stroke: '#ff1e00' },
              ],
            },
            helper2D: [
              { x: 54.5, y: 44.0, w: 1.7, h: 2.5, id: 'close_w1' },
            ]
          },
          startTime: timeDiff + 19,
        },
    
        ////--------------------------------3----------------------------------------
        // ЧАТ
        {
          text: 'Клапан 038 на подогреватель газа закрыт.',
          scenarioText: 'Закрыть клапан 037 на подогреватель газа.',
          sender: 'Система',
          audio: 'tts-3',
          action: {
            helper2D: [
              { x: 54.5, y: 44.0, w: 1.7, h: 2.5, id: 'close_w1' },
            ]
          },
          startTime: timeDiff + 20,
        },
    
        // закрыть окно ВН
        {
          sender: 'Система',
          action: {
            target2D: 'close_w1',
          },
          startTime: timeDiff + 21,
          human: true,
        },
        //// клик по ВН37 на схеме  НЕТ ДАННЫХ
        {
          action: {
            target2D: 'kl037',
            window2D: {
              elements: [
                { name: 'title_work_vn', text: 'Управление клапаном 037' },
                { name: 'status_window_text', text: 'Нет данных' },
                { name: 'polozenie_text', text: '65' },
                { name: 'polozenie_button_text', color: '#000000' },
                { name: 'btn_open', color: '#FFFFFF', stroke: '#000000' },
    
                { name: 'left_vn', color: '#8F8F8F' },
                { name: 'right_vn', color: '#8F8F8F' },
                { name: 'circle_1_kl037', stroke: '#8F8F8F' },
                { name: 'circle_2_kl037', stroke: '#8F8F8F' },
                { name: 'circle_1_win1', stroke: '#8F8F8F' },
                { name: 'circle_2_win1', stroke: '#8F8F8F' },
              ],
            },
            helper2D: [
              { x: 67.4, y: 44.2, w: 1.7, h: 2.5, id: 'close_w1' },
              { x: 64.4, y: 56.1, w: 4.0, h: 2.5, id: 'open_vn' },     //  win 1
            ]
          },
          // lifeTime: '10:00:00',
          startTime: timeDiff + 21.1,
          human: true,
        },
        // окно ВН
        {
          action: {
            target2D: 'open_vn',
            window2D: {
              newPositionWindow: {  //  wind 2
                x: 1200,
                y: 580
              },
              elements: [
                { name: 'title_open_vn', text: 'Закрыть' },
              ],
            },
            helper2D: [
              { x: 64, y: 60.6, w: 3.2, h: 2.5, id: 'close_vn' },   //  wind 2
              { x: 60.3, y: 60.6, w: 3.3, h: 2.5, id: 'open_vn1' },
            ]
          },
          startTime: timeDiff + 21.2,
          human: true,
        },
        // маленькое окошко ОК
        {
          action: {
            target2D: 'open_vn1',
            helper2D: [
              { x: 67.4, y: 44.2, w: 1.7, h: 2.5, id: 'close_w1' },
              { x: 59.9, y: 56.1, w: 4.0, h: 2.5, id: 'open_vn' },     //  win 1
            ]
          },
          startTime: timeDiff + 21.3,
          human: true,
        },
        // мигание 
        {
          action: {
            window2D: {
              elements: [
                { name: 'status_window_text', text: 'Закрывается' },
                { name: 'btn_open', color: '', stroke: '' },
                { name: 'polozenie_text', text: '45' },
                { name: 'kl037_proc', text: '45' },
                { name: 'left_vn', color: '#ff1e00' },
                { name: 'right_vn', color: '#ff1e00' },
                { name: 'kl037', color: '#ff1e00' },
                { name: 'circle_1_kl037', stroke: '#ff1e00' },
                { name: 'circle_2_kl037', stroke: '#ff1e00' },
                { name: 'circle_1_win1', stroke: '#ff1e00' },
                { name: 'circle_2_win1', stroke: '#ff1e00' },
              ],
            },
            helper2D: [
              { x: 67.4, y: 44.2, w: 1.7, h: 2.5, id: 'close_w1' },
              { x: 59.9, y: 56.1, w: 4.0, h: 2.5, id: 'open_vn' },     //  win 1
            ]
          },
          startTime: timeDiff + 22,
        }, {
          action: {
            window2D: {
              elements: [
                { name: 'kl037_proc', text: '35' },
                { name: 'polozenie_text', text: '35' },
                { name: 'kl037', color: '#8F8F8F' },
                { name: 'left_vn', color: '#8F8F8F' },
                { name: 'right_vn', color: '#8F8F8F' },
                { name: 'circle_1_kl037', stroke: '#8F8F8F' },
                { name: 'circle_2_kl037', stroke: '#8F8F8F' },
                { name: 'circle_1_win1', stroke: '#8F8F8F' },
                { name: 'circle_2_win1', stroke: '#8F8F8F' },
              ],
            },
            helper2D: [
              { x: 67.4, y: 44.2, w: 1.7, h: 2.5, id: 'close_w1' },
              { x: 59.9, y: 56.1, w: 4.0, h: 2.5, id: 'open_vn' },     //  win 1
            ]
          },
          startTime: timeDiff + 23,
        }, {
          action: {
            window2D: {
              elements: [
                { name: 'kl037_proc', text: '25' },
                { name: 'polozenie_text', text: '25' },
                { name: 'kl037', color: '#ff1e00' },
                { name: 'left_vn', color: '#ff1e00' },
                { name: 'right_vn', color: '#ff1e00' },
                { name: 'circle_1_kl037', stroke: '#ff1e00' },
                { name: 'circle_2_kl037', stroke: '#ff1e00' },
                { name: 'circle_1_win1', stroke: '#ff1e00' },
                { name: 'circle_2_win1', stroke: '#ff1e00' },
    
              ],
            },
            helper2D: [
              { x: 67.4, y: 44.2, w: 1.7, h: 2.5, id: 'close_w1' },
              { x: 59.9, y: 56.1, w: 4.0, h: 2.5, id: 'open_vn' },     //  win 1
            ]
          },
          startTime: timeDiff + 24,
        }, {
          action: {
            window2D: {
              elements: [
                { name: 'kl037', color: '#8F8F8F' },
                { name: 'kl037_proc', text: '15' },
                { name: 'polozenie_text', text: '15' },
                { name: 'left_vn', color: '#8F8F8F' },
                { name: 'right_vn', color: '#8F8F8F' },
                { name: 'circle_1_kl037', stroke: '#8F8F8F' },
                { name: 'circle_2_kl037', stroke: '#8F8F8F' },
                { name: 'circle_1_win1', stroke: '#8F8F8F' },
                { name: 'circle_2_win1', stroke: '#8F8F8F' },
              ],
            },
            helper2D: [
              { x: 67.4, y: 44.2, w: 1.7, h: 2.5, id: 'close_w1' },
              { x: 59.9, y: 56.1, w: 4.0, h: 2.5, id: 'open_vn' },     //  win 1
            ]
          },
          startTime: timeDiff + 25,
        },
        // конечное состояние
        {
          action: {
            window2D: {
              elements: [
                { name: 'kl037', color: '#ff1e00' },
                { name: 'kl037_proc', text: '0' },
                { name: 'polozenie_text', text: '0' },
                { name: 'status_window_text', text: 'Закрыт' },
                { name: 'polozenie_button_text', color: '#000' },        //  #6E6E6E //  #000;
                { name: 'btn_open', color: '#fff', stroke: '#000' },  //  #C4C4C4 //  #fff       //  #000
                { name: 'left_vn', color: '#ff1e00' },
                { name: 'right_vn', color: '#ff1e00' },
                { name: 'circle_1_kl037', stroke: '#ff1e00' },
                { name: 'circle_2_kl037', stroke: '#ff1e00' },
                { name: 'circle_1_win1', stroke: '#ff1e00' },
                { name: 'circle_2_win1', stroke: '#ff1e00' },
              ],
            },
            helper2D: [
              { x: 67.4, y: 44.2, w: 1.7, h: 2.5, id: 'close_w1' },
              { x: 59.9, y: 56.1, w: 4.0, h: 2.5, id: 'open_vn' },     //  win 1
            ]
          },
          startTime: timeDiff + 26,
        },
    
        // ЧАТ
        {
          text: 'Клапан 037 на подогреватель газа закрыт.',
          scenarioText: 'Закрыть клапан 007 на подогреватель воздуха.',
          sender: 'Система',
          audio: 'tts-4',
          startTime: timeDiff + 27,
        },
        {
          action: {
            target2D: 'close_w1',
          },
          startTime: timeDiff + 28,
          human: true,
        },
    
        //// клик по ВН07 на схеме  ОТКРЫТ
        {
          action: {
            target2D: 'kl007',
            window2D: {
              newPositionWindow: {
                x: 1030,
                y: 557
              },
              elements: [
                { name: 'title_work_vn', text: 'Управление клапаном 007' },
                { name: 'status_window_text', text: 'Открыт' },
                { name: 'polozenie_text', text: '100' },
                { name: 'polozenie_button_text', color: '#6E6E6E' },
                { name: 'btn_open', color: '#E6E6E6', stroke: '#C4C4C4' },
                { name: 'left_vn', color: '#00FF00' },
                { name: 'right_vn', color: '#00FF00' },
                { name: 'circle_1_kl007', stroke: '#00FF00' },
                { name: 'circle_2_kl007', stroke: '#00FF00' },
                { name: 'circle_1_win1', stroke: '#00FF00' },
                { name: 'circle_2_win1', stroke: '#00FF00' },
              ],
            },
            helper2D: [
              { x: 67.5, y: 56, w: 1.5, h: 2.6, id: 'close_w1' },
              { x: 64.3, y: 67.8, w: 4.0, h: 2.6, id: 'open_vn' },     //  win 1   // ХЗ почему не двигается // Бывает проскакивает по времени МБ 
            ]
          },
          startTime: timeDiff + 29,
          human: true,
        },
        // окно ВН
        {
          action: {
            target2D: 'open_vn',
            window2D: {
              newPositionWindow: {
                x: 1208,
                y: 995 - 292
              },
              elements: [
                { name: 'title_open_vn', text: 'Закрыть' },
              ],
            },
            helper2D: [
              { x: 64.4, y: 73, w: 3.2, h: 2.5, id: 'close_vn' },
              { x: 60.8, y: 73, w: 3.3, h: 2.5, id: 'open_vn1' },  //  wind 2
            ]
          },
          startTime: timeDiff + 29.1,
          human: true,
        },
        // маленькое окошко ОК
        {
          action: {
            target2D: 'open_vn1',
            helper2D: [
              { x: 67.5, y: 56, w: 1.5, h: 2.6, id: 'close_w1' },
              { x: 64.3, y: 67.8, w: 4.0, h: 2.6, id: 'open_vn' },     //  win 1   // ХЗ почему не двигается // Бывает проскакивает по времени МБ 
            ]
          },
          startTime: timeDiff + 29.2,
          human: true,
        },
        // мигание 
        {
          action: {
            window2D: {
              elements: [
                { name: 'status_window_text', text: 'Закрывается' },
                { name: 'polozenie_text', text: '45' },
                { name: 'kl007_proc', text: '45' },
                { name: 'kl007', color: '#ff1e00' },
                { name: 'left_vn', color: '#ff1e00' },
                { name: 'right_vn', color: '#ff1e00' },
                { name: 'circle_1_kl007', stroke: '#ff1e00' },
                { name: 'circle_2_kl007', stroke: '#ff1e00' },
                { name: 'circle_1_win1', stroke: '#ff1e00' },
                { name: 'circle_2_win1', stroke: '#ff1e00' },
              ],
            },
            helper2D: [
              { x: 67.5, y: 56, w: 1.5, h: 2.6, id: 'close_w1' },
              { x: 64.3, y: 67.8, w: 4.0, h: 2.6, id: 'open_vn' },     //  win 1   // ХЗ почему не двигается // Бывает проскакивает по времени МБ 
            ]
          },
          startTime: timeDiff + 30,
        }, {
          action: {
            window2D: {
              elements: [
                { name: 'kl007_proc', text: '35' },
                { name: 'kl007', color: '#8F8F8F' },
                { name: 'polozenie_text', text: '35' },
                { name: 'left_vn', color: '#8F8F8F' },
                { name: 'right_vn', color: '#8F8F8F' },
                { name: 'circle_1_kl007', stroke: '#8F8F8F' },
                { name: 'circle_2_kl007', stroke: '#8F8F8F' },
    
                { name: 'circle_1_win1', stroke: '#8F8F8F' },
                { name: 'circle_2_win1', stroke: '#8F8F8F' },
              ],
            },
            helper2D: [
              { x: 67.5, y: 56, w: 1.5, h: 2.6, id: 'close_w1' },
              { x: 64.3, y: 67.8, w: 4.0, h: 2.6, id: 'open_vn' },     //  win 1   // ХЗ почему не двигается // Бывает проскакивает по времени МБ 
            ]
          },
          startTime: timeDiff + 31,
        }, {
          action: {
            window2D: {
              elements: [
                { name: 'kl007', color: '#ff1e00' },
                { name: 'kl007_proc', text: '25' },
                // { name: 'polozenie_text', text: '25' },
                { name: 'left_vn', color: '#ff1e00' },
                { name: 'right_vn', color: '#ff1e00' },
                { name: 'circle_1_kl007', stroke: '#ff1e00' },
                { name: 'circle_2_kl007', stroke: '#ff1e00' },
                { name: 'circle_1_win1', stroke: '#ff1e00' },
                { name: 'circle_2_win1', stroke: '#ff1e00' },
              ],
            },
            helper2D: [
              { x: 67.5, y: 56, w: 1.5, h: 2.6, id: 'close_w1' },
              { x: 64.3, y: 67.8, w: 4.0, h: 2.6, id: 'open_vn' },     //  win 1   // ХЗ почему не двигается // Бывает проскакивает по времени МБ 
            ]
          },
          startTime: timeDiff + 32,
        }, {
          action: {
            window2D: {
              elements: [
                { name: 'kl007', color: '#8F8F8F' },
                { name: 'kl007_proc', text: '15' },
                { name: 'polozenie_text', text: '15' },
                { name: 'left_vn', color: '#8F8F8F' },
                { name: 'right_vn', color: '#8F8F8F' },
                { name: 'circle_1_kl007', stroke: '#8F8F8F' },
                { name: 'circle_2_kl007', stroke: '#8F8F8F' },
                { name: 'circle_1_win1', stroke: '#8F8F8F' },
                { name: 'circle_2_win1', stroke: '#8F8F8F' },
              ],
            },
            helper2D: [
              { x: 67.5, y: 56, w: 1.5, h: 2.6, id: 'close_w1' },
              { x: 64.3, y: 67.8, w: 4.0, h: 2.6, id: 'open_vn' },     //  win 1   // ХЗ почему не двигается // Бывает проскакивает по времени МБ 
            ]
          },
          startTime: timeDiff + 33,
        },
        // конечное состояние
        {
          action: {
            window2D: {
              elements: [
                { name: 'kl007', color: '#ff1e00' },
                { name: 'kl007_proc', text: '0' },
                { name: 'polozenie_text', text: '0' },
                { name: 'status_window_text', text: 'Закрыт' },
                { name: 'polozenie_button_text', color: '#000' },        //  #6E6E6E //  #000;
                { name: 'btn_open', color: '#fff', stroke: '#000' },  //  #C4C4C4 //  #fff       //  #000
                { name: 'left_vn', color: '#ff1e00' },
                { name: 'right_vn', color: '#ff1e00' },
                { name: 'circle_1_kl007', stroke: '#ff1e00' },
                { name: 'circle_2_kl007', stroke: '#ff1e00' },
                { name: 'circle_1_win1', stroke: '#ff1e00' },
                { name: 'circle_2_win1', stroke: '#ff1e00' },
              ],
            },
            helper2D: [
              { x: 67.5, y: 56, w: 1.5, h: 2.6, id: 'close_w1' },
              { x: 64.3, y: 67.8, w: 4.0, h: 2.6, id: 'open_vn' },     //  win 1   // ХЗ почему не двигается // Бывает проскакивает по времени МБ 
            ]
          },
          startTime: timeDiff + 34,
        },
        // ЧАТ
        {
          text: 'Клапан 007 на подогреватель газа закрыт.',
          scenarioText: 'Закрыть клапан 028 на подогреватель воздуха.',
          sender: 'Система',
          audio: 'tts-5',
          action: {
            helper2D: [
              { x: 67.5, y: 56, w: 1.5, h: 2.6, id: 'close_w1' },
              { x: 64.3, y: 67.8, w: 4.0, h: 2.6, id: 'open_vn' },     //  win 1   // ХЗ почему не двигается // Бывает проскакивает по времени МБ 
            ]
          },
          startTime: timeDiff + 35,
        },
        ////--------------------------------5----------------------------------------
        // закрыть окно ВН
        {
          action: {
            target2D: 'close_w1',
          },
          startTime: timeDiff + 36,
          human: true,
        },
        //// клик по ВН28 на схеме  ОТКРЫТ
        {
          action: {
            target2D: 'kl028',
            window2D: {
              newPositionWindow: {
                x: 776,
                y: 544
              },
              elements: [
                { name: 'title_work_vn', text: 'Управление клапаном 028' },
                { name: 'circle_1_kl028', stroke: '#00FF00' },
                { name: 'circle_2_kl028', stroke: '#00FF00' },
                { name: 'status_window_text', text: 'Открыт' },
                { name: 'polozenie_text', text: '100' },
                { name: 'polozenie_button_text', color: '#6E6E6E' },
                { name: 'btn_open', color: '#E6E6E6', stroke: '#C4C4C4' },
                { name: 'left_vn', color: '#00FF00' },
                { name: 'right_vn', color: '#00FF00' },
                { name: 'circle_1_win1', stroke: '#00FF00' },
                { name: 'circle_2_win1', stroke: '#00FF00' },
              ],
    
            },
            helper2D: [
              { x: 54.80, y: 54.5, w: 1.5, h: 2.6, id: 'close_w1' },
              { x: 51.65, y: 66.5, w: 4.0, h: 2.6, id: 'open_vn' },     //  win 1
            ]
          },
          startTime: timeDiff + 36.1,
          human: true,
        },
        // окно ВН
        {
          action: {
            target2D: 'open_vn',
            window2D: {
              newPositionWindow: {
                x: 957,
                y: 693
              },
              elements: [
                { name: 'title_open_vn', text: 'Закрыть' },
              ],
            },
            helper2D: [
              { x: 51.8, y: 72, w: 3.2, h: 2.5, id: 'close_vn' },
              { x: 48.2, y: 72, w: 3.3, h: 2.5, id: 'open_vn1' },  //  wind 2
            ]
          },
          startTime: timeDiff + 36.2,
          human: true,
        },
        // маленькое окошко ОК
        {
          action: {
            target2D: 'open_vn1',
            helper2D: [
              { x: 54.80, y: 54.5, w: 1.5, h: 2.6, id: 'close_w1' },
              { x: 51.65, y: 66.5, w: 4.0, h: 2.6, id: 'open_vn' },     //  win 1
            ]
          },
          startTime: timeDiff + 36.3,
          human: true,
        },
        // мигание 
        {
          action: {
            window2D: {
              elements: [
                { name: 'status_window_text', text: 'Закрывается' },
                { name: 'btn_open', color: '', stroke: '' },
                { name: 'polozenie_text', text: '45' },
                { name: 'left_vn', color: '#ff1e00' },
                { name: 'right_vn', color: '#ff1e00' },
                { name: 'kl028_proc', text: '45' },
                { name: 'kl028', color: '#ff1e00' },
                { name: 'circle_1_kl028', stroke: '#ff1e00' },
                { name: 'circle_2_kl028', stroke: '#ff1e00' },
                { name: 'circle_1_win1', stroke: '#ff1e00' },
                { name: 'circle_2_win1', stroke: '#ff1e00' },
              ],
            },
            helper2D: [
              { x: 54.80, y: 54.5, w: 1.5, h: 2.6, id: 'close_w1' },
              { x: 51.65, y: 66.5, w: 4.0, h: 2.6, id: 'open_vn' },     //  win 1
            ]
          },
          startTime: timeDiff + 37,
        }, {
          action: {
            window2D: {
              elements: [
                { name: 'polozenie_text', text: '35' },
                { name: 'left_vn', color: '#8F8F8F' },
                { name: 'right_vn', color: '#8F8F8F' },
                { name: 'kl028_proc', text: '35' },
                { name: 'kl028', color: '#8F8F8F' },
                { name: 'circle_1_kl028', stroke: '#8F8F8F' },
                { name: 'circle_2_kl028', stroke: '#8F8F8F' },
                { name: 'circle_1_win1', stroke: '#8F8F8F' },
                { name: 'circle_2_win1', stroke: '#8F8F8F' },
              ],
            },
            helper2D: [
              { x: 54.80, y: 54.5, w: 1.5, h: 2.6, id: 'close_w1' },
              { x: 51.65, y: 66.5, w: 4.0, h: 2.6, id: 'open_vn' },     //  win 1
            ]
          },
          startTime: timeDiff + 38,
        }, {
          action: {
            window2D: {
              elements: [
                { name: 'kl028', color: '#ff1e00' },
                { name: 'kl028_proc', text: '25' },
                { name: 'polozenie_text', text: '25' },
                { name: 'left_vn', color: '#ff1e00' },
                { name: 'right_vn', color: '#ff1e00' },
                { name: 'circle_1_kl028', stroke: '#ff1e00' },
                { name: 'circle_2_kl028', stroke: '#ff1e00' },
                { name: 'circle_1_win1', stroke: '#ff1e00' },
                { name: 'circle_2_win1', stroke: '#ff1e00' },
              ],
            },
            helper2D: [
              { x: 54.80, y: 54.5, w: 1.5, h: 2.6, id: 'close_w1' },
              { x: 51.65, y: 66.5, w: 4.0, h: 2.6, id: 'open_vn' },     //  win 1
            ]
          },
          startTime: timeDiff + 39,
        }, {
          action: {
            window2D: {
              elements: [
                { name: 'kl028', color: '#8F8F8F' },
                { name: 'kl028_proc', text: '15' },
                { name: 'polozenie_text', text: '15' },
                { name: 'left_vn', color: '#8F8F8F' },
                { name: 'right_vn', color: '#8F8F8F' },
                { name: 'circle_1_kl028', stroke: '#8F8F8F' },
                { name: 'circle_2_kl028', stroke: '#8F8F8F' },
                { name: 'circle_1_win1', stroke: '#8F8F8F' },
                { name: 'circle_2_win1', stroke: '#8F8F8F' },
              ],
            },
            helper2D: [
              { x: 54.80, y: 54.5, w: 1.5, h: 2.6, id: 'close_w1' },
              { x: 51.65, y: 66.5, w: 4.0, h: 2.6, id: 'open_vn' },     //  win 1
            ]
          },
          startTime: timeDiff + 40,
        },
        // конечное состояние
        {
          action: {
            window2D: {
              elements: [
                { name: 'kl028', color: '#ff1e00' },
                { name: 'kl028_proc', text: '0' },
                { name: 'polozenie_text', text: '0' },
                { name: 'status_window_text', text: 'Закрыт' },
                { name: 'polozenie_button_text', color: '#000' },        //  #6E6E6E //  #000;
                { name: 'btn_open', color: '#fff', stroke: '#000' },     //  #C4C4C4 //  #fff       //  #000
                { name: 'left_vn', color: '#ff1e00' },
                { name: 'right_vn', color: '#ff1e00' },
                { name: 'circle_1_kl028', stroke: '#ff1e00' },
                { name: 'circle_2_kl028', stroke: '#ff1e00' },
                { name: 'circle_1_win1', stroke: '#ff1e00' },
                { name: 'circle_2_win1', stroke: '#ff1e00' },
              ],
            },
            helper2D: [
              { x: 54.80, y: 54.5, w: 1.5, h: 2.6, id: 'close_w1' },
              { x: 51.65, y: 66.5, w: 4.0, h: 2.6, id: 'open_vn' },     //  win 1
            ]
          },
          startTime: timeDiff + 41,
        },
        // ЧАТ
        {
          text: 'Клапан 028 на подогреватель газа закрыт.',
          sender: 'Система',
          startTime: timeDiff + 42,
        },
        {
          text: 'Подогреватели воздуха и газа отделены.',
          audio: 'tts-6',
          sender: 'Система',
          startTime: timeDiff + 43,
        },
    
    
    
        ////--------------------------------0----------------------------------------
        {
          scenarioText: 'Газовщик сообщает остановку доменной печи.',
          text: 'В случае запланированной остановке доменной печи газовщик сообщает об этом.',
          audio: 'tts-7',
          sender: 'Система',
          lifeTime: '07:45:00',
          startTime: timeDiff + 47,
        },
        // закрыть окно ВН
        {
          action: {
            target2D: 'close_w1',
          },
          startTime: timeDiff + 47.1,
          human: true,
        },
        // {
        //   scenarioText: 'Газовщик сообщает остановку доменной печи.',
    
        //   lifeTime: '07:45:00',
        //   startTime: timeDiff + 31,
        // },
    
        ////--------------------------------1----------------------------------------
        {
          scenarioText: 'Взять в руку трубку и нажать на кнопку с надписью: «Газовый цех». После разговора положить трубку.',
          sender: 'Система',
          startTime: timeDiff + 52,
        },
        {
          audio: 'Zvuk_knopok_na_telefone',
          action: {
            target3D: 'PhoneButton001',
            position: { y: 0.0144 },
          },
          duration: 0.15,
          startTime: timeDiff + 53,
          human: true,
        },
        {
          text: 'Здравствуйте! Планируется остановка доменной печи №6 в 09:00 на 3 часа.',
          sender: 'Газовщик',
          audio: 'tts-vo1',
          action: {
            target3D: 'PhoneButton001',
            position: { y: 0.015 },
          },
          duration: 0.15,
          startTime: timeDiff + 54,
        },
        ////--------------------------------2---------------------------------------- 
        {
          scenarioText: 'Взять в руку трубку и нажать на кнопку с надписью: «Насосный цех». После разговора положить трубку.',
          sender: 'Система',
          startTime: timeDiff + 62,
        },
        {
          audio: 'Zvuk_knopok_na_telefone',
          action: {
            target3D: 'PhoneButton006',
            position: { y: 0.0144 },
          },
          duration: 0.15,
          startTime: timeDiff + 63,
          human: true,
        },
        {
          text: 'Здравствуйте! Планируется остановка доменной печи №6 в 09:00 на 3 часа.',
          sender: 'Газовщик',
          audio: 'tts-vo1',
          action: {
            target3D: 'PhoneButton006',
            position: { y: 0.015 },
          },
          duration: 0.15,
          startTime: timeDiff + 64,
        },
    
        ////--------------------------------3---------------------------------------- 
        {
          scenarioText: 'Взять в руку трубку и нажать на кнопку с надписью: «Кислородный цех». После разговора положить трубку.',
          sender: 'Система',
          startTime: timeDiff + 72,
        },
        {
          audio: 'Zvuk_knopok_na_telefone',
          action: {
            target3D: 'PhoneButton017',
            position: { y: 0.0144 },
          },
          duration: 0.15,
          startTime: timeDiff + 73,
          human: true,
        },
        {
          text: 'Здравствуйте! Планируется остановка доменной печи №6 в 09:00 на 3 часа.',
          sender: 'Газовщик',
          audio: 'tts-vo1',
          action: {
            target3D: 'PhoneButton017',
            position: { y: 0.015 },
          },
          duration: 0.15,
          startTime: timeDiff + 74,
        },
    
    
    
        ////--------------------------------4----------------------------------------  
        {
          scenarioText: 'Взять в руку трубку и нажать на кнопку с надписью: «ЭВС». После разговора положить трубку.',
          sender: 'Система',
          startTime: timeDiff + 82,
        },
        {
          audio: 'Zvuk_knopok_na_telefone',
          action: {
            target3D: 'PhoneButton020',
            position: { y: 0.0144 },
          },
          duration: 0.15,
          startTime: timeDiff + 83,
          human: true,
        },
        {
          text: 'Здравствуйте! Планируется остановка доменной печи №6 в 09:00 на 3 часа.',
          sender: 'Газовщик',
          audio: 'tts-vo1',
          action: {
            target3D: 'PhoneButton020',
            position: { y: 0.015 },
          },
          duration: 0.15,
          startTime: timeDiff + 84,
        },
    
    
        // 1.2    // DP
        ////--------------------------------1---------------------------------------- 
        {
          text: 'Остановка вдувания пылеугольного топлива ПУТ.',
          sender: 'Система',
          audio: 'tts-8',
          lifeTime: '08:00:00',
          startTime: timeDiff + 92,
        },
    
        {
          text: 'В 08:00 остановили вдувания пылеугольного топлива.',
          sender: 'Система',
          audio: 'tts-9-1',
          action: {
            window2D: {
              elements: [
                { name: 'F_obsh_pyt', text: '0' },
                { name: 'F_tek_pyt', text: '0.0' },
              ]
            }
          },
          startTime: timeDiff + 94,
        },
    
        ////--------------------------------2----------------------------------------
        {
          scenarioText: ' Расход природного газа увеличиваем для поддержания ТТГ.',
          sender: 'Система',
          audio: 'tts-10',
          startTime: timeDiff + 99,
        },
        {
          action: {
            target2D: 't_r_4',
          },
          startTime: timeDiff + 104,
          human: true,
        }, {
          action: {
            target2D: 'vz_3',
            window2D: {
              elements: [
                { name: 'vz_number', text: '3' },
              ]
            }
          },
          startTime: timeDiff + 104.1,
          human: true,
        }, {
          action: {
            target2D: 'vz_7',
            window2D: {
              elements: [
                { name: 'vz_number', text: '37' },
              ]
            }
          },
          startTime: timeDiff + 104.2,
          human: true,
        }, {
          action: {
            target2D: 'vz_0',
            window2D: {
              elements: [
                { name: 'vz_number', text: '370' },
              ]
            }
          },
          startTime: timeDiff + 104.3,
          human: true,
        }, {
          action: {
            target2D: 'vz_0',
            window2D: {
              elements: [
                { name: 'vz_number', text: '3700' },
              ]
            }
          },
          startTime: timeDiff + 104.4,
          human: true,
        }, {
          action: {
            target2D: 'vz_0',
            window2D: {
              elements: [
                { name: 'vz_number', text: '37000' },
              ]
            }
          },
          startTime: timeDiff + 104.5,
          human: true,
        }, {
          action: {
            target2D: 'vz_ok',
            window2D: {
              elements: [
                { name: 'F_prir_gaz_table', text: '37000' },
              ]
            }
          },
          startTime: timeDiff + 104.6,
          human: true,
        },
    ////--------------------------------3----------------------------------------
    {
      scenarioText: 'Настройка значения теоретической температуры горения.',
      sender: 'Система',
      audio: 'tts-11',
      startTime: timeDiff + 105,
    },
    {
      action: {
        target2D: 't_b_302_btn',
        window2D: {
          elements: [
            { name: 'ws3_ttg', text: 'расход ПГ' },
          ]
        },
      },
      startTime: timeDiff + 109,
      human: true,
    },
    {
      action: {
        target2D: 'ws3_ttg_text_btn',
        window2D: {
          elements: [
            { name: 'ws3_ttg', text: 'ТТГ' },
            { name: 'F_prirGaz', stroke: '#c4bdb3' }, 
            { name: 'f_prirgaz', stroke: '#c4bdb3' },
            { name: 't_r_ttg', stroke: '#000' },
          ]
        },
        helper2D: [
          { x: 18.65, y: 73, w: 0, h: 0, id: 'ws3_ttg_text_btn' },
          { x: 18.65, y: 73, w: 8, h: 5.5, id: 'ws3_ttg2_text_btn' },
        ]
      },
      startTime: timeDiff + 109.1,
      human: true,
    },
    {
      action: {
        target2D: 'ws3_ttg2_text_btn',
        window2D: {
          elements: [
            { name: 'ws3_ttg', text: 'расход ПГ' },
            { name: 'F_prirGaz', stroke: '#000' }, 
            { name: 'f_prirgaz', stroke: '#000' },
            { name: 't_r_ttg', stroke: '#c4bdb3' },
          ]
        },

      },
      startTime: timeDiff + 109.2,
      human: true,
    },
    {
      action: {
        target2D: 'pzs_close_btn',
      },
      startTime: timeDiff + 109.3,
      human: true,
    },
    {
      action: {
        target2D: 'ws3_close_btn',
      },
      startTime: timeDiff + 109.4,
      human: true,
    },

    ////--------------------------------3.1
    {
      // scenarioText: 'Нажимаем на значение у ТТГ 22000 на общей схеме. Появляется окошко и вводим значение 2200 вручную',
      // sender: 'Система',
      action: {
        target2D: 't_r_5',
        window2D: {
          elements: [
            { name: 'vz_number', text: '0' },
          ]
        },
      },
      startTime: timeDiff + 109.5,
      human: true,
    },

    {
      action: {
        target2D: 'vz_2',
        window2D: {
          elements: [
            { name: 'vz_number', text: '2' },
          ]
        }
      },
      startTime: timeDiff + 109.6,
      human: true,
    }, {
      action: {
        target2D: 'vz_2',
        window2D: {
          elements: [
            { name: 'vz_number', text: '22' },
          ]
        }
      },
      startTime: timeDiff + 109.7,
      human: true,
    }, {
      action: {
        target2D: 'vz_0',
        window2D: {
          elements: [
            { name: 'vz_number', text: '220' },
          ]
        }
      },
      startTime: timeDiff + 109.8,
      human: true,
    }, {
      action: {
        target2D: 'vz_0',
        window2D: {
          elements: [
            { name: 'vz_number', text: '2200' },
          ]
        }
      },
      startTime: timeDiff + 109.9,
      human: true,
    },
    {
      action: {
        target2D: 'vz_ok',
        window2D: {
          elements: [
            { name: 'TTG_zadanie', text: '2200' },
          ]
        }
      },
      startTime: timeDiff + 110,
      human: true,
    },
    ////--------------------------------3.2
    {
      // scenarioText: 'Повторить операцию с символом 302, только оставляем клавишу «ТТГ» и после закрываем доп. окно.',
      // sender: 'Система',
      action: {
        target2D: 't_b_302_btn',
        window2D: {
          elements: [
            { name: 'ws3_ttg', text: 'расход ПГ' },
          ]
        }
      },
      startTime: timeDiff + 110.1,
      human: true,
    },

    {
      action: {
        target2D: 'ws3_ttg_text_btn',
        window2D: {
          elements: [
            { name: 'ws3_ttg', text: 'ТТГ' },
            { name: 'F_prirGaz', stroke: '#c4bdb3' }, //  #000  //  #c4bdb3
            { name: 'f_prirgaz', stroke: '#c4bdb3' },
            { name: 't_r_ttg', stroke: '#000' },
          ]
        }
      },
      startTime: timeDiff + 110.2,
      human: true,
    },
    {
      action: {
        target2D: 'ws3_close_btn',
      },
      startTime: timeDiff + 110.3,
      human: true,
    },


    ////--------------------------------4       
    {///??? fix scheme
      text: 'Выпуск чугуна из лёток, продвука, понижения давления температуры.',
      sender: 'Система',
      audio: 'tts-12',
      lifeTime: '08:15:00',
      startTime: timeDiff + 111,
    },
    {
      action: {
        window2D: {
          elements: [
            { name: 'field_L2', color: '#F7F700' },
            { name: 'field_L3', color: '#F7F700' },
            { name: 'L2', text: '1000' },
            { name: 'L3', text: '1000' },
          ]
        }
      },
      startTime: timeDiff + 116,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'field_L2', color: '#FF0000' },
            { name: 'field_L3', color: '#FF0000' },
            { name: 'L2', text: '800' },
            { name: 'L3', text: '800' },
          ]
        }
      },
      startTime: timeDiff + 117,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'L2', text: '400' },
            { name: 'L3', text: '400' },
          ]
        }
      },
      startTime: timeDiff + 118,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'field_L2', color: '#FFFFFF' },
            { name: 'field_L3', color: '#FFFFFF' },
            { name: 'L2', text: '0' },
            { name: 'L3', text: '0' },
          ]
        }
      },
      startTime: timeDiff + 119,
    },


    // 1.3 
    ////--------------------------------1---------------------------------------- 
    {
      text: 'По команде мастера печи, до окончания выпуска чугуна, закрыть кислород на обогащение дутья.',
      sender: 'Система',
      audio: 'tts-13',
      lifeTime: '08:30:00',
      startTime: timeDiff + 120,
    },
    {
      //scenarioText: 'По рации мастер печи сообщил команду газовщикам.', /// FIX
      text: 'По рации мастер печи сообщил команду газовщикам.',
      sender: 'Система',
      startTime: timeDiff + 127,
    },
    {
      text: 'Закрыть кислород на обогащения дутья и оставить 20000.',
      sender: 'Мастер печи',
      audio: 'tts-vo2',
      startTime: timeDiff + 128,
    },

    {
      action: {
        target3D: 'ButtonHightlight_046', // ПОКА ЭТА ????? FIX // на видео не видно
      },
      startTime: timeDiff + 133,
      human: true,
    },
    // LAMP ??? FIX
    {
      text: 'Хорошо. Выполняю.',
      sender: 'Газовщик',
      audio: 'tts-vo3',
      action: {
        target3D: 'ButtonHightlight_046',
      },
      startTime: timeDiff + 134,
    },
    // LAMP FIX ???
    ////--------------------------------2
    {
      scenarioText: 'Перекидка клапанов в автоматическом режиме.',
      // text: 'Перекидка клапанов в автоматическом режиме.',
      sender: 'Система',
      audio: 'tts-14',//////////?
      startTime: timeDiff + 137,  //////// FIX ALARM всем ниже добавить +10.   /// Ниже где-то есть похожий баг
    },
  
    {
      action: {
        target2D: 'perekidta_btn',
        window2D: {
          elements: [
            // many gray ??????? не та цветовая палитра
          ]
        }
      },
      startTime: timeDiff + 140,      ////    ЭТО    140 
      human: true,
    },  
    {
      action: {
        target2D: 'nagrev_otd2_btn',
      },
      startTime: timeDiff + 140.1,      //// 140.1
      human: true,
    }, {
      action: {
        target2D: 'pericNagrev_pusk_btn',
        window2D: {
          elements: [
            { name: 'title_open_vn', text: 'Пуск' },
          ]
        },
        helper2D: [
          { x: 37.9, y: 94.9, w: 3.2, h: 2.4, id: 'close_vn' },
          { x: 34.3, y: 94.9, w: 3.2, h: 2.4, id: 'open_vn1' },  //  wind 2
        ]
      },
      startTime: timeDiff + 140.2,
      human: true,
    },
    {  // wind 2  ok
      action: {
        target2D: 'open_vn1',
      },

      startTime: timeDiff + 140.3,
      human: true,
    },

    {  // O_p_n_na_k_na-o_2_na_VNK close
      action: {
        target2D: 'pericNagrev_close_btn',
      },
      startTime: timeDiff + 140.4,
      human: true,
    },
    {  // O_p_n_na_k_p_na_VNK close
      action: {
        target2D: 'perekidta_exit_btn',
      },
      startTime: timeDiff + 140.5,
      human: true,
    },
    // O_p_n_na_k_na-BVNK_VNK1 схема обновляется
    {
      action: {
        window2D: {
          elements: [
            { name: '1PS_03_square', color: '#ff0000' },

            //// ТУТ
            { name: 'VNK1_7PI_13', text: '10,94' },
            { name: 'VNK1_1FI_01', text: '56311' },
            { name: 'VNK1_1PI_02', text: '0,47' },
            { name: 'VNK1_1TI_43', text: '46' },
            { name: 'VNK1_1PI_04', text: '0,60' },
            { name: 'VNK1_1TI_29', text: '26' },
          ]
        }
      },
      startTime: timeDiff + 141,
    },
    {
      action: {
        window2D: {
          elements: [
            { name: 'VNK1_7PI_13', text: '10,90' },
            { name: 'VNK1_1FI_01', text: '45074' },
            { name: 'VNK1_1PI_02', text: '0,33' },
            { name: 'VNK1_1PI_04', text: '0,44' },
            { name: 'vn_132', color: '#ff0000' },
            { name: 'vn_132_l', color: '#ff0000' },

          ]
        }
      },
      startTime: timeDiff + 142,
    },
    { // FIX DISPLAY NONE
      action: {
        window2D: {
          elements: [
            { name: 'big_arrow_up', display: 'none' },
            { name: 'big_arrow_up_border', display: 'none' },
            { name: 'vn_132', color: '#ff0000' },
            { name: 'vn_132_l', color: '#ff0000' },
            { name: 'vn_127', color: '#b5b3b6' },

          ]
        }
      },
      startTime: timeDiff + 143,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'big_arrow_up', display: 'block' },
            { name: 'big_arrow_up_border', display: 'block' },
            { name: 'big_arrow_up', display: '#ffffff' },
            { name: '1PS_05_square', color: '#ff0000' },
          ]
        }
      },
      startTime: timeDiff + 144,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'VNK1_1PI_02', text: '0,17' },
            { name: 'big_arrow_up', display: 'none' },
            { name: 'big_arrow_up_border', display: 'none' },
            { name: 'vn_116', color: '#ff0000' },
            { name: 'vn_116_l', color: '#ff0000' },
            { name: 'vnk_1', color: '#ffffff' },

          ]
        }
      },
      startTime: timeDiff + 145,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'VNK1_1FI_03', text: '0' },
            { name: 'big_arrow_up', display: 'block' },
          ]
        }
      },
      startTime: timeDiff + 146,
    },
    {
      action: {
        window2D: {
          elements: [
            { name: 'big_arrow_up', display: 'none' },
          ]
        }
      },
      startTime: timeDiff + 147,
    },
    {
      action: {
        window2D: {
          elements: [
            { name: 'VNK1_1PI_02', text: '0' },
            { name: 'vn_134', color: '#ff0000' },
          ]
        }
      },
      startTime: timeDiff + 148,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'vn_117', color: '#ff0000' },
            { name: 'VNK1_1FI_02', text: '0' },
          ]
        }
      },
      startTime: timeDiff + 149,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'vn_117', color: '#ff0000' },
            { name: 'VNK1_1FI_02', text: '0' },
          ]
        }
      },
      startTime: timeDiff + 150,
    },
    {
      action: {
        window2D: {
          elements: [
            { name: 'vn_112', color: '#ff0000' },
          ]
        }
      },
      startTime: timeDiff + 151,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'vnk_1', color: '#b5b3b6' },
            { name: 'vn_127', color: '#00FF00' },
          ]
        }
      },
      startTime: timeDiff + 152,
    },

    ////--------------------------------3-------------------------------------
    {
      scenarioText: 'Отделить воздухонагреватель ВНК №1.',
      sender: 'Система',
      audio: 'tts-15',
      startTime: timeDiff + 153,
    },
    {
      action: {
        target2D: 'perekidta_btn',
      },
      startTime: timeDiff + 157,
      human: true,
    },
    { // win_otdel2_na_vnk OPEN
      action: {
        target2D: 'otdel_otdel2_btn',
      },
      startTime: timeDiff + 157.1,
      human: true,
    }, {
      action: {
        target2D: 'otdel2_pusk_btn',
        window2D: {
          elements: [
            { name: 'title_open_vn', text: 'Пуск' },
          ]
        },
        helper2D: [
          { x: 39.4, y: 94, w: 3.2, h: 2.4, id: 'close_vn' },
          { x: 35.8, y: 94, w: 3.2, h: 2.4, id: 'open_vn1' },  //  wind 2
        ]
      },
      startTime: timeDiff + 157.2,
      human: true,
    },
    {  // wind 2  ok
      action: {
        target2D: 'open_vn1',
      },

      startTime: timeDiff + 157.3,
      human: true,
    },
    {  // win_otdel2_na_vnk CLOSE
      action: {
        target2D: 'otdel2_close_btn',
      },
      startTime: timeDiff + 157.4,
      human: true,
    },
    {  // O_p_n_na_k_p_na_VNK CLOSE
      action: {
        target2D: 'perekidta_exit_btn',
      },
      startTime: timeDiff + 157.5,
      human: true,
    },

    // O_p_n_na_k_na-BVNK_VNK1 схема обновляется
    {
      action: {
        window2D: {
          elements: [
            /////////////////////////////////////////////////////// ЕУЕ ТУТ
          ]
        }
      },
      startTime: timeDiff + 158,
    }, {
      action: {
        window2D: {
          elements: [

          ]
        }
      },
      startTime: timeDiff + 159,
    }, {
      action: {
        window2D: {
          elements: [

          ]
        }
      },
      startTime: timeDiff + 160,
    }, {
      action: {
        window2D: {
          elements: [

          ]
        }
      },
      startTime: timeDiff + 161,
    }, {
      action: {
        window2D: {
          elements: [

          ]
        }
      },
      startTime: timeDiff + 162,
    }, {
      action: {
        window2D: {
          elements: [

          ]
        }
      },
      startTime: timeDiff + 163,
    }, {
      action: {
        window2D: {
          elements: [

          ]
        }
      },
      startTime: timeDiff + 164,
    },

    ////--------------------------------4-------------------------------------

    {
      scenarioText: 'Отделить воздухонагреватель ВНК №2.',
      sender: 'Система',
      audio: 'tts-16',
      startTime: timeDiff + 165,
    },
    {
      action: {
        target2D: 'perekidta_btn',
      },
      startTime: timeDiff + 169,
      human: true,
    },
    { // O_p_n_na_k_na-o_2_na_VNK OPEN
      action: {
        target2D: 'nagrev_otd2_btn',
      },
      startTime: timeDiff + 169.1,
      human: true,
    }, {
      action: {
        target2D: 'pericNagrev_pusk_btn',
        window2D: {
          elements: [
            { name: 'title_open_vn', text: 'Пуск' },
          ]
        },
        helper2D: [
          { x: 37.9, y: 94.9, w: 3.2, h: 2.4, id: 'close_vn' },
          { x: 34.3, y: 94.9, w: 3.2, h: 2.4, id: 'open_vn1' },  //  wind 2
        ]
      },
      startTime: timeDiff + 169.2,
      human: true,
    },
    {  // wind 2  ok
      action: {
        target2D: 'open_vn1',
      },
      startTime: timeDiff + 169.3,
      human: true,
    },
    {  // O_p_n_na_k_na-o_2_na_VNK close
      action: {
        target2D: 'pericNagrev_close_btn',
      },
      startTime: timeDiff + 169.4,
      human: true,
    },
    {  // O_p_n_na_k_p_na_VNK CLOSE
      action: {
        target2D: 'perekidta_exit_btn',
      },
      startTime: timeDiff + 169.5,
      human: true,
    },
    // O_p_n_na_k_na-BVNK_VNK2 схема обновляется
    {
      action: {
        window2D: {
          elements: [

          ]
        }
      },
      startTime: timeDiff + 170,
    }, {
      action: {
        window2D: {
          elements: [

          ]
        }
      },
      startTime: timeDiff + 171,
    }, {
      action: {
        window2D: {
          elements: [

          ]
        }
      },
      startTime: timeDiff + 172,
    }, {
      action: {
        window2D: {
          elements: [

          ]
        }
      },
      startTime: timeDiff + 173,
    }, {
      action: {
        window2D: {
          elements: [

          ]
        }
      },
      startTime: timeDiff + 174,
    }, {
      action: {
        window2D: {
          elements: [

          ]
        }
      },
      startTime: timeDiff + 175,
    }, {
      action: {
        window2D: {
          elements: [

          ]
        }
      },
      startTime: timeDiff + 176,
    }, {
      action: {
        window2D: {
          elements: [

          ]
        }
      },
      startTime: timeDiff + 177,
    },
    ///5. Вернуться на общую схему ВНК. Нажать на вкладку «Общая схема». Показать измененные значения, как на видео.
    {
      text: 'ВНК №1, ВНК №2 отделены, а ВНК №3 на дутье.',
      sender: 'Система',
      audio: 'tts-17',
      startTime: timeDiff + 178,
    },
    // 1.4 сценарий
    {
      scenarioText: 'Дать команду дежурному водопроводчику на закрытие природного газа на печь задвижками на подводе газа к фурмам.',
      sender: 'Система',
      audio: 'tts-18',
      lifeTime: '08:45:00',
      startTime: timeDiff + 185,
    },
    ////--------------------------------1---------------------------------------- РАЦИЯ 
    {
      scenarioText: 'Сообщить по рации дежурному водопроводчику.',
      sender: 'Система',
      action: {
        target3D: 'ButtonHightlight_046',
      },
      startTime: timeDiff + 186,
      human: true,
    },
    {
      action: {
        target3D: 'Lamp_034',
        material: 'DonorLamp_on',
      },
      startTime: timeDiff + 186.1,
    },
    {
      text: 'Закрыть природный газ на фурмах.',
      sender: 'Газовщик',
      audio: 'tts-vo4',
      startTime: timeDiff + 187,
    },

    {
      text: 'Понял, приступаю.',
      sender: 'Дежурный водопроводчик',
      audio: 'tts-vo5',
      startTime: timeDiff + 190.5,
    },
    {
      action: {
        target3D: 'Lamp_034',
        material: 'DonorLamp_off',
      },
      startTime: timeDiff + 193,
    },

    ////--------------------------------2---------------------------------------- 
    {
      scenarioText: 'Перевести клапан 721 в режим управления «Дист.»',
      sender: 'Система',
      audio: 'tts-19',
      startTime: timeDiff + 194,
    },
    {
      action: {
        target3D: 'Handle_018',
        rotation: { y: 1.571 },
      },
      duration: 0.15,
      startTime: timeDiff + 195,
      human: true,
    },

    ////--------------------------------3---------------------------------------- 
    {
      audio: 'tts-20',
      scenarioText: 'Перевести тумблер из положения «Авт.4» в положение «Дист.3» на маркировке «Атмосферные клапана» «Клапан 1», «Клапан 2» и «Клапан 3» поочерёдно.',
      sender: 'Система',
      startTime: timeDiff + 196,
    },
    {
      multi: [
        {
          action: {
            target3D: 'Handle_036',
            rotation: { y: 1.571 },
          },
        },
        {
          action: {
            target3D: 'Handle_035',
            rotation: { y: 1.571 },
          },
        }, {
          action: {
            target3D: 'Handle_08',
            rotation: { y: 1.571 },
          },
        },
      ],
      startTime: timeDiff + 204,
      human: true,
    },

    ////--------------------------------4----------------------------------------  fix FIX fix
    {
      text: 'Уменьшить значение параметра на регуляторе природного газа.',
      audio: 'tts-21',
      startTime: timeDiff + 205,
    },
    {
      action: {
        target3D: 'downBtnFPrirGaza_highlight',
      },
      startTime: timeDiff + 208.1,
      human: true,
    },
    {
      action: {
        target3D: 'vozNagr1_1', // TODO заменить на красный циферблат
        number: '024.5'
      },
      startTime: timeDiff + 208.11,
    },
    {
      action: {
        target3D: 'Clone_4_progress bar142',
        material: 'Unic_progress bar_off'
      },
      startTime: timeDiff + 208.12,
    },
    {
      action: {
        target3D: 'downBtnFPrirGaza_highlight',
      },
      startTime: timeDiff + 208.5,
      human: true,
    },
    {
      action: {
        target3D: 'vozNagr1_1', // TODO заменить на красный циферблат
        number: '020.0'
      },
      startTime: timeDiff + 208.51,
    },
    {
      action: {
        target3D: 'Clone_3_progress bar142',
        material: 'Unic_progress bar_off'
      },
      startTime: timeDiff + 208.52,
    },
    {
      action: {
        target3D: 'downBtnFPrirGaza_highlight',
      },
      startTime: timeDiff + 209,
      human: true,
    },
    {
      action: {
        target3D: 'vozNagr1_1', // TODO заменить на красный циферблат
        number: '017.0'
      },
      startTime: timeDiff + 209.1,
    },
    {
      action: {
        target3D: 'Clone_2_progress bar142',
        material: 'Unic_progress bar_off'
      },
      startTime: timeDiff + 209.2,
    },
    ////--------------------------------5---------------------------------------- 
    {
      text: 'Водопроводчик по рации сообщает о выполненных своих операциях.',
      sender: 'Система',
      startTime: timeDiff + 210,
    },
    {
      audio: 'tts-vo6',
      text: 'Газ по фурмам закрыт',
      sender: 'Дежурный водопроводчик',
      startTime: timeDiff + 210.1,
    },
    ////--------------------------------6---------------------------------------- 
    {
      scenarioText: 'Сообщить по рации в «Литейный фурменный поддоменник».',
      sender: 'Система',
      action: {
        target3D: 'ButtonHightlight_046',
      },
      startTime: timeDiff + 212,
      human: true,
    },
    {
      action: {
        target3D: 'Lamp_034',
        material: 'DonorLamp_on',
      },
      startTime: timeDiff + 212.1,
    },
    {
      text: 'Природный газ закрыт. На фурмах 3 кг.',
      sender: 'Газовщик',
      audio: 'tts-vo7',
      startTime: timeDiff + 213,
    },
    {
      action: {
        target3D: 'ButtonHightlight_046',
        position: { y: 0.004 },
      },
      duration: 0.15,
      startTime: timeDiff + 216.5,
    },
    {
      audio: 'tts-vo8',
      text: 'Понял, принял.',
      sender: 'Дежурный водопроводчик',
      startTime: timeDiff + 217,
    },
    {
      action: {
        target3D: 'Lamp_034',
        material: 'DonorLamp_off',
      },
      startTime: timeDiff + 219.5,
    },
    ////--------------------------------7---------------------------------------- 
    {
      scenarioText: 'Закрыть задвижку 721.',
      sender: 'Система',
      audio: 'tts-22',
      startTime: timeDiff + 220,
    },
    {
      action: {
        target3D: 'Handle_014',
        rotation: { y: 0.7854}, // 45
      },
      duration: 0.3,
      startTime: timeDiff + 221,
      human: true,
    },
    {
      action: {
        target3D: 'Handle_014',
        rotation: { y: 0},
      },
      duration: 0.3,
      startTime: timeDiff + 223,
      human: true,
    },
    {
      action: {
        target3D: 'Lamp_Green_023',
        material: 'Unic_Lamp_Green_Off'
      },
      startTime: timeDiff + 223.3,
    },
    {
      action: {
        target3D: 'Lamp_Red_019',
        material: 'Unic_Lamp_Red_On'
      },
      startTime: timeDiff + 223.31,
    },
    */
    // 1.5 сценарий ------------------------------------------------------------------------------------------------------------------------------
    {
      text: 'По команде мастера печи - газовщик должен открыть клапан «СНОРТ» полностью для сброса в атмосферу излишки.',
      sender: 'Система',
      audio: 'tts-23',
      lifeTime: '09:00:00',
      startTime: timeDiff + 225,
    },
    //  Мастер печи по рации сообщает о необходимых действиях.
    ////--------------------------------1---------------------------------------- 
    {
      text: 'Делаем 2,5 кг.',
      sender: 'Мастер печи',
      audio: 'tts-vo9',
      startTime: timeDiff + 232,
    },
    {
      action: {
        target3D: 'ButtonHightlight_046',
      },
      startTime: timeDiff + 235.5,
      human: true,
    },
    {
      action: {
        target3D: 'Lamp_034',
        ////material: 'DonorLamp_on', //  MicrophoneLamp_on
      },
      startTime: timeDiff + 235.7,
    },
    {
      text: 'Делаю 2,5 кг.',
      sender: 'Газовщик',
      audio: 'tts-vo10',
      startTime: timeDiff + 236,
    },
    {
      action: {
        target3D: 'ButtonHightlight_046',
        position: { y: 0.004 },
      },
      duration: 0.15,
      startTime: timeDiff + 239.9,
    },
    {
      action: {
        target3D: 'Lamp_034',
        ////material: 'DonorLamp_off', //  MicrophoneLamp_on
      },
      startTime: timeDiff + 240.1,
    },

    ////--------------------------------2----------------------------------------     /// 4 раза как на видео
    {
      scenarioText: 'Приоткрыть клапан «СНОРТ».',
      sender: 'Система',
      audio: 'tts-24',
      startTime: timeDiff + 241,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: -0.785, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 242,
      human: true,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: 0, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 243,
      human: true,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: -0.785, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 244,
      human: true,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: 0, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 245,
      human: true,
    },
    ///// На схеме ДП идет поднятие давления ~ Н7, а на фурмах понижается чуть.
    {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '9' },
          ]
        }
      },
      startTime: timeDiff + 246,
    },
    {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '10' },
          ]
        }
      },
      startTime: timeDiff + 247,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '11' },
          ]
        }
      },
      startTime: timeDiff + 248,
    },
    ////--------------------------------3----------------------------------------     ////    2   /////
    {
      scenarioText: '3. Повторить операцию п.2.',
      sender: 'Система',
      startTime: timeDiff + 250,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: -0.785, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 251,
      human: true,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: 0, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 252,
      human: true,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: -0.785, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 253,
      human: true,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: 0, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 254,
      human: true,
    },
    {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '15' },
          ]
        }
      },
      startTime: timeDiff + 255,
    },
    ////--------------------------------4---------------------------------------- 
    {
      scenarioText: 'Сообщить по рации в «Литейный фурменный поддоменник».',
      sender: 'Система',
      startTime: timeDiff + 257,
    },
    {
      action: {
        target3D: 'ButtonHightlight_046',
      },
      startTime: timeDiff + 258,
      human: true,
    },
    {
      action: {
        target3D: 'Lamp_034',
        ////material: 'DonorLamp_on', //  MicrophoneLamp_on
      },
      startTime: timeDiff + 258.1,
    },
    {
      text: 'На фурмах 2,5 кг.',
      sender: 'Газовщик',
      audio: 'tts-vo11',
      startTime: timeDiff + 259,
    },
    {
      action: {
        target3D: 'ButtonHightlight_046',
        position: { y: 0.004 },
      },
      duration: 0.15,
      startTime: timeDiff + 260,
    },
    {
      action: {
        target3D: 'Lamp_034',
        ////material: 'DonorLamp_off', //  MicrophoneLamp_on
      },
      startTime: timeDiff + 261.1,
    },
    {
      text: 'Делаем 2 кг.',
      sender: 'Мастер печи',
      audio: 'tts-vo12',
      startTime: timeDiff + 262,
    },
    ////????\
    {
      action: {
        target3D: 'ButtonHightlight_046',
      },
      startTime: timeDiff + 264.3,
      human: true,
    },
    {
      action: {
        target3D: 'Lamp_034',
        ////material: 'DonorLamp_on', //  MicrophoneLamp_on
      },
      startTime: timeDiff + 264.4,
    },
    {
      text: 'Делаю 2 кг.',
      sender: 'Газовщик',
      audio: 'tts-vo13',
      startTime: timeDiff + 265,
    },
    {
      action: {
        target3D: 'ButtonHightlight_046',
        position: { y: 0.004 },
      },
      duration: 0.15,
      startTime: timeDiff + 267.3,
    },
    {
      action: {
        target3D: 'Lamp_034',
        ////material: 'DonorLamp_off', //  MicrophoneLamp_on
      },
      startTime: timeDiff + 267.4,
    },
    ////????/
    {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '14' },
          ]
        }
      },
      startTime: timeDiff + 268,
    },
    {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '12' },
          ]
        }
      },
      startTime: timeDiff + 269,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '10' },
          ]
        }
      },
      startTime: timeDiff + 270,
    },
    ////--------------------------------5---------------------------------------- /////   2   ////      4 раза из сценария
    {
      scenarioText: 'Повторить операцию п.2.',
      sender: 'Система',
      startTime: timeDiff + 271,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: -0.785, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 272,
      human: true,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: 0, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 273,
      human: true,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: -0.785, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 274,
      human: true,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: 0, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 275,
      human: true,
    },
    {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '15' },
          ]
        }
      },
      startTime: timeDiff + 276,
    },
    {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '22' },
          ]
        }
      },
      startTime: timeDiff + 277,
    },

    ////--------------------------------6---------------------------------------- ////   4   ////
    {
      scenarioText: '6. Аналогично п.4. ',
      sender: 'Система',
      startTime: timeDiff + 277.5,
    },
    {
      action: {
        target3D: 'ButtonHightlight_046',
      },
      startTime: timeDiff + 278,
      human: true,
    },
    {
      action: {
        target3D: 'Lamp_034',
        ////material: 'DonorLamp_on', //  MicrophoneLamp_on
      },
      startTime: timeDiff + 278.15,
    },
    {
      text: 'На фурмах 2 кг.',
      sender: 'Газовщик',
      audio: 'tts-vo14',
      startTime: timeDiff + 279,
    },
    {
      action: {
        target3D: 'ButtonHightlight_046',
        position: { y: 0.004 },
      },
      duration: 0.15,
      startTime: timeDiff + 281.5,
    },
    {
      action: {
        target3D: 'Lamp_034',
        ////material: 'DonorLamp_off', //  MicrophoneLamp_on
      },
      startTime: timeDiff + 281.6,
    },
    {
      text: 'Делаю 1,5 кг.',
      sender: 'Мастер печи',
      audio: 'tts-vo15',
      startTime: timeDiff + 282.5,
    },
    ////????\
    {
      action: {
        target3D: 'ButtonHightlight_046',
      },
      startTime: timeDiff + 284,
      human: true,
    },
    {
      action: {
        target3D: 'Lamp_034',
        ////material: 'DonorLamp_on', //  MicrophoneLamp_on
      },
      startTime: timeDiff + 284.1,
    },
    {
      text: 'Выполняю.',
      sender: 'Газовщик',
      audio: 'tts-vo16',
      startTime: timeDiff + 285.5,
    },
    {
      action: {
        target3D: 'ButtonHightlight_046',
        position: { y: 0.004 },
      },
      duration: 0.15,
      startTime: timeDiff + 287,
    },
    {
      action: {
        target3D: 'Lamp_034',
        ////material: 'DonorLamp_off', //  MicrophoneLamp_on
      },
      startTime: timeDiff + 287.1,
    },
    ////????/
    {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '20' },
          ]
        }
      },
      startTime: timeDiff + 288,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '18' },
          ]
        }
      },
      startTime: timeDiff + 289,
    },
    ////--------------------------------7---------------------------------------- 
    {
      scenarioText: 'Сообщить по телефону в «ЭВС».',
      sender: 'Система',
      startTime: timeDiff + 290,
    },
    {
      audio: 'Zvuk_knopok_na_telefone',
      action: {
        target3D: 'PhoneButton020',
        position: { y: 0.0144 },
      },
      duration: 0.15,
      startTime: timeDiff + 291,
      human: true,
    },
    {
      text: 'Разгрузка на 20000.',
      sender: 'Газовщик',
      audio: 'tts-vo17',
      action: {
        target3D: 'PhoneButton020',
        position: { y: 0.015 },
      },
      duration: 0.15,
      startTime: timeDiff + 292,
    },
    {
      text: 'Принял',
      sender: 'Дежурный водопроводчик',
      audio: 'tts-vo18',
      startTime: timeDiff + 295.5,
    },
    ////--------------------------------8---------------------------------------- //////  2   //////    6-7 раз. БУДЕТ 6  . Из сценария
    {
      scenarioText: '8. Аналогично п.2.',
      sender: 'Система',
      startTime: timeDiff + 297,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: -0.785, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 298,
      human: true,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: 0, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 299,
      human: true,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: -0.785, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 300,
      human: true,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: 0, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 301,
      human: true,
    },
    {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '25' },
          ]
        }
      },
      startTime: timeDiff + 302,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '33' },
          ]
        }
      },
      startTime: timeDiff + 303,
    },
    ////--------------------------------9---------------------------------------- /////   4   /////
    {
      scenarioText: '9. Аналогично п.4.',
      sender: 'Система',
      startTime: timeDiff + 304,
    },

    {
      action: {
        target3D: 'ButtonHightlight_046',
        position: { y: 0.004 },
      },
      duration: 0.15,
      startTime: timeDiff + 305,
      human: true,
    },
    {
      action: {
        target3D: 'Lamp_034', //Lamp_034 DonorLamp_on 
        ////material: 'MicrophoneLamp_on',
      },
      startTime: timeDiff + 305.1,
    },
    {
      text: 'На фурмах 1,5 кг.',
      sender: 'Газовщик',
      audio: 'tts-vo19',
      startTime: timeDiff + 306,
    },
    {
      action: {
        target3D: 'ButtonHightlight_046',
      },
      startTime: timeDiff + 310,
    },
    {
      action: {
        target3D: 'Lamp_034',
        //material: 'MicrophoneLamp_off', //  MicrophoneLamp_on
      },
      startTime: timeDiff + 310.1,
    },
    {
      text: 'Делаем 1 кг.',
      sender: 'Мастер печи',
      audio: 'tts-vo20',
      startTime: timeDiff + 311,
    },
    {
      action: {
        target3D: 'ButtonHightlight_046',
        position: { y: 0.004 },
      },
      duration: 0.15,
      startTime: timeDiff + 313,
      human: true,
    },
    {
      action: {
        target3D: 'Lamp_034',
        //material: 'MicrophoneLamp_on', //  MicrophoneLamp_off
      },
      startTime: timeDiff + 313.1,
    },
    {
      text: 'На фурмах 1,5 кг.',
      sender: 'Газовщик',
      audio: 'tts-vo21',
      startTime: timeDiff + 314,
    },
    {
      action: {
        target3D: 'ButtonHightlight_046',
      },
      startTime: timeDiff + 316,
    },
    {
      action: {
        target3D: 'Lamp_034',
        //material: 'MicrophoneLamp_off', //  MicrophoneLamp_on
      },
      startTime: timeDiff + 316.1,
    },
    {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '31' },
          ]
        }
      },
      startTime: timeDiff + 317,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '29' },
          ]
        }
      },
      startTime: timeDiff + 318,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '28' },
          ]
        }
      },
      startTime: timeDiff + 319,
    },

    ////--------------------------------10----------------------------------------  ///////   2   //////  7 раз из сценария
    {
      scenarioText: '10. Аналогично п.2.',
      sender: 'Система',
      audio: 'tts-35',
      startTime: timeDiff + 320,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: -0.785, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 321,
      human: true,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: 0, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 322,
      human: true,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: -0.785, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 323,
      human: true,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: 0, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 324,
      human: true,
    },
    {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '35' },
          ]
        }
      },
      startTime: timeDiff + 325,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '49' },
          ]
        }
      },
      startTime: timeDiff + 326,
    },
    ////--------------------------------11----------------------------------------    ////////////////    4   ///////////////   
    {
      scenarioText: '11. Аналогично п.4.',
      sender: 'Система',
      startTime: timeDiff + 327,
    },


    {
      action: {
        target3D: 'ButtonHightlight_046',
        position: { y: 0.004 },
      },
      duration: 0.15,
      startTime: timeDiff + 328,
      human: true,
    },
    {
      action: {
        target3D: 'Lamp_034',
        ////material: 'MicrophoneLamp_on', //  MicrophoneLamp_off
      },
      startTime: timeDiff + 328.1,
    },
    {
      text: 'На фурмах 1 кг.',
      sender: 'Газовщик',
      audio: 'tts-vo22',
      startTime: timeDiff + 329,
    },
    {
      action: {
        target3D: 'ButtonHightlight_046',
      },
      startTime: timeDiff + 331.5,
    },
    {
      action: {
        target3D: 'Lamp_034',
        //material: 'MicrophoneLamp_off', //  MicrophoneLamp_on
      },
      startTime: timeDiff + 331.6,
    },
    {
      text: 'Делаем 0,8 кг. Открываем свечу.',
      sender: 'Мастер печи',
      audio: 'tts-vo23',
      startTime: timeDiff + 333,
    },
    {
      action: {
        target3D: 'ButtonHightlight_046',
        position: { y: 0.004 },
      },
      duration: 0.15,
      startTime: timeDiff + 338,
      human: true,
    },
    {
      action: {
        target3D: 'Lamp_034',
        //material: 'MicrophoneLamp_on', //  MicrophoneLamp_off
      },
      startTime: timeDiff + 338.1,
    },
    {
      text: 'Приступаю к выполнению.',
      sender: 'Газовщик',
      audio: 'tts-vo24',
      startTime: timeDiff + 339,
    },
    {
      action: {
        target3D: 'ButtonHightlight_046',
      },
      startTime: timeDiff + 341,
    },
    {
      action: {
        target3D: 'Lamp_034',
        //material: 'MicrophoneLamp_off', //  MicrophoneLamp_on
      },
      startTime: timeDiff + 341.1,
    },



    {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '47' },
          ]
        }
      },
      startTime: timeDiff + 342,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '45' },
          ]
        }
      },
      startTime: timeDiff + 343,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '44' },
          ]
        }
      },
      startTime: timeDiff + 344,
    },

    ////--------------------------------12---------------------------------------- /////////    2   //////////// 2 РАЗА КРУТИТ  из сценария
    {
      scenarioText: '12. Аналогично п.2.',
      sender: 'Система',
      audio: 'tts-35',
      startTime: timeDiff + 345,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: -0.785, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 346,
      human: true,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: 0, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 347,
      human: true,
    },
    {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '49' },
          ]
        }
      },
      startTime: timeDiff + 348,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '56' },
          ]
        }
      },
      startTime: timeDiff + 349,
    },


    ////--------------------------------13---------------------------------------- 
    {
      scenarioText: 'Нажать на пульте управления БЗУ верхнюю кнопку «Открыт» маркировки «Нижний шихтовый',
      text: 'Открыть нижний шихтовый затвор.',
      sender: 'Система',
      audio: 'tts-25',
      startTime: timeDiff + 350,
    },
    {
      action: {
        target2D: 't_r_000',
        window2D: {
          elements: []// ПОЯВИЛАСЬ НА 11 и 12 МОНИТОРЕ 
        }
      },
      startTime: timeDiff + 352.5,
    },
    {
      action: {
        window2D: {
          elements: [
            // мигание текста
          ]
        }
      },
      startTime: timeDiff + 353,
    }, {
      action: {
        window2D: {
          elements: [
            // мигание текста
          ]
        }
      },
      startTime: timeDiff + 354,
    }, {
      action: {
        window2D: {
          elements: [
            // мигание текста
          ]
        }
      },
      startTime: timeDiff + 355,
    },
    {
      action: {
        window2D: {
          elements: [

          ]
        }
      },
      startTime: timeDiff + 356,
    },
    // 3д КНОПКА
    {
      action: {
        target3D: 'Rectangle076',
        position: { y: -0.002 },  // mb v radian и ниже тоже !!! na Rectangle076
      },
      duration: 0.15,
      startTime: timeDiff + 357,
      human: true,
    },
    {
      audio: 'Zvuk_nazhatiya_knopok_na_BZU',
      action: {
        target3D: 'Rectangle076',
        position: { y: 0 },  // mb v radian и ниже тоже !!! na Rectangle076
      },
      duration: 0.15,
      startTime: timeDiff + 357.15,
    },
    {
      action: {
        target3D: 'Rectangle076',
        //materials: { y: 0,},  // migaet 4 raza FIX
      },
      startTime: timeDiff + 358,
    }, {
      action: {
        target3D: 'Rectangle076',
        //materials: { y: 0,},  // migaet 4 raza FIX
      },
      startTime: timeDiff + 359,
    }, {
      action: {
        target3D: 'Rectangle076',
        //materials: { y: 0,},  // migaet 4 raza FIX
      },
      startTime: timeDiff + 360,
    }, {
      action: {
        target3D: 'Rectangle076',
        //materials: { y: 0,},  // migaet 4 raza FIX
      },
      startTime: timeDiff + 361,
    },
    { // на видео мигает куча цифр
      action: {
        //target3D: 'Rectangle076',
        //materials: { y: 0,},  // migaet 4 raza FIX
      },
      startTime: timeDiff + 362,
    }, { // на видео мигает куча цифр
      action: {
        //target3D: 'Rectangle076',
        //materials: { y: 0,},  // migaet 4 raza FIX
      },
      startTime: timeDiff + 364,
    }, { // на видео мигает куча цифр
      action: {
        //target3D: 'Rectangle076',
        //materials: { y: 0,},  // migaet 4 raza FIX
      },
      startTime: timeDiff + 365,
    }, { // на видео мигает куча цифр
      action: {
        //target3D: 'Rectangle076',
        //materials: { y: 0,},  // migaet 4 raza FIX
      },
      startTime: timeDiff + 366,
    },
    { // на видео мигает куча цифр
      action: {
        //target3D: 'Rectangle076',
        //materials: { y: 0,},  // migaet 4 raza FIX
      },
      startTime: timeDiff + 367,
    },
    // 3Д кнопка закрывает 2д табличку
    {
      action: {
        target3D: 'Rectangle053', // СБРОС СИГНАЛА ТРЕВОГИ. СПРАВА
        position: { y: -0.002 },  // mb v radian и ниже тоже !!! na Rectangle076 // FIX
      },
      duration: 0.15,
      startTime: timeDiff + 368,
      human: true,
    },
    {
      audio: 'Zvuk_nazhatiya_knopok_na_BZU',
      action: {
        target3D: 'Rectangle053', // СБРОС СИГНАЛА ТРЕВОГИ. СПРАВА
        position: { y: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 368.15,
    },
    {
      action: {
        target2D: 't_r_000',
        window2D: {
          elements: []// СКРЫЛАСЬ НА 11 и 12 МОНИТОРЕ   // FIX
        }
      },
      startTime: timeDiff + 369,
    },
    {
      text: 'Сброс сигнала тревоги. ',
      sender: 'Система',
      audio: 'tts-26',
      startTime: timeDiff + 370,
    },


    ////--------------------------------14----------------------------------------  /// 2 raza is scenario s intervalom
    {
      scenarioText: 'Продолжить приоткрывать клапан «СНОРТ».',
      sender: 'Система',
      startTime: timeDiff + 372,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: -0.785, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 373,
      human: true,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: 0, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 374,
      human: true,
    },
    {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '55' },
          ]
        }
      },
      startTime: timeDiff + 375,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '60' },
          ]
        }
      },
      startTime: timeDiff + 376,
    },

    ////--------------------------------15---------------------------------------- 
    {
      scenarioText: 'Схема БЗУ. Нажать на клавишу «Грузить». Затем нажать на клавишу «Запрет след.порции». После подойти к ПУ №2 и нажать на кнопку «Приостанов. подачу материала»',
      text: 'Выгрузить кокс и остановить загрузку.',
      sender: 'Система',
      audio: 'tts-27',    // 50 и 51 добавить где то выше. Сейчас не понятно
      startTime: timeDiff + 377,
    },
    {
      action: {
        target2D: 'bzu_gruzit_btn',
        window2D: {
          elements: [
            // green
          ]
        }
      },
      startTime: timeDiff + 380,
      human: true
    },
    {
      action: {
        target2D: 'bzu_ZapretSledPorci_btn',
        window2D: {
          elements: [
            // green
          ]
        }
      },
      startTime: timeDiff + 380.1,
      human: true
    },
    // { // БЫЛО НА ВИДЕО, в тексте нет //?????  FIX
    //   action: {
    //     target2D: 'bzu_raketaNGUK2_btn',
    //     window2D: {
    //       elements: [
    //         // green
    //       ]
    //     }
    //   },
    //   startTime: timeDiff + 380.2,
    //   human: true
    // },

    {
      action: {
        target3D: 'Rectangle056',
        position: { y: -0.002 },  // mb v radian и ниже тоже !!! na Rectangle076 // FIX
      },
      duration: 0.15,
      startTime: timeDiff + 381,
      human: true,
    },
    {
      audio: 'Zvuk_nazhatiya_knopok_na_BZU',
      action: {
        target3D: 'Rectangle056',
        position: { y: 0 },
        ////material: 'DonorLamp_on', //?????  FIX   /// слева пульта от ДП6 RED LAMP
      },
      duration: 0.15,
      startTime: timeDiff + 381.15,
    },

    // { // ХЗ КОГДА ОПУСТИЛАСЬ //?????  FIX
    //   action: {
    //     window2D: {
    //       elements: [ 
    //         { name: 'H_snotr', text: '50' },
    //       ]
    //     }
    //   },
    //   startTime: timeDiff + 382,
    // },

    ////--------------------------------16----------------------------------------  //  Газовщик провернул клапан 1 раз.
    {
      scenarioText: 'Продолжить приоткрывать клапан «СНОРТ».',
      sender: 'Система',
      startTime: timeDiff + 383,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: 0, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 384,
      human: true,
    },
    {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '50' },
          ]
        }
      },
      startTime: timeDiff + 385,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '60' },
          ]
        }
      },
      startTime: timeDiff + 386,
    },
    ////--------------------------------17---------------------------------------- 
    {
      scenarioText: 'Схема БЗУ и нажать на клавишу «Пауза» кнопка.',
      text: 'Загрузка приостановлена.',
      sender: 'Система',
      audio: 'tts-28',
      startTime: timeDiff + 387,
    },
    {
      action: {
        target2D: 'bzu_pause_btn',
        window2D: {
          elements: [
            // green
          ]
        }
      },
      startTime: timeDiff + 387.1,
      human: true
    },
    ////--------------------------------18---------------------------------------- 
    {
      scenarioText: 'На ПУ №3 переводим тумблер клапана 1 до щелчка в положение «2».Делаем аналогично с клапаном 3 и 2.',
      text: 'Открыть атмосферные клапаны.',
      sender: 'Система',
      audio: 'tts-29',
      startTime: timeDiff + 390,
    },
    ///// ------------  1
    {
      action: {
        target3D: 'Handle_034',
        rotation: { y: -0.785, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 391,
      human: true,
    },
    { // ЗЕЛ  - 1
      action: {
        target3D: 'Lamp_Green_007',
        ////material: 'DonorLamp_on', //?????? FIX
      },
      duration: 0.15,
      startTime: timeDiff + 392,
    }, { // ТЕЛ  - 1
      action: {
        target3D: 'Lamp_Green_007',
        ////material: 'DonorLamp_off', //?????? FIX
      },
      duration: 0.15,
      startTime: timeDiff + 393,
    }, { // ЗЕЛ  - 2
      action: {
        target3D: 'Lamp_Green_007',
        ////material: 'DonorLamp_on', //?????? FIX
      },
      duration: 0.15,
      startTime: timeDiff + 394,
    }, { // ТЕЛ  - 2
      action: {
        target3D: 'Lamp_Green_007',
        ////material: 'DonorLamp_off', //?????? FIX
      },
      duration: 0.15,
      startTime: timeDiff + 395,
    }, { // ЗЕЛ  - 3
      action: {
        target3D: 'Lamp_Green_007',
        ////material: 'DonorLamp_on', //?????? FIX
      },
      duration: 0.15,
      startTime: timeDiff + 396,
    }, { // ТЕЛ  - 3
      action: {
        target3D: 'Lamp_Green_007',
        ////material: 'DonorLamp_off', //?????? FIX
      },
      duration: 0.15,
      startTime: timeDiff + 397,
    }, { // ЗЕЛ  - 4
      action: {
        target3D: 'Lamp_Green_007',
        ////material: 'DonorLamp_on', //?????? FIX
      },
      duration: 0.15,
      startTime: timeDiff + 398,
    },


    /////----- 2
    {
      action: {
        target3D: 'Handle_033',
        rotation: { y: -0.785, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 400,
      human: true,
    },
    { // ЗЕЛ  - 1
      action: {
        target3D: 'Lamp_Green_006',
        ////material: 'DonorLamp_on', //?????? FIX
      },
      duration: 0.15,
      startTime: timeDiff + 401,
    }, { // ТЕЛ  - 1
      action: {
        target3D: 'Lamp_Green_006',
        ////material: 'DonorLamp_off', //?????? FIX
      },
      duration: 0.15,
      startTime: timeDiff + 402,
    }, { // ЗЕЛ  - 2
      action: {
        target3D: 'Lamp_Green_006',
        // //material: 'DonorLamp_on', //?????? FIX
      },
      duration: 0.15,
      startTime: timeDiff + 403,
    }, { // ТЕЛ  - 2
      action: {
        target3D: 'Lamp_Green_006',
        ////material: 'DonorLamp_off', //?????? FIX
      },
      duration: 0.15,
      startTime: timeDiff + 404,
    }, { // ЗЕЛ  - 3
      action: {
        target3D: 'Lamp_Green_006',
        ////material: 'DonorLamp_on', //?????? FIX
      },
      duration: 0.15,
      startTime: timeDiff + 405,
    }, { // ТЕЛ  - 3
      action: {
        target3D: 'Lamp_Green_006',
        ////material: 'DonorLamp_off', //?????? FIX
      },
      duration: 0.15,
      startTime: timeDiff + 406,
    }, { // ЗЕЛ  - 4
      action: {
        target3D: 'Lamp_Green_006',
        ////material: 'DonorLamp_on', //?????? FIX
      },
      duration: 0.15,
      startTime: timeDiff + 407,
    },

    /////////-------------- 3

    {
      action: {
        target3D: 'Handle_032',
        rotation: { y: -0.785, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 409,
      human: true,
    },
    { // ЗЕЛ  - 1
      action: {
        target3D: 'Lamp_Green_005',
        ////material: 'DonorLamp_on', //?????? FIX
      },
      duration: 0.15,
      startTime: timeDiff + 410,
    }, { // ТЕЛ  - 1
      action: {
        target3D: 'Lamp_Green_005',
        ////material: 'DonorLamp_off', //?????? FIX
      },
      duration: 0.15,
      startTime: timeDiff + 411,
    }, { // ЗЕЛ  - 2
      action: {
        target3D: 'Lamp_Green_005',
        ////material: 'DonorLamp_on', //?????? FIX
      },
      duration: 0.15,
      startTime: timeDiff + 412,
    }, { // ТЕЛ  - 2
      action: {
        target3D: 'Lamp_Green_005',
        // //material: 'DonorLamp_off', //?????? FIX
      },
      duration: 0.15,
      startTime: timeDiff + 413,
    }, { // ЗЕЛ  - 3
      action: {
        target3D: 'Lamp_Green_005',
        ////material: 'DonorLamp_on', //?????? FIX
      },
      duration: 0.15,
      startTime: timeDiff + 414,
    }, { // ТЕЛ  - 3
      action: {
        target3D: 'Lamp_Green_005',
        ////material: 'DonorLamp_off', //?????? FIX
      },
      duration: 0.15,
      startTime: timeDiff + 415,
    }, { // ЗЕЛ  - 4
      action: {
        target3D: 'Lamp_Green_005',
        // //material: 'DonorLamp_on', //?????? FIX
      },
      duration: 0.15,
      startTime: timeDiff + 416,
    },




    ////--------------------------------19---------------------------------------- 
    {
      scenarioText: 'Перевести тумблеры в положение «0»',
      text: 'Атмосферные клапаны открыты.',
      sender: 'Система',
      audio: 'tts-30',
      startTime: timeDiff + 417,
    },
    {
      action: {
        target3D: 'Handle_034',
        rotation: { y: 0, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 418,
      human: true,
    },
    {
      action: {
        target3D: 'Handle_033',
        rotation: { y: 0, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 419,
      human: true,
    },
    {
      action: {
        target3D: 'Handle_032',
        rotation: { y: 0, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 420,
      human: true,
    },
    ////--------------------------------20---------------------------------------- 
    { // 3D
      scenarioText: 'По рации сообщить мастеру печи о выполненной операции.',
      sender: 'Система',
      startTime: timeDiff + 422,
    },
    {
      action: {
        target3D: 'ButtonHightlight_046',   // 
        position: { y: 0.003 },
      },
      duration: 0.15,
      startTime: timeDiff + 423,
      human: true,
    },
    {
      action: {
        target3D: 'Lamp_034',
        //material: 'DonorLamp_on', //  MicrophoneLamp_on
      },
      startTime: timeDiff + 423.15,
    },
    {
      text: 'Атмосферные клапана открыты. На фурмах 0,75 кг.',
      sender: 'Газовщик',
      audio: 'tts-vo25',
      startTime: timeDiff + 424,
    },
    {
      action: {
        target3D: 'ButtonHightlight_046',
        position: { y: 0.004 },
      },
      duration: 0.15,
      startTime: timeDiff + 430.5,
    },
    {
      action: {
        target3D: 'Lamp_034',
        //material: 'DonorLamp_off', //  MicrophoneLamp_oаа
      },
      startTime: timeDiff + 430.65,
    },



    ////--------------------------------21---------------------------------------- 
    { // 3D
      scenarioText: 'Мастер печи по рации сообщает действия.',
      sender: 'Система',
      startTime: timeDiff + 432,
    },
    {
      text: 'Закрывайте кислород и делайте 0,5 кг на фурмах.',
      sender: 'Мастер печи',
      audio: 'tts-vo26',
      startTime: timeDiff + 433,
    },
    {
      action: {
        target3D: 'ButtonHightlight_046', //
        position: { y: 0.003 },
      },
      duration: 0.15,
      startTime: timeDiff + 438.5,
      human: true,
    },
    {
      action: {
        target3D: 'Lamp_034',
        //material: 'DonorLamp_on', //   MicrophoneLamp_on
      },
      startTime: timeDiff + 438.65,
    },
    {
      text: 'Закрываю кислород полностью и делаю 0,5.',
      sender: 'Газовщик',
      audio: 'tts-vo27',
      startTime: timeDiff + 439.5,
    },
    {
      action: {
        target3D: 'ButtonHightlight_046', // 
        position: { y: 0.004 },
      },
      duration: 0.15,
      startTime: timeDiff + 444,
    },
    {
      action: {
        target3D: 'Lamp_034',
        //material: 'DonorLamp_off', //   MicrophoneLamp_off
      },
      startTime: timeDiff + 444.15,
    },


    ////--------------------------------22---------------------------------------- 
    {
      scenarioText: 'Нажать на кнопку с надписью: «Кислородный цех» и взять в руку трубку. После разговора положить трубку.',
      sender: 'Система',
      startTime: timeDiff + 445,
    },

    {
      audio: 'Zvuk_knopok_na_telefone',
      action: {
        target3D: 'PhoneButton017', //  Кислородный цех
        position: { y: 0.0144 },
      },
      duration: 0.15,
      startTime: timeDiff + 446,
      human: true,
    },
    {
      action: {
        target3D: 'PhoneButton017', // Кислородный цех
        position: { y: 0.015 },
      },
      duration: 0.15,
      startTime: timeDiff + 447,
    },
    {
      text: 'Закрываю кислород полностью и делаю 0,5.',
      sender: 'Газовщик',
      audio: 'tts-vo28',
      startTime: timeDiff + 448,
    },
    {
      text: 'Выполняю',
      sender: 'Дежурный водопроводчик',
      audio: 'tts-vo29',
      startTime: timeDiff + 451,
    },


    /// Handle_015 не понтяное положение fix 
    //////////////////////////////////////////////////////////////////////////////////////////////////////---------****************
    ////--------------------------------23----------------------------------------   // Газовщик проворачивал клапан 6 раз с интервалом.
    {
      scenarioText: 'Аналогично п.2.',
      sender: 'Система',
      startTime: timeDiff + 453,
    },
    //1
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: -0.785, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 454,
      human: true,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: 0, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 456,
      human: true,
    },
    //2
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: -0.785, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 466,
      human: true,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: 0, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 468,
      human: true,
    },
    //3
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: -0.785, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 478,
      human: true,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: 0, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 480,
      human: true,
    },
    //4
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: -0.785, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 490,
      human: true,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: 0, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 492,
      human: true,
    },
    //5
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: -0.785, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 502,
      human: true,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: 0, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 512,
      human: true,
    },
    //6
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: -0.785, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 522,
      human: true,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: 0, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 524,
      human: true,
    },
    {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '63' },
          ]
        }
      },
      startTime: timeDiff + 525,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '67' },
          ]
        }
      },
      startTime: timeDiff + 526,
    },
    ////--------------------------------24---------------------------------------- 
    {
      scenarioText: 'Аналогично п.4.',
      sender: 'Система',
      startTime: timeDiff + 527,
    },
    {
      action: {
        target3D: 'ButtonHightlight_046',
        position: { y: 0.004 },
      },
      duration: 0.15,
      startTime: timeDiff + 528,
      human: true,
    },
    {
      action: {
        target3D: 'Lamp_034',
        ////material: 'MicrophoneLamp_on', //  MicrophoneLamp_off
      },
      startTime: timeDiff + 528.2,
    },
    {
      text: 'На фурмах 0,5 кг.',
      sender: 'Газовщик',
      audio: 'tts-vo30',
      startTime: timeDiff + 529,
    },
    {
      action: {
        target3D: 'ButtonHightlight_046',
      },
      startTime: timeDiff + 533.5,
    },
    {
      action: {
        target3D: 'Lamp_034',
        //material: 'MicrophoneLamp_off', //  MicrophoneLamp_on
      },
      startTime: timeDiff + 533.6,
    },

    {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '65' },
          ]
        }
      },
      startTime: timeDiff + 534,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '63' },
          ]
        }
      },
      startTime: timeDiff + 535,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '62' },
          ]
        }
      },
      startTime: timeDiff + 536,
    },
    ////--------------------------------25---------------------------------------- 
    //  Все делать последовательно, как на видео. Кнопки мигают и после фиксируются.
    { // 3D
      scenarioText: 'На ПУ №2 нажать на кнопку «Автоматич. СТОП». После нажать на кнопку «ЗАКРЫТ» у «клапана вторичного выравнивания» с двух сторон.',
      text: 'БЗУ снять с автоматического режима.',
      audio: 'tts-31',
      sender: 'Система',
      startTime: timeDiff + 537,
    },

    { // 3D
      action: {
        target3D: 'Rectangle071', // АВТОМАТИЧЕСКИЙ СТОП 2. СЛЕВА
        position: { y: -0.002 },  // mb v radian и ниже тоже !!!  // FIX
      },
      duration: 0.15,
      startTime: timeDiff + 538,
      human: true,
    },
    {
      audio: 'Zvuk_nazhatiya_knopok_na_BZU',
      action: {
        target3D: 'Rectangle071', // АВТОМАТИЧЕСКИЙ СТОП 2. СЛЕВА
        position: { y: 0 },
        ////material: 'DonorLamp_on', //?????  FIX   /// слева пульта от ДП6 RED LAMP
      },
      duration: 0.15,
      startTime: timeDiff + 538.2,
    },

    { // 3D
      action: {
        target3D: 'Rectangle053', // СБРОС СИГНАЛА ТРЕВОГИ. СПРАВА
        position: { y: -0.002 },  // mb v radian и ниже тоже !!!  // FIX
      },
      duration: 0.15,
      startTime: timeDiff + 539,
      human: true,
    },
    {
      audio: 'Zvuk_nazhatiya_knopok_na_BZU',
      action: {
        target3D: 'Rectangle053', // СБРОС СИГНАЛА ТРЕВОГИ. СПРАВА
        position: { y: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 539.2,
    },


    { // 3D
      action: {
        target3D: 'Rectangle065', // ЗАКРЫТ КЛАПАН ВТОРИЧНОГО ДАВЛЕНИЯ. СЛЕВА 
        position: { y: -0.002 },  // mb v radian и ниже тоже !!!  // FIX
      },
      duration: 0.15,
      startTime: timeDiff + 540,
      human: true,
    },
    {
      audio: 'Zvuk_nazhatiya_knopok_na_BZU',
      action: {
        target3D: 'Rectangle065', // ЗАКРЫТ КЛАПАН ВТОРИЧНОГО ДАВЛЕНИЯ. СЛЕВА
        position: { y: 0 },
        ////material: 'DonorLamp_on', //?????  FIX   /// слева пульта от ДП6 RED LAMP /// ??? ZAFORELSA V ITOGE. Там выше зеленый погас
      },
      duration: 0.15,
      startTime: timeDiff + 540.2,
    },

    { // 3D
      action: {
        target3D: 'Rectangle046', // ЗАКРЫТ КЛАПАН ВТОРИЧНОГО ДАВЛЕНИЯ. СПРАВА 
        position: { y: -0.002 },  // mb v radian и ниже тоже !!!  // FIX
      },
      duration: 0.15,
      startTime: timeDiff + 541,
      human: true,
    },
    {
      audio: 'Zvuk_nazhatiya_knopok_na_BZU',
      action: {
        target3D: 'Rectangle046', // ЗАКРЫТ КЛАПАН ВТОРИЧНОГО ДАВЛЕНИЯ. СПРАВА
        position: { y: 0 },
        ////material: 'DonorLamp_on', //?????  FIX   /// слева пульта от ДП6 GREEN LAMP
      },
      duration: 0.15,
      startTime: timeDiff + 541.2,
    },


    { // 3D
      action: {
        target3D: 'Rectangle070', // ОТКРЫТ КЛАПАН СБРОСА. СЛЕВА 
        position: { y: -0.002 },  // mb v radian и ниже тоже !!!  // FIX
      },
      duration: 0.15,
      startTime: timeDiff + 542,
      human: true,
    },
    {
      audio: 'Zvuk_nazhatiya_knopok_na_BZU',
      action: {
        target3D: 'Rectangle070', // ОТКРЫТ КЛАПАН СБРОСА. СЛЕВА
        position: { y: 0 },
        ////material: 'DonorLamp_on', //?????  FIX   /// слева пульта от ДП6 GREEN LAMP
      },
      duration: 0.15,
      startTime: timeDiff + 542.2,
    },

    { // 3D
      action: {
        target3D: 'Rectangle115', // ОТКРЫТ КЛАПАН СБРОСА. СПРАВА 
        position: { y: -0.002 },  // mb v radian и ниже тоже !!!  // FIX
      },
      duration: 0.15,
      startTime: timeDiff + 543,
      human: true,
    },
    {
      audio: 'Zvuk_nazhatiya_knopok_na_BZU',
      action: {
        target3D: 'Rectangle115', // ОТКРЫТ КЛАПАН СБРОСА. СПРАВА
        position: { y: 0 },
        ////material: 'DonorLamp_on', //?????  FIX   /// слева пульта от ДП6 GREEN LAMP
      },
      duration: 0.15,
      startTime: timeDiff + 543.2,
    },



    ////--------------------------------26---------------------------------------- 
    {
      scenarioText: 'Мастер печи по рации сообщает действия',
      text: 'Закрывайте кислород и делайте 0,5 кг на фурмах.',
      sender: 'Мастер печи',
      audio: 'tts-vo31',
      startTime: timeDiff + 546,
    },
    {
      action: {
        target3D: 'ButtonHightlight_046', //
        position: { y: 0.003 },
      },
      duration: 0.15,
      startTime: timeDiff + 549,
      human: true,
    },
    {
      action: {
        target3D: 'Lamp_034',
        //material: 'DonorLamp_on', //   MicrophoneLamp_on
      },
      startTime: timeDiff + 549.15,
    },
    {
      text: 'Принимаю, делаю 0,3.',
      sender: 'Газовщик',
      audio: 'tts-vo32',
      startTime: timeDiff + 550,
    },
    {
      action: {
        target3D: 'ButtonHightlight_046', // 
        position: { y: 0.004 },
      },
      duration: 0.15,
      startTime: timeDiff + 553.5,
    },
    {
      action: {
        target3D: 'Lamp_034',
        //material: 'DonorLamp_off', //   MicrophoneLamp_off
      },
      startTime: timeDiff + 553.65,
    },



    ////--------------------------------27----------------------------------------  // Газовщик проворачивал клапан 6 раз с интервалом.
    {
      scenarioText: 'Аналогично п.2.',
      sender: 'Система',
      startTime: timeDiff + 554,
    },
    //1
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: -0.785, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 556,
      human: true,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: 0, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 560,
      human: true,
    },
    //2
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: -0.785, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 570,
      human: true,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: 0, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 572,
      human: true,
    },
    //3
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: -0.785, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 582,
      human: true,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: 0, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 585,
      human: true,
    },
    //4
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: -0.785, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 595,
      human: true,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: 0, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 597,
      human: true,
    },
    //5
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: -0.785, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 607,
      human: true,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: 0, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 610,
      human: true,
    },
    //6
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: -0.785, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 620,
      human: true,
    },
    {
      action: {
        target3D: 'Handle_015',
        rotation: { y: 0, z: 0 },
      },
      duration: 0.15,
      startTime: timeDiff + 622,
      human: true,
    },
    {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '80' },
          ]
        }
      },
      startTime: timeDiff + 623,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '89' },
          ]
        }
      },
      startTime: timeDiff + 623,
    },
    {
      text: 'Смесительный клапан 002 закрывается.',
      audio: 'tts-32',
      sender: 'Система',
      action: {
        window2D: {
          elements: [
            { name: 'vn_002', color: '#ff1e00' },

          ]
        }
      },
      startTime: timeDiff + 624,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'vn_002', color: '#8F8F8F' },
          ]
        }
      },
      startTime: timeDiff + 625,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'vn_002', color: '#ff1e00' },
          ]
        }
      },
      startTime: timeDiff + 626,
    }, {
      action: {

      },
      startTime: timeDiff + 627,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'vn_002', color: '#ff1e00' },
          ]
        }
      },
      startTime: timeDiff + 628,
    },
    ////--------------------------------28---------------------------------------- 
    {
      scenarioText: 'Аналогично п.4.',
      sender: 'Система',
      startTime: timeDiff + 629,
    },
    {
      action: {
        target3D: 'ButtonHightlight_046',
        position: { y: 0.004 },
      },
      duration: 0.15,
      startTime: timeDiff + 630,
      human: true,
    },
    {
      action: {
        target3D: 'Lamp_034',
        ////material: 'MicrophoneLamp_on', //  MicrophoneLamp_off
      },
      startTime: timeDiff + 630.2,
    },
    {
      text: 'На фурмах 0,3 кг.',
      sender: 'Газовщик',
      audio: 'tts-vo33',
      startTime: timeDiff + 631,
    },
    {
      action: {
        target3D: 'ButtonHightlight_046',
      },
      startTime: timeDiff + 635,
    },
    {
      action: {
        target3D: 'Lamp_034',
        //material: 'MicrophoneLamp_off', //  MicrophoneLamp_on
      },
      startTime: timeDiff + 635.2,
    },
    {
      text: 'Закрывайте отсечной.',
      sender: 'Мастер печи',
      audio: 'tts-vo34',
      startTime: timeDiff + 636,
    },

    {
      action: {
        target3D: 'ButtonHightlight_046',
        position: { y: 0.004 },
      },
      duration: 0.15,
      startTime: timeDiff + 640,
      human: true,
    },
    {
      action: {
        target3D: 'Lamp_034',
        ////material: 'MicrophoneLamp_on', //  MicrophoneLamp_off
      },
      startTime: timeDiff + 640.2,
    },
    {
      text: 'Понятно, Артём Викторович – закрывай отсечной.',
      sender: 'Газовщик',
      audio: 'tts-vo35',
      startTime: timeDiff + 641,
    },
    {
      action: {
        target3D: 'ButtonHightlight_046',
      },
      startTime: timeDiff + 645,
    },
    {
      action: {
        target3D: 'Lamp_034',
        //material: 'MicrophoneLamp_off', //  MicrophoneLamp_on
      },
      startTime: timeDiff + 645.2,
    },
    {
      text: 'Понял, закрываю отсечной клапан.',
      sender: 'Мастер печи',
      audio: 'tts-vo36',
      startTime: timeDiff + 646,
    },
    {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '87' },
          ]
        }
      },
      startTime: timeDiff + 650,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '85' },
          ]
        }
      },
      startTime: timeDiff + 651,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'H_snotr', text: '84' },
          ]
        }
      },
      startTime: timeDiff + 652,
    },
    ////--------------------------------29---------------------------------------- 
    //  29. На схеме ДП клапан 81 будет мигать красным цветом, сначала одна сторона, затем вторая и после зафиксирует положение.
    {
      text: 'Отсечной клапан закрыть.',
      sender: 'Система',
      audio: 'tts-33',
      startTime: timeDiff + 654,
    },
    {
      action: {
        window2D: {
          elements: [
            { name: 'vn_81', color: '#8F8F8F' },
          ]
        }
      },
      startTime: timeDiff + 656.5,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'vn_81', color: '#ff1e00' },
          ]
        }
      },
      startTime: timeDiff + 658,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'vn_81', color: '#8F8F8F' },
          ]
        }
      },
      startTime: timeDiff + 659,
    }, {
      action: {
        window2D: {
          elements: [
            { name: 'vn_81', color: '#ff1e00' },
          ]
        }
      },
      startTime: timeDiff + 660,
    },
    /*   
       ////--------------------------------30---------------------------------------- 
       { // 3d
         scenarioText: '30. На ПУ №3 «Клапан 723, дистанционное управление» провернуть тумблер в положение «2», т.е. «Откр» и через пару секунд вернуть в положение «0», красный индикатор «Закрыт» погаснет и загорится зелёный индикатор «Открыт».',
         sender: 'Система',
         action: {
           window2D: {
             elements: []
           }
         },
         startTime: timeDiff + 164,
       },
       {
         scenarioText: 'На схеме ДП верхняя часть клапана загорится зелёным.',
         sender: 'Система',
         action: {
           window2D: {
             elements: [
               { name: 'vn_723', color: '#ff1e00' },
               { name: 'vn_723', color: '#00FF00' },
             ]
           }
         },
         startTime: timeDiff + 165,
       },
       ////--------------------------------31---------------------------------------- 
       {
         scenarioText: 'Мастер печи по рации сообщает действия. Газовщик на рации прожимает кнопку «Лётка №3»',
         sender: 'Система',
   
         startTime: timeDiff + 166,
       },
       ////--------------------------------32---------------------------------------- 
       {
         scenarioText: '32. Позвонить по телефону, нажав на кнопку «Дисп.комб» и сообщить действия через громкоговоритель. ',
         sender: 'Система',
         action: {
           window2D: {
             elements: []
           }
         },
         startTime: timeDiff + 167,
       },
       ////--------------------------------33---------------------------------------- 
       {
         scenarioText: '33. Газовщик на рации прожимает кнопку «Лётка №3», загорается кнопка и сообщает команду. ',
         sender: 'Система',
         action: {
           window2D: {
             elements: []
           }
         },
         startTime: timeDiff + 168,
       },
       ////--------------------------------34---------------------------------------- 
       {
         scenarioText: '34. Мастер печи по рации сообщает действия, а газовщик отвечает.   ',
         sender: 'Система',
         action: {
           window2D: {
             elements: []
           }
         },
         startTime: timeDiff + 169,
       },
       ////--------------------------------35---------------------------------------- 
       {
         scenarioText: '35. Аналогично п.2. На схеме ДП давление поднимется до Н93.',
         sender: 'Система',
         audio: 'tts-35',
         action: {
           window2D: {
             elements: []
           }
         },
         startTime: timeDiff + 170,
       },
       {
         action: {
           window2D: {
             elements: [
               { name: 'H_snotr', text: '88' },
             ]
           }
         },
         startTime: timeDiff + 171,
       }, {
         action: {
           window2D: {
             elements: [
               { name: 'H_snotr', text: '93' },
             ]
           }
         },
         startTime: timeDiff + 172,
       },
       ////--------------------------------36---------------------------------------- 
       {
         scenarioText: '36. Аналогично п.4.',
         sender: 'Система',
         action: {
           window2D: {
             elements: []
           }
         },
         startTime: timeDiff + 173,
       },
       {
         action: {
           window2D: {
             elements: [
               { name: 'H_snotr', text: '91' },
             ]
           }
         },
         startTime: timeDiff + 174,
       }, {
         action: {
           window2D: {
             elements: [
               { name: 'H_snotr', text: '88' },
             ]
           }
         },
         startTime: timeDiff + 175,
       }, {
         action: {
           window2D: {
             elements: [
               { name: 'H_snotr', text: '87' },
             ]
           }
         },
         startTime: timeDiff + 176,
       },
       ////--------------------------------37---------------------------------------- 
       {
         scenarioText: '37. Аналогично п.2. На схеме ДП давление поднимется до Н100, а также падает давление на фурмах до 0.00. На ПУ загорается индикатор «Открыт».',
         sender: 'Система',
         audio: 'tts-35',
         action: {
           window2D: {
             elements: []
           }
         },
         startTime: timeDiff + 177,
       },
       {
         action: {
           window2D: {
             elements: [
               { name: 'H_snotr', text: '95' },
             ]
           }
         },
         startTime: timeDiff + 178,
       }, {
         action: {
           window2D: {
             elements: [
               { name: 'H_snotr', text: '100' },
             ]
           }
         },
         startTime: timeDiff + 179,
       },
       ////--------------------------------38---------------------------------------- 
       {
         scenarioText: '38. Аналогично п.4.',
         sender: 'Система',
         action: {
           window2D: {
             elements: []
           }
         },
         startTime: timeDiff + 180,
       },
       {
         action: {
           window2D: {
             elements: [
               { name: 'H_snotr', text: '98' },
             ]
           }
         },
         startTime: timeDiff + 181,
       }, {
         action: {
           window2D: {
             elements: [
               { name: 'H_snotr', text: '96' },
             ]
           }
         },
         startTime: timeDiff + 182,
       }, {
         action: {
           window2D: {
             elements: [
               { name: 'H_snotr', text: '95' },
             ]
           }
         },
         startTime: timeDiff + 183,
       },
   
   
       ////--------------------------------39---------------------------------------- 
       // scenarioText: 'Делаем также с 318 и 319 поочерёдно.',
       ////--------------------------------клапан 310----------------------------------------Закрыт. Автоматический в ручной-------------------------------
       {
         scenarioText: '39. На мониторе 1 с «Общая схема» перейти на вкладку «ВНК №3». Нажать на клапан 310, после нажать на клавишу «Ручной», затем «Да»,',
         sender: 'Система',
         action: {
           target2D: 'vn_310_btn',
           window2D: {
             elements: [ // ИСПРАВИТЬ ЦВЕТА !!!  //  FIX // ПЕРЕНЕСТИ ЦВЕТА С ВИДЕО. НЕ только ТУТ
               { name: 'title_work_vn', text: 'Управление клапаном 310' },
               { name: 'left_vn', color: '#ff1e00' },
               { name: 'right_vn', color: '#ff1e00' },
   
               { name: 'circle_1_win1', stroke: '#ff1e00' },
               { name: 'circle_2_win1', stroke: '#ff1e00' },
   
               { name: 'status_control_vnk_text', text: 'Автоматический' },
               { name: 'status_window_text', text: 'Закрыт' },
   
               { name: 'blocks_open', color: '#00FF00' },
               { name: 'blocks_close', color: '#00FF00' },
   
               { name: 'polozenie_button_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
               { name: 'polozenie_button_zakr_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
               { name: 'polozenie_button_stop_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
               { name: 'polozenie_button_reset_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
   
   
               { name: 'uprav_auto_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
               { name: 'uprav_rucnoy_text', color: '#000000' },                     //  #6E6E6E //  #000000;
   
   
               { name: 'btn_auto', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000 // afk
               { name: 'btn_rucnoy', color: '#ffffff', stroke: '#000000' },  //  #C4C4C4 //  #ffffff       //  #000000
               { name: 'btn_open', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000
               { name: 'btn_close', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000
               { name: 'btn_stop', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000
               { name: 'btn_reset', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000
   
               { name: 'block_scheme_sobr', color: '#00FF00' },
               { name: 'bypas_block', color: '#ffffff' },
   
               { name: 'time_full_vnk_text', text: '22' },
               { name: 'polozenie_text', text: '0' },
             ]
           },
           helper2D: [
             { x: 91.30, y: 63.9, w: 1.5, h: 2.0, id: 'close_w1' },
             { x: 88.15, y: 71.8, w: 4.0, h: 2.6, id: 'open_vn' },   //  win 1  //  «Ручной»
           ]
         },
         startTime: timeDiff + 184,
         human: true,
       },
       // окно ВН  // клик ручной
       {
         action: {
           target2D: 'open_vn',
           window2D: {
             newPositionWindow: {  //  wind 2
               x: 1765,
               y: 732
             },
             elements: [
               { name: 'title_open_vn', text: 'Ручной' },
             ],
           },
           helper2D: [
             { x: 92.10, y: 76, w: 3.2, h: 2.5, id: 'close_vn' },   //  wind 2
             { x: 88.40, y: 76, w: 3.3, h: 2.5, id: 'open_vn1' },
           ]
         },
         startTime: timeDiff + 184.2,
         human: true,
       },
       // маленькое окошко ОК
       {
         action: {
           target2D: 'open_vn1',
           window2D: {
             elements: [
               { name: 'status_control_vnk_text', text: 'Ручной' },
               { name: 'uprav_auto_text', color: '#000000' },                     //  #6E6E6E //  #000000;
               { name: 'uprav_rucnoy_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
   
               { name: 'btn_auto', color: '#ffffff', stroke: '#000000' },  //  #C4C4C4 //  #ffffff       //  #000000 
               { name: 'btn_rucnoy', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000 // afk
             ]
           },
           helper2D: [
             { x: 91.30, y: 63.9, w: 1.5, h: 2.0, id: 'close_w1' },
             { x: 83.80, y: 89.4, w: 8.6, h: 2.6, id: 'open_vn' },   //  win 1  // байпас
           ]
         },
         startTime: timeDiff + 184.4,
         human: true,
       },
   
       // окно ВН  //  клик байпас
       {
         scenarioText: 'после «Байпас всех блокировок», затем «Да» ',
         sender: 'Система',
         action: {
           target2D: 'open_vn',
           window2D: {
             newPositionWindow: {  //  wind 2
               x: 1760,
               y: 900
             },
             elements: [
               { name: 'title_open_vn', text: 'Байпас всех блокировок' },
             ],
           },
           helper2D: [
             { x: 91.90, y: 93, w: 3.2, h: 2.5, id: 'close_vn' },   //  wind 2
             { x: 88.20, y: 93, w: 3.3, h: 2.5, id: 'open_vn1' },
           ]
         },
         startTime: timeDiff + 184.6,
         human: true,
       },
   
       // маленькое окошко ОК
       {
         action: {
           target2D: 'open_vn1',
           window2D: {
             elements: [
               { name: 'bypas_block', color: '#00FF00' },
   
               { name: 'status_control_vnk_text', text: 'Ручной' },
               { name: 'uprav_auto_text', color: '#000000' },                     //  #6E6E6E //  #000000;
               { name: 'uprav_rucnoy_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
   
               { name: 'btn_auto', color: '#ffffff', stroke: '#000000' },  //  #C4C4C4 //  #ffffff       //  #000000 
               { name: 'btn_rucnoy', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000 // afk
             ]
           },
           helper2D: [
             { x: 91.30, y: 63.9, w: 1.5, h: 2.0, id: 'close_w1' },
             { x: 88.15, y: 71.8, w: 4.0, h: 2.6, id: 'open_vn' },   //  win 1
           ]
         },
         startTime: timeDiff + 184.8,
         human: true,
       },
   
       {
         scenarioText: 'и после закрываем доп. окно, через крестик.',
         sender: 'Система',
         action: {
           target2D: 'close_w1',
         },
         startTime: timeDiff + 185,
         human: true,
       },
       ////
       ////--------------------------------клапан 318----------------------------------------Открыт. Автоматический в ручной-------------------------------
       {
         scenarioText: 'Нажать на клапан 318, после нажать на клавишу «Ручной», затем «Да»,',
         sender: 'Система',
         action: {
           target2D: 'vn_318_btn',
           window2D: {
             elements: [
               { name: 'title_work_vn', text: 'Управление клапаном 318' },
               { name: 'left_vn', color: '#00FF00' },
               { name: 'right_vn', color: '#00FF00' },
   
               { name: 'circle_1_win1', stroke: '#00FF00' },
               { name: 'circle_2_win1', stroke: '#00FF00' },
   
               { name: 'status_control_vnk_text', text: 'Автоматический' },
               { name: 'status_window_text', text: 'Открыт' },
   
               { name: 'blocks_open', color: '#00FF00' },
               { name: 'blocks_close', color: '#00FF00' },
   
               { name: 'polozenie_button_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
               { name: 'polozenie_button_zakr_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
               { name: 'polozenie_button_stop_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
               { name: 'polozenie_button_reset_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
   
   
               { name: 'uprav_auto_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
               { name: 'uprav_rucnoy_text', color: '#000000' },                     //  #6E6E6E //  #000000;
   
   
               { name: 'btn_auto', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000 // afk
               { name: 'btn_rucnoy', color: '#ffffff', stroke: '#000000' },  //  #C4C4C4 //  #ffffff       //  #000000
               { name: 'btn_open', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000
               { name: 'btn_close', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000
               { name: 'btn_stop', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000
               { name: 'btn_reset', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000
   
               { name: 'block_scheme_sobr', color: '#00FF00' },
               { name: 'bypas_block', color: '#ffffff' },
   
               { name: 'time_full_vnk_text', text: '22' },
               { name: 'polozenie_text', text: '0' },
             ]
           },
           helper2D: [
             { x: 91.30, y: 63.9, w: 1.5, h: 2.0, id: 'close_w1' },
             { x: 88.15, y: 71.8, w: 4.0, h: 2.6, id: 'open_vn' },   //  win 1  //  «Ручной»
           ]
         },
         startTime: timeDiff + 185.2,
         // startTime: timeDiff + 100,
         human: true,
       },
       // окно ВН
       {
         action: {
           target2D: 'open_vn',
           window2D: {
             newPositionWindow: {  //  wind 2
               x: 1765,
               y: 732
             },
             elements: [
               { name: 'title_open_vn', text: 'Ручной' },
             ],
           },
           helper2D: [
             { x: 92.10, y: 76, w: 3.2, h: 2.5, id: 'close_vn' },   //  wind 2
             { x: 88.40, y: 76, w: 3.3, h: 2.5, id: 'open_vn1' },
           ]
         },
         startTime: timeDiff + 185.4,
         human: true,
       },
       // маленькое окошко ОК
       {
         action: {
           target2D: 'open_vn1',
           window2D: {
             elements: [
               { name: 'status_control_vnk_text', text: 'Ручной' },
               { name: 'uprav_auto_text', color: '#000000' },                     //  #6E6E6E //  #000000;
               { name: 'uprav_rucnoy_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
   
               { name: 'btn_auto', color: '#ffffff', stroke: '#000000' },  //  #C4C4C4 //  #ffffff       //  #000000 
               { name: 'btn_rucnoy', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000 // afk
             ]
           },
           helper2D: [
             { x: 91.30, y: 63.9, w: 1.5, h: 2.0, id: 'close_w1' },
             { x: 83.80, y: 89.4, w: 8.6, h: 2.6, id: 'open_vn' },   //  win 1  // байпас
           ]
         },
         startTime: timeDiff + 185.6,
         human: true,
       },
       // окно ВН -> блокировка открытие // NE RABOTAET  //  FIX
       {
         window2D: {
           elements: [
             { name: 'blocks_open', color: '#FF0000' },
             { name: 'blocks_close', color: '#FF0000' },
           ]
         },
         startTime: timeDiff + 186,
       },
       // окно ВН
       {
         scenarioText: 'после «Байпас всех блокировок», затем «Да» ',
         sender: 'Система',
         action: {
           target2D: 'open_vn',
           window2D: {
             newPositionWindow: {  //  wind 2
               x: 1760,
               y: 900
             },
             elements: [
               { name: 'title_open_vn', text: 'Байпас всех блокировок' },
             ],
           },
           helper2D: [
             { x: 91.90, y: 93, w: 3.2, h: 2.5, id: 'close_vn' },   //  wind 2
             { x: 88.20, y: 93, w: 3.3, h: 2.5, id: 'open_vn1' },
           ]
         },
         startTime: timeDiff + 186.2,
         human: true,
       },
   
       // маленькое окошко ОК
       {
         action: {
           target2D: 'open_vn1',
           window2D: {
             elements: [
               { name: 'bypas_block', color: '#00FF00' },
   
               { name: 'status_control_vnk_text', text: 'Ручной' },
               { name: 'uprav_auto_text', color: '#000000' },                     //  #6E6E6E //  #000000;
               { name: 'uprav_rucnoy_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
   
               { name: 'btn_auto', color: '#ffffff', stroke: '#000000' },  //  #C4C4C4 //  #ffffff       //  #000000 
               { name: 'btn_rucnoy', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000 // afk
             ]
           },
           helper2D: [
             { x: 91.30, y: 63.9, w: 1.5, h: 2.0, id: 'close_w1' },
             { x: 88.15, y: 71.8, w: 4.0, h: 2.6, id: 'open_vn' },   //  win 1
           ]
         },
         startTime: timeDiff + 186.4,
         human: true,
       },
       {
         scenarioText: 'и после закрываем доп. окно, через крестик.',
         sender: 'Система',
         action: {
           target2D: 'close_w1',
         },
         startTime: timeDiff + 186.6,
         human: true,
       },
   
       ////--------------------------------клапан 319----------------------------------------Открыт. Автоматический в ручной-------------------------------
       {
         scenarioText: 'Нажать на клапан 319, после нажать на клавишу «Ручной», затем «Да»,',
         sender: 'Система',
         action: {
           target2D: 'vn_319_btn',
           window2D: {
             elements: [
               { name: 'title_work_vn', text: 'Управление клапаном 319' },
               { name: 'left_vn', color: '#00FF00' },
               { name: 'right_vn', color: '#00FF00' },
   
               { name: 'circle_1_win1', stroke: '#00FF00' },
               { name: 'circle_2_win1', stroke: '#00FF00' },
   
               { name: 'status_control_vnk_text', text: 'Автоматический' },
               { name: 'status_window_text', text: 'Открыт' },
   
               { name: 'blocks_open', color: '#00FF00' },
               { name: 'blocks_close', color: '#00FF00' },
   
               { name: 'polozenie_button_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
               { name: 'polozenie_button_zakr_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
               { name: 'polozenie_button_stop_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
               { name: 'polozenie_button_reset_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
   
   
               { name: 'uprav_auto_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
               { name: 'uprav_rucnoy_text', color: '#000000' },                     //  #6E6E6E //  #000000;
   
   
               { name: 'btn_auto', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000 // afk
               { name: 'btn_rucnoy', color: '#ffffff', stroke: '#000000' },  //  #C4C4C4 //  #ffffff       //  #000000
               { name: 'btn_open', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000
               { name: 'btn_close', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000
               { name: 'btn_stop', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000
               { name: 'btn_reset', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000
   
               { name: 'block_scheme_sobr', color: '#00FF00' },
               { name: 'bypas_block', color: '#ffffff' },
   
               { name: 'time_full_vnk_text', text: '22' },
               { name: 'polozenie_text', text: '0' },
             ]
           },
           helper2D: [
             { x: 82.90, y: 45.2, w: 1.5, h: 2.0, id: 'close_w1' },
             { x: 79.80, y: 53.2, w: 4.0, h: 2.6, id: 'open_vn' },   //  win 1  //  «Ручной»
           ]
         },
         startTime: timeDiff + 186.8,
         human: true,
       },
       // окно ВН
       {
         action: {
           target2D: 'open_vn',
           window2D: {
             newPositionWindow: {  //  wind 2
               x: 1663,
               y: 536
             },
             elements: [
               { name: 'title_open_vn', text: 'Ручной' },
             ],
           },
           helper2D: [
             { x: 86.85, y: 56, w: 3.2, h: 2.5, id: 'close_vn' },   //  wind 2
             { x: 83.20, y: 56, w: 3.3, h: 2.5, id: 'open_vn1' },
           ]
         },
         startTime: timeDiff + 187,
         human: true,
       },
       // маленькое окошко ОК
       {
         action: {
           target2D: 'open_vn1',
           window2D: {
             elements: [
               { name: 'status_control_vnk_text', text: 'Ручной' },
               { name: 'uprav_auto_text', color: '#000000' },                     //  #6E6E6E //  #000000;
               { name: 'uprav_rucnoy_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
   
               { name: 'btn_auto', color: '#ffffff', stroke: '#000000' },  //  #C4C4C4 //  #ffffff       //  #000000 
               { name: 'btn_rucnoy', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000 // afk
             ]
           },
           helper2D: [
             { x: 82.90, y: 45.2, w: 1.5, h: 2.0, id: 'close_w1' },
             { x: 75.40, y: 70.6, w: 8.6, h: 2.6, id: 'open_vn' },   //  win 1  // байпас
           ]
         },
         startTime: timeDiff + 187.2,
         human: true,
       },
       // окно ВН -> блокировка открытие
       {
         window2D: {
           elements: [
             { name: 'blocks_open', color: '#FF0000' },
             { name: 'blocks_close', color: '#FF0000' },
           ]
         },
         startTime: timeDiff + 188,
       },
       // окно ВН
       {
         scenarioText: 'после «Байпас всех блокировок», затем «Да» ',
         sender: 'Система',
         action: {
           target2D: 'open_vn',
           window2D: {
             newPositionWindow: {  //  wind 2
               x: 1600,
               y: 717
             },
             elements: [
               { name: 'title_open_vn', text: 'Байпас всех блокировок' },
             ],
           },
           helper2D: [
             { x: 83.80, y: 74.4, w: 3.2, h: 2.5, id: 'close_vn' },   //  wind 2
             { x: 80.20, y: 74.4, w: 3.3, h: 2.5, id: 'open_vn1' },
           ]
         },
         startTime: timeDiff + 188.2,
         human: true,
       },
   
       // маленькое окошко ОК
       {
         action: {
           target2D: 'open_vn1',
           window2D: {
             elements: [
               { name: 'bypas_block', color: '#00FF00' },
   
               { name: 'status_control_vnk_text', text: 'Ручной' },
               { name: 'uprav_auto_text', color: '#000000' },                     //  #6E6E6E //  #000000;
               { name: 'uprav_rucnoy_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
   
               { name: 'btn_auto', color: '#ffffff', stroke: '#000000' },  //  #C4C4C4 //  #ffffff       //  #000000 
               { name: 'btn_rucnoy', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000 // afk
             ]
           },
           helper2D: [
             { x: 82.90, y: 45.2, w: 1.5, h: 2.0, id: 'close_w1' },
             { x: 75.40, y: 70.6, w: 8.6, h: 2.6, id: 'open_vn' },   //  win 1  
           ]
         },
         startTime: timeDiff + 188.4,
         human: true,
       },
       {
         scenarioText: 'и после закрываем доп. окно, через крестик.',
         sender: 'Система',
         action: {
           target2D: 'close_w1',
         },
         startTime: timeDiff + 188.6,
         human: true,
       },
   
   
   
       ////--------------------------------40---------------------------------------- 
       {
         scenarioText: '40. Нажать на клапан 310, после нажать на клавишу «Открыть», затем «Да» и после закрываем доп. окно через крестик.',
         sender: 'Система',
         action: {
           target2D: 'vn_310_btn',
           window2D: {
             elements: [
               { name: 'btn_open', color: '#ffffff', stroke: '#000000' },  //  #C4C4C4 //  #ffffff       //  #000000
               { name: 'polozenie_button_text', color: '#000000' },                     //  #6E6E6E //  #000000;
   
               { name: 'title_work_vn', text: 'Управление клапаном 310' },
               { name: 'left_vn', color: '#ff1e00' },
               { name: 'right_vn', color: '#ff1e00' },
   
               { name: 'circle_1_win1', stroke: '#ff1e00' },
               { name: 'circle_2_win1', stroke: '#ff1e00' },
   
               { name: 'status_control_vnk_text', text: 'Ручной' },
               { name: 'status_window_text', text: 'Закрыт' },
   
               { name: 'blocks_open', color: '#FF0000' },
               { name: 'blocks_close', color: '#00FF00' },
   
               { name: 'polozenie_button_text', color: '#000000' },                     //  #6E6E6E //  #000000;
               { name: 'polozenie_button_zakr_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
               { name: 'polozenie_button_stop_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
               { name: 'polozenie_button_reset_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
   
   
               { name: 'uprav_auto_text', color: '#000000' },                     //  #6E6E6E //  #000000;
               { name: 'uprav_rucnoy_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
   
   
               { name: 'btn_auto', color: '#ffffff', stroke: '#000000' },  //  #C4C4C4 //  #ffffff       //  #000000 // afk
               { name: 'btn_rucnoy', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000
               { name: 'btn_open', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000
               { name: 'btn_close', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000
               { name: 'btn_stop', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000
               { name: 'btn_reset', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000
   
               { name: 'block_scheme_sobr', color: '#00FF00' },
               { name: 'bypas_block', color: '#00FF00' },
   
               { name: 'time_full_vnk_text', text: '22' },
               { name: 'polozenie_text', text: '0' },
   
             ]
           },
           helper2D: [
             { x: 91.30, y: 63.9, w: 1.5, h: 2.0, id: 'close_w1' },
             { x: 83.80, y: 75.8, w: 4.0, h: 2.6, id: 'open_vn' },   //  win 1  «Открыть»
           ]
         },
         startTime: timeDiff + 188.8,
         human: true,
       },
   
       // окно ВН
       {
         action: {
           target2D: 'open_vn',
           window2D: {
             newPositionWindow: {  //  wind 2
               x: 1765,
               y: 732
             },
             elements: [
               { name: 'title_open_vn', text: 'Открыть' },
             ],
           },
           helper2D: [
             { x: 92.10, y: 76, w: 3.2, h: 2.5, id: 'close_vn' },   //  wind 2
             { x: 88.40, y: 76, w: 3.3, h: 2.5, id: 'open_vn1' },
           ]
         },
         startTime: timeDiff + 189,
         human: true,
       },
       //  маленькое окошко ОК
       {
         action: {
           target2D: 'open_vn1',
           window2D: {
             elements: [
               { name: 'polozenie_button_zakr_text', color: '#000000' },                     //  #6E6E6E //  #000000;
               { name: 'polozenie_button_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
   
               { name: 'btn_close', color: '#ffffff', stroke: '#000000' },  //  #C4C4C4 //  #ffffff       //  #000000 
               { name: 'btn_open', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000 // afk
   
               { name: 'status_window_text', text: 'Открывается' },
   
               { name: 'left_vn', color: '#8F8F8F' },
               { name: 'right_vn', color: '#8F8F8F' },
               { name: 'circle_1_win1', stroke: '#8F8F8F' },
               { name: 'circle_2_win1', stroke: '#8F8F8F' },
   
               { name: 'vnk3_310_l', color: '#8F8F8F' },
               { name: 'vnk3_310_r', color: '#8F8F8F' },
             ]
           },
           helper2D: [
             { x: 91.30, y: 63.9, w: 1.5, h: 2.0, id: 'close_w1' },
             { x: 83.80, y: 89.4, w: 8.6, h: 2.6, id: 'open_vn' },   //  win 1
           ]
         },
         startTime: timeDiff + 189.2,
         human: true,
       },
       //  мигание
       {
         action: {
           window2D: {
             elements: [
               { name: 'left_vn', color: '#00FF00' },
               { name: 'right_vn', color: '#00FF00' },
               { name: 'circle_1_win1', stroke: '#00FF00' },
               { name: 'circle_2_win1', stroke: '#00FF00' },
   
               { name: 'vnk3_310_l', color: '#00FF00' },
               { name: 'vnk3_310_r', color: '#00FF00' },
             ]
           }
         },
         startTime: timeDiff + 190,
       }, {
         action: {
           window2D: {
             elements: [
               { name: 'left_vn', color: '#8F8F8F' },
               { name: 'right_vn', color: '#8F8F8F' },
               { name: 'circle_1_win1', stroke: '#8F8F8F' },
               { name: 'circle_2_win1', stroke: '#8F8F8F' },
   
               { name: 'vnk3_310_l', color: '#8F8F8F' },
               { name: 'vnk3_310_r', color: '#8F8F8F' },
             ]
           }
         },
         startTime: timeDiff + 191,
       }, {
         action: {
           window2D: {
             elements: [
               { name: 'left_vn', color: '#00FF00' },
               { name: 'right_vn', color: '#00FF00' },
               { name: 'circle_1_win1', stroke: '#00FF00' },
               { name: 'circle_2_win1', stroke: '#00FF00' },
   
               { name: 'vnk3_310_l', color: '#00FF00' },
               { name: 'vnk3_310_r', color: '#00FF00' },
             ]
           }
         },
         startTime: timeDiff + 192,
       }, {
         action: {
           window2D: {
             elements: [
               { name: 'left_vn', color: '#8F8F8F' },
               { name: 'right_vn', color: '#8F8F8F' },
               { name: 'circle_1_win1', stroke: '#8F8F8F' },
               { name: 'circle_2_win1', stroke: '#8F8F8F' },
   
               { name: 'vnk3_310_l', color: '#8F8F8F' },
               { name: 'vnk3_310_r', color: '#8F8F8F' },
             ]
           }
         },
         startTime: timeDiff + 193,
       }, {
         action: {
           window2D: {
             elements: [
               { name: 'status_window_text', text: 'Открыт' },
   
               { name: 'left_vn', color: '#00FF00' },
               { name: 'right_vn', color: '#00FF00' },
               { name: 'circle_1_win1', stroke: '#00FF00' },
               { name: 'circle_2_win1', stroke: '#00FF00' },
   
               { name: 'vnk3_310_l', color: '#00FF00' },
               { name: 'vnk3_310_r', color: '#00FF00' },
             ]
           }
         },
         startTime: timeDiff + 194,
       },
       {
         action: {
           target2D: 'close_w1',
           helper2D: [
             { x: 91.30, y: 63.9, w: 1.5, h: 2.0, id: 'close_w1' },
             { x: 83.80, y: 89.4, w: 8.6, h: 2.6, id: 'open_vn' },   //  win 1
           ]
         },
         startTime: timeDiff + 194.2,
         human: true,
       },
   
   
       // окно ВН
       ////--------------------------------41---------------------------------------- 
       ////--------------------------------клапан 318----------------------------------------Открыт. Открыт в закрыт-------------------------------
       {
         scenarioText: '41. Аналогично п.40, только происходит закрытие. Как только начнёт клапан мигать красным цветом на доп. окне, стоит нажать через пару секунд на клавишу «Стоп» и после повторить операцию 2-3 раза с нажатием на «Закрыть» и «Стоп».',
         sender: 'Система',
         action: {
           target2D: 'vn_318_btn',
           window2D: {
             elements: [
               { name: 'btn_open', color: '#ffffff', stroke: '#000000' },  //  #C4C4C4 //  #ffffff       //  #000000
               { name: 'polozenie_button_text', color: '#000000' },                     //  #6E6E6E //  #000000;
   
               { name: 'title_work_vn', text: 'Управление клапаном 318' },
               { name: 'left_vn', color: '#00FF00' },
               { name: 'right_vn', color: '#00FF00' },
   
               { name: 'circle_1_win1', stroke: '#00FF00' },
               { name: 'circle_2_win1', stroke: '#00FF00' },
   
               { name: 'status_control_vnk_text', text: 'Ручной' },
               { name: 'status_window_text', text: 'Открыт' },
   
               { name: 'blocks_open', color: '#FF0000' },
               { name: 'blocks_close', color: '#FF0000' },
   
               { name: 'polozenie_button_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
               { name: 'polozenie_button_zakr_text', color: '#000000' },                     //  #6E6E6E //  #000000;
               { name: 'polozenie_button_stop_text', color: '#000000' },                     //  #6E6E6E //  #000000;
               { name: 'polozenie_button_reset_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
   
   
               { name: 'uprav_auto_text', color: '#000000' },                     //  #6E6E6E //  #000000;
               { name: 'uprav_rucnoy_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
   
               { name: 'btn_auto', color: '#ffffff', stroke: '#000000' },  //  #C4C4C4 //  #ffffff       //  #000000 // afk
               { name: 'btn_rucnoy', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000
               { name: 'btn_open', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000
               { name: 'btn_close', color: '#ffffff', stroke: '#000000' },  //  #C4C4C4 //  #ffffff       //  #000000
               { name: 'btn_stop', color: '#ffffff', stroke: '#000000' },  //  #C4C4C4 //  #ffffff       //  #000000
               { name: 'btn_reset', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000
   
               { name: 'block_scheme_sobr', color: '#00FF00' },
               { name: 'bypas_block', color: '#00FF00' },
   
               { name: 'time_full_vnk_text', text: '22' },
               { name: 'polozenie_text', text: '0' },
   
             ]
           },
           helper2D: [
             { x: 91.30, y: 63.9, w: 1.5, h: 2.0, id: 'close_w1' },
             { x: 88.2, y: 75.8, w: 4.0, h: 2.6, id: 'open_vn' },   //  win 1  Закрыть
           ]
         },
         startTime: timeDiff + 194.4,
         human: true,
       },
       // окно ВН  // закрыть
       {
         action: {
           target2D: 'open_vn',
           window2D: {
             newPositionWindow: {  //  wind 2
               x: 1765,
               y: 732
             },
             elements: [
               { name: 'title_open_vn', text: 'Закрыть' },
             ],
           },
           helper2D: [
             { x: 92.10, y: 76, w: 3.2, h: 2.5, id: 'close_vn' },   //  wind 2
             { x: 88.40, y: 76, w: 3.3, h: 2.5, id: 'open_vn1' },
           ]
         },
         startTime: timeDiff + 194.6,
         human: true,
       },
       //  маленькое окошко ОК //  ВН Закрывается
       {
         action: {
           target2D: 'open_vn1',
           window2D: {
             elements: [
               { name: 'polozenie_button_zakr_text', color: '#000000' },                     //  #6E6E6E //  #000000;
               { name: 'polozenie_button_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
   
               { name: 'btn_close', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000 
               { name: 'btn_open', color: '#ffffff', stroke: '#000000' },  //  #C4C4C4 //  #ffffff       //  #000000 // afk
   
               { name: 'status_window_text', text: 'Закрывается' },
   
               { name: 'left_vn', color: '#8F8F8F' },
               { name: 'right_vn', color: '#8F8F8F' },
               { name: 'circle_1_win1', stroke: '#8F8F8F' },
               { name: 'circle_2_win1', stroke: '#8F8F8F' },
   
               { name: 'vnk3_310_l', color: '#8F8F8F' },
               { name: 'vnk3_310_r', color: '#8F8F8F' },
             ]
           },
           helper2D: [
             { x: 83.80, y: 78.8, w: 8.6, h: 2.6, id: 'win_posle_1_stop_btn' }, //  win 1 //  СТОП
             { x: 91.30, y: 63.9, w: 1.5, h: 2.0, id: 'close_w1' },
             { x: 88.2, y: 75.8, w: 4.0, h: 2.6, id: 'open_vn' },   //  win 1  Закрыть
           ]
         },
         startTime: timeDiff + 194.8,
         human: true,
       },
       //мигание пару секунд
       {
         action: {
           window2D: {
             elements: [
               { name: 'left_vn', color: '#FF0000' },
               { name: 'right_vn', color: '#FF0000' },
               { name: 'circle_1_win1', stroke: '#FF0000' },
               { name: 'circle_2_win1', stroke: '#FF0000' },
   
               { name: 'vnk3_310_l', color: '#FF0000' },
               { name: 'vnk3_310_r', color: '#FF0000' },
             ]
           },
         },
         startTime: timeDiff + 195.3,
       }, {
         action: {
           window2D: {
             elements: [
               { name: 'left_vn', color: '#8F8F8F' },
               { name: 'right_vn', color: '#8F8F8F' },
               { name: 'circle_1_win1', stroke: '#8F8F8F' },
               { name: 'circle_2_win1', stroke: '#8F8F8F' },
   
               { name: 'vnk3_310_l', color: '#8F8F8F' },
               { name: 'vnk3_310_r', color: '#8F8F8F' },
             ]
           },
         },
         startTime: timeDiff + 196,
       }, {
         action: {
           window2D: {
             elements: [
               { name: 'left_vn', color: '#FF0000' },
               { name: 'right_vn', color: '#FF0000' },
               { name: 'circle_1_win1', stroke: '#FF0000' },
               { name: 'circle_2_win1', stroke: '#FF0000' },
   
               { name: 'vnk3_310_l', color: '#FF0000' },
               { name: 'vnk3_310_r', color: '#FF0000' },
             ]
           },
         },
         startTime: timeDiff + 197,
       }, {
         action: {
           window2D: {
             elements: [
               { name: 'left_vn', color: '#8F8F8F' },
               { name: 'right_vn', color: '#8F8F8F' },
               { name: 'circle_1_win1', stroke: '#8F8F8F' },
               { name: 'circle_2_win1', stroke: '#8F8F8F' },
   
               { name: 'vnk3_310_l', color: '#8F8F8F' },
               { name: 'vnk3_310_r', color: '#8F8F8F' },
             ]
           },
   
         },
         startTime: timeDiff + 198,
       },
   
       // ОКНО ВН  // КЛИК СТОП
       {
         action: {
           target2D: 'win_posle_1_stop_btn',
           window2D: {
             elements: [
               { name: 'status_window_text', text: 'Нет данных' },
               { name: 'polozenie_button_text', color: '#000000' },                     //  #6E6E6E //  #000000;
               { name: 'polozenie_button_zakr_text', color: '#000000' },                     //  #6E6E6E //  #000000;
   
               { name: 'btn_open', color: '#ffffff', stroke: '#000000' },  //  #C4C4C4 //  #ffffff       //  #000000
               { name: 'btn_close', color: '#ffffff', stroke: '#000000' },  //  #C4C4C4 //  #ffffff       //  #000000
             ]
           },
         },
         startTime: timeDiff + 198.2,
         human: true
       },
       ////--------------------------------клапан 318----------------------------------------Закрыт. Закрыт в закрыт-------------------------------    //  1
       // повторить 2-3 раза. Будет 2
       // окно ВН  // закрыть
       {
         action: {
           target2D: 'open_vn',
           window2D: {
             newPositionWindow: {  //  wind 2
               x: 1765,
               y: 732
             },
             elements: [
               { name: 'title_open_vn', text: 'Закрыть' },
             ],
           },
           helper2D: [
             { x: 92.10, y: 76, w: 3.2, h: 2.5, id: 'close_vn' },   //  wind 2
             { x: 88.40, y: 76, w: 3.3, h: 2.5, id: 'open_vn1' },
           ]
         },
         startTime: timeDiff + 198.4,
         human: true,
       },
       //  маленькое окошко ОК //  ВН Закрывается
       {
         action: {
           target2D: 'open_vn1',
           window2D: {
             elements: [
               { name: 'polozenie_button_zakr_text', color: '#000000' },                     //  #6E6E6E //  #000000;
               { name: 'polozenie_button_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
   
               { name: 'btn_close', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000 
               { name: 'btn_open', color: '#ffffff', stroke: '#000000' },  //  #C4C4C4 //  #ffffff       //  #000000 // afk
   
               { name: 'status_window_text', text: 'Закрывается' },
   
               { name: 'left_vn', color: '#8F8F8F' },
               { name: 'right_vn', color: '#8F8F8F' },
               { name: 'circle_1_win1', stroke: '#8F8F8F' },
               { name: 'circle_2_win1', stroke: '#8F8F8F' },
   
               { name: 'vnk3_310_l', color: '#8F8F8F' },
               { name: 'vnk3_310_r', color: '#8F8F8F' },
             ]
           },
           helper2D: [
             { x: 83.80, y: 78.8, w: 8.6, h: 2.6, id: 'win_posle_1_stop_btn' }, //  win 1 //  СТОП
             { x: 91.30, y: 63.9, w: 1.5, h: 2.0, id: 'close_w1' },
             { x: 88.2, y: 75.8, w: 4.0, h: 2.6, id: 'open_vn' },   //  win 1  Закрыть
           ]
         },
         startTime: timeDiff + 198.6,
         human: true,
       },
       //мигание пару секунд
       {
         action: {
           window2D: {
             elements: [
               { name: 'left_vn', color: '#FF0000' },
               { name: 'right_vn', color: '#FF0000' },
               { name: 'circle_1_win1', stroke: '#FF0000' },
               { name: 'circle_2_win1', stroke: '#FF0000' },
   
               { name: 'vnk3_310_l', color: '#FF0000' },
               { name: 'vnk3_310_r', color: '#FF0000' },
             ]
           },
         },
         startTime: timeDiff + 199.3,
       }, {
         action: {
           window2D: {
             elements: [
               { name: 'left_vn', color: '#8F8F8F' },
               { name: 'right_vn', color: '#8F8F8F' },
               { name: 'circle_1_win1', stroke: '#8F8F8F' },
               { name: 'circle_2_win1', stroke: '#8F8F8F' },
   
               { name: 'vnk3_310_l', color: '#8F8F8F' },
               { name: 'vnk3_310_r', color: '#8F8F8F' },
             ]
           },
         },
         startTime: timeDiff + 200,
       }, {
         action: {
           window2D: {
             elements: [
               { name: 'left_vn', color: '#FF0000' },
               { name: 'right_vn', color: '#FF0000' },
               { name: 'circle_1_win1', stroke: '#FF0000' },
               { name: 'circle_2_win1', stroke: '#FF0000' },
   
               { name: 'vnk3_310_l', color: '#FF0000' },
               { name: 'vnk3_310_r', color: '#FF0000' },
             ]
           },
         },
         startTime: timeDiff + 201,
       }, {
         action: {
           window2D: {
             elements: [
               { name: 'left_vn', color: '#8F8F8F' },
               { name: 'right_vn', color: '#8F8F8F' },
               { name: 'circle_1_win1', stroke: '#8F8F8F' },
               { name: 'circle_2_win1', stroke: '#8F8F8F' },
   
               { name: 'vnk3_310_l', color: '#8F8F8F' },
               { name: 'vnk3_310_r', color: '#8F8F8F' },
             ]
           },
   
         },
         startTime: timeDiff + 202,
       },
       // ОКНО ВН  // КЛИК СТОП
       {
         action: {
           target2D: 'win_posle_1_stop_btn',
           window2D: {
             elements: [
               { name: 'status_window_text', text: 'Нет данных' },
               { name: 'polozenie_button_text', color: '#000000' },                     //  #6E6E6E //  #000000;
               { name: 'polozenie_button_zakr_text', color: '#000000' },                     //  #6E6E6E //  #000000;
   
               { name: 'btn_open', color: '#ffffff', stroke: '#000000' },  //  #C4C4C4 //  #ffffff       //  #000000
               { name: 'btn_close', color: '#ffffff', stroke: '#000000' },  //  #C4C4C4 //  #ffffff       //  #000000
             ]
           },
           helper2D: [
             { x: 91.30, y: 63.9, w: 1.5, h: 2.0, id: 'close_w1' },
             { x: 88.2, y: 75.8, w: 4.0, h: 2.6, id: 'open_vn' },   //  win 1  Закрыть
           ]
         },
         startTime: timeDiff + 202.2,
         human: true
       },
       ///////
       // окно ВН  // закрыть
       {
         action: {
           target2D: 'open_vn',
           window2D: {
             newPositionWindow: {  //  wind 2
               x: 1765,
               y: 732
             },
             elements: [
               { name: 'title_open_vn', text: 'Закрыть' },
             ],
           },
           helper2D: [
             { x: 92.10, y: 76, w: 3.2, h: 2.5, id: 'close_vn' },   //  wind 2
             { x: 88.40, y: 76, w: 3.3, h: 2.5, id: 'open_vn1' },
           ]
         },
         startTime: timeDiff + 202.4,
         human: true,
       },
       //  маленькое окошко ОК //  ВН Закрывается
       {
         action: {
           target2D: 'open_vn1',
           window2D: {
             elements: [
               { name: 'polozenie_button_zakr_text', color: '#000000' },                     //  #6E6E6E //  #000000;
               { name: 'polozenie_button_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
   
               { name: 'btn_close', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000 
               { name: 'btn_open', color: '#ffffff', stroke: '#000000' },  //  #C4C4C4 //  #ffffff       //  #000000 // afk
   
               { name: 'status_window_text', text: 'Закрывается' },
   
               { name: 'left_vn', color: '#8F8F8F' },
               { name: 'right_vn', color: '#8F8F8F' },
               { name: 'circle_1_win1', stroke: '#8F8F8F' },
               { name: 'circle_2_win1', stroke: '#8F8F8F' },
   
               { name: 'vnk3_310_l', color: '#8F8F8F' },
               { name: 'vnk3_310_r', color: '#8F8F8F' },
             ]
           },
           helper2D: [
             { x: 83.80, y: 78.8, w: 8.6, h: 2.6, id: 'win_posle_1_stop_btn' }, //  win 1 //  СТОП
             { x: 91.30, y: 63.9, w: 1.5, h: 2.0, id: 'close_w1' },
             { x: 88.2, y: 75.8, w: 4.0, h: 2.6, id: 'open_vn' },   //  win 1  Закрыть
           ]
         },
         startTime: timeDiff + 202.6,
         human: true,
       },
       //мигание пару секунд
       {
         action: {
           window2D: {
             elements: [
               { name: 'left_vn', color: '#FF0000' },
               { name: 'right_vn', color: '#FF0000' },
               { name: 'circle_1_win1', stroke: '#FF0000' },
               { name: 'circle_2_win1', stroke: '#FF0000' },
   
               { name: 'vnk3_310_l', color: '#FF0000' },
               { name: 'vnk3_310_r', color: '#FF0000' },
             ]
           },
         },
         startTime: timeDiff + 203.3,
       }, {
         action: {
           window2D: {
             elements: [
               { name: 'left_vn', color: '#8F8F8F' },
               { name: 'right_vn', color: '#8F8F8F' },
               { name: 'circle_1_win1', stroke: '#8F8F8F' },
               { name: 'circle_2_win1', stroke: '#8F8F8F' },
   
               { name: 'vnk3_310_l', color: '#8F8F8F' },
               { name: 'vnk3_310_r', color: '#8F8F8F' },
             ]
           },
         },
         startTime: timeDiff + 204,
       }, {
         action: {
           window2D: {
             elements: [
               { name: 'left_vn', color: '#FF0000' },
               { name: 'right_vn', color: '#FF0000' },
               { name: 'circle_1_win1', stroke: '#FF0000' },
               { name: 'circle_2_win1', stroke: '#FF0000' },
   
               { name: 'vnk3_310_l', color: '#FF0000' },
               { name: 'vnk3_310_r', color: '#FF0000' },
             ]
           },
         },
         startTime: timeDiff + 205,
       }, {
         action: {
           window2D: {
             elements: [
               { name: 'left_vn', color: '#8F8F8F' },
               { name: 'right_vn', color: '#8F8F8F' },
               { name: 'circle_1_win1', stroke: '#8F8F8F' },
               { name: 'circle_2_win1', stroke: '#8F8F8F' },
   
               { name: 'vnk3_310_l', color: '#8F8F8F' },
               { name: 'vnk3_310_r', color: '#8F8F8F' },
             ]
           },
   
         },
         startTime: timeDiff + 206,
       },
       ////--------------------------------клапан 318----------------------------------------Закрыт. Закрыт в закрыт-------------------------------    //  2
       // ОКНО ВН  // КЛИК СТОП
       {
         action: {
           target2D: 'win_posle_1_stop_btn',
           window2D: {
             elements: [
               { name: 'status_window_text', text: 'Нет данных' },
               { name: 'polozenie_button_text', color: '#000000' },                     //  #6E6E6E //  #000000;
               { name: 'polozenie_button_zakr_text', color: '#000000' },                     //  #6E6E6E //  #000000;
   
               { name: 'btn_open', color: '#ffffff', stroke: '#000000' },  //  #C4C4C4 //  #ffffff       //  #000000
               { name: 'btn_close', color: '#ffffff', stroke: '#000000' },  //  #C4C4C4 //  #ffffff       //  #000000
             ]
           },
           helper2D: [
             { x: 91.30, y: 63.9, w: 1.5, h: 2.0, id: 'close_w1' },
           ],
         },
         startTime: timeDiff + 206.2,
         human: true
       },
       {
         action: {
           target2D: 'close_w1',
         },
         startTime: timeDiff + 206.3,
         human: true,
       },
   
   
   
   
       ////--------------------------------42---------------------------------------- 
       ////--------------------------------клапан 319----------------------------------------Открыт. Открыт в закрыт-------------------------------
       {
         scenarioText: '42. Аналогично п.40 только закрываем клапан 319.',
         sender: 'Система',
         action: {
           target2D: 'vn_319_btn',
           window2D: {
             elements: [
               { name: 'title_work_vn', text: 'Управление клапаном 319' },
               { name: 'left_vn', color: '#00FF00' },
               { name: 'right_vn', color: '#00FF00' },
   
               { name: 'circle_1_win1', stroke: '#00FF00' },
               { name: 'circle_2_win1', stroke: '#00FF00' },
   
               { name: 'status_control_vnk_text', text: 'Ручной' },
               { name: 'status_window_text', text: 'Открыт' },
   
               { name: 'blocks_open', color: '#ff1e00' },
               { name: 'blocks_close', color: '#00FF00' },
   
               { name: 'polozenie_button_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
               { name: 'polozenie_button_zakr_text', color: '#000000' },                     //  #6E6E6E //  #000000;
               { name: 'polozenie_button_stop_text', color: '#000000' },                     //  #6E6E6E //  #000000;
               { name: 'polozenie_button_reset_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
   
   
               { name: 'uprav_auto_text', color: '#000000' },                     //  #6E6E6E //  #000000;
               { name: 'uprav_rucnoy_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
   
   
               { name: 'btn_auto', color: '#ffffff', stroke: '#000000' },  //  #C4C4C4 //  #ffffff       //  #000000 // afk
               { name: 'btn_rucnoy', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000
               { name: 'btn_open', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000
               { name: 'btn_close', color: '#ffffff', stroke: '#000000' },  //  #C4C4C4 //  #ffffff       //  #000000
               { name: 'btn_stop', color: '#ffffff', stroke: '#000000' },  //  #C4C4C4 //  #ffffff       //  #000000
               { name: 'btn_reset', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000
   
               { name: 'block_scheme_sobr', color: '#00FF00' },
               { name: 'bypas_block', color: '#ffffff' },
   
               { name: 'time_full_vnk_text', text: '22' },
               { name: 'polozenie_text', text: '0' },
             ]
           },
           helper2D: [
             { x: 82.90, y: 45.2, w: 1.5, h: 2.0, id: 'close_w1' },
             { x: 79.80, y: 57.2, w: 4.0, h: 2.6, id: 'open_vn' },   //  клапан 319 //  win 1  //  "Закрыть"
           ]
         },
         startTime: timeDiff + 206.4,
         human: true,
       },
       {
         action: {
           target2D: 'open_vn',  // окно ВН  "Закрыть"
           window2D: {
             newPositionWindow: {  //  wind 2
               x: 1640,
               y: 583
             },
             elements: [
               { name: 'title_open_vn', text: 'Закрыть' },
             ],
           },
           helper2D: [
             { x: 85.75, y: 60.8, w: 3.2, h: 2.5, id: 'close_vn' },   //  wind 2
             { x: 82.15, y: 60.8, w: 3.3, h: 2.5, id: 'open_vn1' },
           ]
         },
         startTime: timeDiff + 206.6,
         human: true,
       },
       {
         action: {
           target2D: 'open_vn1', // маленькое окошко ДА/НЕТ
           window2D: {
             elements: [
               { name: 'status_control_vnk_text', text: 'Закрывается' },
               { name: 'uprav_auto_text', color: '#000000' },                     //  #6E6E6E //  #000000;
               { name: 'uprav_rucnoy_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
   
               { name: 'btn_auto', color: '#ffffff', stroke: '#000000' },  //  #C4C4C4 //  #ffffff       //  #000000 
               { name: 'btn_rucnoy', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000 // afk
   
               { name: 'polozenie_button_zakr_text', color: '#6E6E6E' },                     //  #6E6E6E //  #000000;
               { name: 'btn_close', color: '#ffffff', stroke: '#6E6E6E' },  //  #C4C4C4 //  #ffffff       //  #000000
             ]
           },
           helper2D: [
             { x: 82.90, y: 45.2, w: 1.5, h: 2.0, id: 'close_w1' },
           ]
         },
         startTime: timeDiff + 206.8,
         human: true,
       },
       //мигание пару секунд
       {
         action: {
           window2D: {
             elements: [
               { name: 'left_vn', color: '#FF0000' },
               { name: 'right_vn', color: '#FF0000' },
               { name: 'circle_1_win1', stroke: '#FF0000' },
               { name: 'circle_2_win1', stroke: '#FF0000' },
   
               { name: 'vnk3_319_l', color: '#FF0000' },
               { name: 'vnk3_319_r', color: '#FF0000' },
             ]
           },
         },
         startTime: timeDiff + 207.8,
       }, {
         action: {
           window2D: {
             elements: [
               { name: 'left_vn', color: '#8F8F8F' },
               { name: 'right_vn', color: '#8F8F8F' },
               { name: 'circle_1_win1', stroke: '#8F8F8F' },
               { name: 'circle_2_win1', stroke: '#8F8F8F' },
   
               { name: 'vnk3_319_l', color: '#8F8F8F' },
               { name: 'vnk3_319_r', color: '#8F8F8F' },
             ]
           },
         },
         startTime: timeDiff + 208.8,
       }, {
         action: {
           window2D: {
             elements: [
               { name: 'left_vn', color: '#FF0000' },
               { name: 'right_vn', color: '#FF0000' },
               { name: 'circle_1_win1', stroke: '#FF0000' },
               { name: 'circle_2_win1', stroke: '#FF0000' },
   
               { name: 'vnk3_319_l', color: '#FF0000' },
               { name: 'vnk3_319_r', color: '#FF0000' },
   
               { name: 'status_control_vnk_text', text: 'Закрыт' },
               { name: 'polozenie_button_text', color: '#6E6E6E' },
               { name: 'btn_open', color: '#ffffff', stroke: '#000000' },  //  #C4C4C4 //  #ffffff       //  #000000
             ]
           },
         },
         startTime: timeDiff + 209.8,
       },
   
       {
         action: {
           target2D: 'close_w1',
         },
         startTime: timeDiff + 210,
         human: true,
       },
       */
  ],
  [ // Второй сценарий
    {
      text: 'Заменить1',
      action: {
        target: 'kl021',
        position: { x: 0.2 },
        rotation: {},
      },
      duration: 3
    },
    {
      text: 'Заменить1',
      action: {
        target: 'kl019',
        position: {},
        rotation: { y: 90 },
      },
      duration: 3
    },
  ],
]

// Массив исходных состояний
let startState2D = [
  [// Первый сценарий
    { name: 'kl028', color: '#00FF00' },
    { name: 'circle_1_kl028', stroke: '#00FF00' },
    { name: 'circle_2_kl028', stroke: '#00FF00' },
    { name: 'kl028_proc', text: '100' },
    { name: 'kl007', color: '#00FF00' },
    { name: 'circle_1_kl007', stroke: '#00FF00' },
    { name: 'circle_2_kl007', stroke: '#00FF00' },
    { name: 'kl007_proc', text: '100' },
    { name: 'circle_1_kl025', stroke: '#00FF00' },
    ///// КУЧА старых 2д исчезла. НАЙТИ!!!!
    { name: 'VNK1_vnk_1', color: '#ff0000' },
    { name: 'vn_132', color: '#00FF00' },
    { name: 'vn_117', color: '#00FF00' },
    { name: 'vn_132_l', color: '#00FF00' },
    { name: 'vn_116', color: '#00FF00' },
    { name: 'vn_116_l', color: '#00FF00' },
    { name: '1PS_03_square', color: '#00FF00' },
    { name: '1PS_05_square', color: '#00FF00' },
    { name: 'VNK1_Avto', text: 'Циклический' },
    { name: 'VNK1_Dutyo', text: 'Нагрев-Отдел.' },
    { name: 'VNK1_Vremya_nagreva', text: '109' },
    { name: 'VNK1_Vremya_dutya', text: '60' },
    { name: 'VNK1_Vremya_otdelen', text: '0' },
  ]
]
let startState3D = [
  [// Первый сценарий
    // { name: 'PhoneButton000', position: { x: 0.2 } },
    // { name: 'PhoneButton002', rotation: { y: 90 } },
    { id: '6c116935-27e8-4508-bbbd-e16306343c49', material: 'Unic_ScaleDot_donor_green' },
    { id: '0376bd70-dc53-46d7-a9b6-9f2a0fbe9a44', material: 'Unic_progress bar_on' },
    { name: 'Clone_0_progress bar142', material: 'Unic_progress bar_on' },
    { name: 'Clone_1_progress bar142', material: 'Unic_progress bar_on' },
    { name: 'Clone_2_progress bar142', material: 'Unic_progress bar_on' },
    { name: 'Clone_3_progress bar142', material: 'Unic_progress bar_on' },
    { name: 'Clone_4_progress bar142', material: 'Unic_progress bar_on' },
    { name: 'Lamp_Green_023', material: 'Unic_Lamp_Green_On' },

    { name: 'vozNagr1_1', number: '1207' },
    { name: 'vozNagr1_2', number: '289.5' },
    { name: 'vozNagr2_1', number: '1217' },
    { name: 'vozNagr2_2', number: '190.8' },
    { name: 'vozNagr3_1', number: '1255' },
    { name: 'vozNagr3_2', number: '125.9' },
    { name: 'rashodSmeshGaza_1', number: '000.0' },
    { name: 'rashodSmeshGaza_2', number: '000.1' },
    { name: 'rashodSmeshGaza_3', number: '000.0' },
    { name: 'rashodVozdyhGor_1', number: '000.1' },
    { name: 'rashodVozdyhGor_2', number: '000.1' },
    { name: 'rashodVozdyhGor_3', number: '000.2' },
    { name: 'davVozGorBVN', number: '09.90' },
    { name: 'rashodSmeshGaza_1_r', number: '023.4', color: 'red' },
    { name: 'rashodSmeshGaza_2_r', number: '021.1', color: 'red' },
    { name: 'rashodSmeshGaza_3_r', number: '022.5', color: 'red' },
    { name: 'rashodVozdyhGor_1_r', number: '023.4', color: 'red' },
    { name: 'rashodVozdyhGor_2_r', number: '021.5', color: 'red' },
    { name: 'rashodVozdyhGor_3_r', number: '021.4', color: 'red' },
    { name: 'klapPrirGazaBRU_1_r', number: '003.0', color: 'red' },
    { name: 'klapPrirGazaBRU_2_r', number: '000.9', color: 'red' },
    { name: 'klapPrirGazaBRU_3_r', number: '015.9', color: 'red' },
    { name: 'smesKlapBRU_1_r', number: '000.8', color: 'red' },
    { name: 'smesKlapBRU_2_r', number: '002.1', color: 'red' },
    { name: 'obshKlapVozGorBRU_r', number: '001.8', color: 'red' },
    { name: 'pKolGaz', number: '0000', },
    { name: 'fff', number: '0000', },
    { name: 'fff', number: '0000', },
    { name: 'fff', number: '0000', },
    { name: 'fff', number: '0000', },
    { name: 'fff', number: '0000', },
    { name: 'fff', number: '0000', },
    { name: 'fff', number: '0000', },
    { name: 'fff', number: '0000', },
    { name: 'fff', number: '0000', },
    { name: 'fff', number: '0000', },
    { name: 'fff', number: '0000', },
    { name: 'fff', number: '0000', },
    { name: 'fff', number: '0000', },
    { name: 'fff', number: '0000', },
    { name: 'fff', number: '0000', },
    { name: 'fff', number: '0000', },
    { name: 'fff', number: '0000', },
    { name: 'fff', number: '0000', },
    { name: 'fff', number: '0000', },
    { name: 'fff', number: '0000', },
    { name: 'fff', number: '0000', },
    { name: 'fff', number: '0000', },
    { name: 'fff', number: '0000', },
    { name: 'fff', number: '0000', },
  ]
]
